{"pageProps":{"note":{"id":"0arq6td8yh1etl2v21safjh","title":"Chapter 190 - I Reject Your Reality and Substitute My Own","desc":"","updated":1655838050694,"created":1653807824429,"custom":{},"fname":"volume-3.chapter-190","type":"note","vault":{"fsPath":"vault"},"contentHash":"0bc348e6dfba2bfba17288a456c335f7","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-190","id":"0arq6td8yh1etl2v21safjh","vaultName":"vault"},"value":"volume-3.chapter-191","position":{"start":{"line":121,"column":3,"offset":10600},"end":{"line":121,"column":27,"offset":10624},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-191"}},{"from":{"fname":"volume-3.chapter-189","id":"z128jm19na7ws58qrkqdk0z","vaultName":"vault"},"type":"backlink","position":{"start":{"line":75,"column":3,"offset":10002},"end":{"line":75,"column":27,"offset":10026},"indent":[]},"value":"volume-3.chapter-190"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-190---i-reject-your-reality-and-substitute-my-own\">Chapter 190 - I Reject Your Reality and Substitute My Own<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-190---i-reject-your-reality-and-substitute-my-own\"></a></h1>\n<p>\"So, what did you find through your meditation?\" Al inquired. He and Guy were standing facing each other in the impromptu sparring area.</p>\n<p>\"I'm going to do it now. But I will need you to do a few things for me to test some stuff out,\" Guy answered as he extended his arms to his side, with open palms facing towards the sky. He closed his eyes and started to call out the mana from his core and directed it out his palms.</p>\n<p>A translucent mist started to emanate from Guy's hands, like a humidifier. Interestingly, instead of diffusing into the atmosphere, it hung in place and spread outwards. Within minutes, a heavy mist enveloped the sparring field, fully encompassing Guy's entire mana domain.</p>\n<p>\"What does it feel like to you?\" Guy inquired.</p>\n<p>\"It's definitely not water or any kind of gas for that matter,\" Al answered. He extended his tongue outwards and licked the air. He then sniffed multiple times and narrowed his eyes. \"Has no taste or smell.\"</p>\n<p>\"It's mana,\" Al responded after observing the area with his mana sense. Suddenly, his eyes widened in shock. \"The mana is tethered to the atmospheric mana. This is interesting it isn't displacing it at all!\"</p>\n<p>\"Teacher Jeeves,\" Markus called out from the side. \"What does that signify?\" Jean perked up as well, directing her full attention to Uncle Jeeves' explanation.</p>\n<p>\"Generally, when a mage exudes mana from their core into the atmosphere it displaces the existing mana. This is also one of the ways to take full control of your mana domain, although it is extremely inefficient. Usually, mages prefer to recruit the atmospheric mana with spells, just like how Cleo did during your fight.\"</p>\n<p>\"That being said, although your Master is releasing the mana from his core into the environment, it is not actually displacing the existing mana. Instead, his mana seems to unify itself with the atmospheric mana. This means that you and I can still use the atmospheric mana perfectly.\" Al waved his hand causing a small tornado to form in his palms.</p>\n<p>\"Not that it was an issue in the first place. With our cultivation realm gap, retaking control of the domain is trivial,\" he added as he dispersed the tornado.</p>\n<p>\"Although, this isn't the first time I've seen this method of mana dispersion. It is commonly used by assassins to gain control of their environment without letting their targets know of their presence,\" Al informed.</p>\n<p>\"Alright then, what's next?\" Al asked Guy with anticipation oozing in his voice.</p>\n<p>\"Prepare yourself,\" Guy warned as he closed his eyes. Al braced himself for what was to come. After living and learning with this Master and Disciple, he realised the importance of vigilance.</p>\n<p>The mist surrounding Al started to flicker and ambiguous images began appearing in their place.</p>\n<p>Guy frowned and said, \"It's harder than it looks. I'll need more practice to perfect this one...\"</p>\n<p>\"Take it slowly,\" Al assuaged.</p>\n<p>Guy hummed and continued. Intermittently, he portrayed a stressed frown which in turn caused the flickering to hasten. Finally, after ten minutes, the scene stabilised.</p>\n<p>\"Woah!\" Al exclaimed as he looked around. His surroundings had warped completely. What was originally an open, outdoor space had now turned into a cavernous room lit by flickering candles and lamps.</p>\n<p>\"Is this the Cloudstrider Sect's Archive?\" Al inquired as he approached the rows of bookshelves present before him. As his hands slid over the wooden shelves, his eyes widened in shock.</p>\n<p>\"This is uncannily realistic,\" Al commented. \"The texture,\" he sniffed, \"the smell,\" he curled his hand into a fist and knocked on the wooden surface eliciting an echoing clack, \"even the sound!\"</p>\n<p>He moved forward a picked out a book from the shelf. He flipped it open and rubbed the paper as well as the bindings. He performed the initial sensory assessments and after he was impressed once again, he proceeded to read the contents.</p>\n<p>\"These don't seem like gibberish. This is all correct isn't it?\" Al asked while turning towards Guy. As he did so, he observed that Guy had assumed a seated lotus position and was in a calm, near-meditative state.</p>\n<p>\"I can't afford to let my concentration waver-\" right as Guy said that the surroundings started to flicker. But Guy immediately grasped his fleeting focus and secured the illusion.</p>\n<p>Al hummed affirmatively and recruited Markus and Jean to help inspect the illusion. The trio started to flip through the books and poke and prod the room and all of its contents. After a full thirty minutes of exhaustive investigation, Al concluded, \"This is beyond anything I have ever seen before. This looks so real that I could've honestly confused it as such if you hadn't expressly indicated that it was an ability.\"</p>\n<p>He turned to Markus and asked, \"What do your senses tell you?\"</p>\n<p>Markus activated his spacetime vision and inspected his surroundings. \"Nothing unusual. They also indicate that this is all real. Everything has mass and a presence.\"</p>\n<p>\"But they technically don't right?\" Al highlighted with some uncertainty. \"These should all be an illusion. If Guy lets go of his concentration, they will all disappear. But everything about the situation here tells me otherwise...\"</p>\n<p>At that instant, the scene started to waver again and finally dissipated.</p>\n<p>\"It's like when someone lies so convincingly that it becomes the truth?\" Guy called out with a bitter smile. \"My ability is an extension of my |Soul Imprint| but in the real world. I can manipulate everything within my mana domain to fit a reality I deem to be the truth.\"</p>\n<p>Al's jaw dropped so hard that, if not for the joint attaching it to his skull, it could very easily drill into the ground and embed itself there permanently.</p>\n<p>\"That is insane!\" Al exclaimed as the concept finally settled in his mind. \"Mind you, I tried everything in my repertoire to tamper with that illusion, but I couldn't affect it at all! For all intents and purposes, my repository of spells and skills tailored to interacting with illusory magic all told me that there was nothing of that sort in effect. This means that the only way to truly dispel this ability is to jolt you, the caster.\"</p>\n<p>\"It's balanced in that way,\" Guy shrugged. \"I have to actively manifest what I'm trying to show you in my mind, including every detail. If it is from a memory, the effect is generally much stronger hence why I chose the Archives as a trial. I don't think it would be so easy to recollect something from further back.\"</p>\n<p>Guy closed his eyes and concentrated once again. The surroundings jittered and shook before another scenery was formed.</p>\n<p>\"This is my office,\" Al indicated. \"No, I can see what you meant. There are minor lapses here and there that easily give it away. Well, this primarily has to do with the fact that I am deeply intimated with this room and I have personally embedded a few formations here and there that are absent in this recreation.\"</p>\n<p>Al reached for one of his draws and pulled it open, revealing an empty space, \"Since you don't know what goes in here, it is empty. I can see the limitations now.\"</p>\n<p>Just to confirm, Al inspected other, familiar, regions of his room and noted the differences as they became known. \"Actually, this is convincing enough to fool most people at lower realms. I don't think Markus or Jean would have been able to differentiate, right?\"</p>\n<p>Jean nodded in response as Markus chimed in. \"I have only been in Teacher Jeeves' rooms a limited number of times. And during those attendances, I wasn't paying much attention to key details. Right now, I could easily be convinced that I am back at the Academy.\"</p>\n<p>Guy dispersed the illusion. As he did so, everyone noticed the sudden lightness of the mist compared to before.</p>\n<p>\"So you consume the mana distributed in your domain the more you use it to portray illusions?\" Al surmised.</p>\n<p>\"There are other factors as well. For instance, the more sensory data I try to mould in, the more mana it consumes. Duration of holding the illusion as well as the scale of the illusion also influences the amount of mana used,\" Guy added.</p>\n<p>\"All in all, it's a pretty good ability. Though I worry that the breadth may be limited with this one,\" Al hinted while tilting his head.</p>\n<p>\"Actually...\" Guy interjected as he elongated the syllable. \"There is an additional aspect to this ability.\"</p>\n<p>\"What is it?\"</p>\n<p>\"Well,\" Guy hummed as he searched for the right words. \"You can think of my ability as being able to manipulate reality, correct?\"</p>\n<p>After receiving acknowledging nods from his audience, he said, \"Till now, I've only shown how to manipulate the non-sentient entities in the environment. My ability also encompasses sentient beings.\"</p>\n<p>\"Can you expound on that?\"</p>\n<p>\"Again, it's easier to demonstrate. I will use my ability on you, Teacher Jeeves,\" Guy warned.</p>\n<p>Guy exhaled loudly and closed his eyes. After a short minute, he pointed at Al's face and said, \"You are clean-shaven.\"</p>\n<p>While Guy's lips mouthed those words, no sound left them. Instead, a hoarse and throaty voice reverberated all around Al and assaulted his senses. Al could feel his mind vibrating as those words made their way through his ear canals and hammered into his brain with unrelenting force.</p>\n<p>Al furrowed his brows and felt his face, and was surprised to find it devoid of any hair at all. Before Al could say anything, the clean region wobbled and his previous batch of hair returned to its rightful place.</p>\n<p>\"It's harder to do with sentient beings I guess. The moment your mind opposed the change, it became harder for me to enforce my will,\" Guy said with a wry smile. \"Reality depends on how it is perceived. For sentient beings, they are aware of their self so it is much harder to manipulate that.\"</p>\n<p>\"I'm going to try something more forceful,\" Guy warned again. \"This will be my final test. I don't think I have enough mana to go further.\"</p>\n<p>Guy exhaled again and spoke, \"You are a cat.\"</p>\n<p>Again, a hoarse and throaty voice resonated around Al. It spoke the words leaving Guy's lips and pervaded all of Al's senses. For a second, Al started to lose control of his body. Concerned, Al moved his lips and tried to vocalise his thoughts, yet to his horror, the sounds that left his mouth weren't what he intended</p>\n<p>\"Meow meow meeeeooooow <em>hiss</em> me-\" Al coughed as his senses came back to him, stopping any more cat-like noises from leaving his mouth.</p>\n<p>\"What the heck was that?!\" Al screamed incredulously. He looked towards Guy and noticed the man turning woozy and falling to the ground.</p>\n<p>Al rushed to catch the man, all the while suppressing the sweat dripping down his drenched back.</p>\n<p>'What in the world just happened?'</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/jsuhtk3telcufvl7lpbw8f1\">Chapter 191 - Losing Oneself</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/z128jm19na7ws58qrkqdk0z\">Chapter 189 - Special Abilities and Powers</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}