{"pageProps":{"note":{"id":"0mc7ullxkzeov70n324g0pq","title":"Chapter 183 - (Interlude) Leaving the Cloudstrider Sect","desc":"","updated":1660070314890,"created":1652597774156,"custom":{},"fname":"volume-3.chapter-183","type":"note","vault":{"fsPath":"vault"},"contentHash":"c725303af36cdae5e90853c4ff733ba6","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-183","id":"0mc7ullxkzeov70n324g0pq","vaultName":"vault"},"value":"volume-3.chapter-184","position":{"start":{"line":123,"column":3,"offset":14157},"end":{"line":123,"column":27,"offset":14181},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-184"}},{"from":{"fname":"volume-3.chapter-182","id":"cpv9q4newgverol3d8fchw4","vaultName":"vault"},"type":"backlink","position":{"start":{"line":97,"column":3,"offset":11301},"end":{"line":97,"column":27,"offset":11325},"indent":[]},"value":"volume-3.chapter-183"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-183---interlude-leaving-the-cloudstrider-sect\">Chapter 183 - (Interlude) Leaving the Cloudstrider Sect<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-183---interlude-leaving-the-cloudstrider-sect\"></a></h1>\n<p>Guy returned the final book from the Archive back into its place on the bookshelf. The expressions on his face alternated between satisfaction, disgust and hopefulness.</p>\n<p>He was satisfied that he managed to consume all the books present within the time frame, which was beyond his initial estimate. The more he could add to the RoK, the greater his knowledge pool would be in the future that is to come. Speed-reading, like any skill, can be improved upon through practice and repetition. Guy's initial estimate was based on his first try, however, as he read more and more his mind and body became more accustomed to the action and his speed gradually increased.</p>\n<p>He was disgusted by some of the unethical practices endorsed by the Sect. The Archives didn't go into much detail, but Guy was able to infer things by piecing together hints from multiple documents. One of the most horrendous actions Guy found was when an inheritance ground, which is a type of inheritance artefact that takes the form of a micro-dimension, opened up in the middle of the Vast Blue Expanse to the East.</p>\n<p>It was discovered by a gaggle of crab fishermen whose ship got stranded on the island where the inheritance ground existed due to a wild hurricane. Word got out, and all the sects around the world rushed to claim it for their own. After a series of conflicts between members up the hierarchy, the rights to the ground were won by the Solar Sect Alliance.</p>\n<p>Members from the various sects of the alliance arrived in droves. It was commonly known that inheritance grounds were treacherous domains filled with dangers of many kinds. It was very rare for an Ascended mage to leave behind a benign artefact due to the volatile nature of cultivation and magic. Thus, the Sects would send in the grunts from the Outer Domain as cannon fodder to clear out and map the regions inside the grounds. Many would die, some painlessly while others not so much. Those that survived would live to see another day, albeit scarred for life. Those that were lucky and found something beneficial would ultimately lose it to those higher up the ladder.</p>\n<p>The documents in the Archive didn't even deign to name the hundreds of lives lost during that venture to map the inheritance ground. It disgusted Guy to no end.</p>\n<p>Ultimately though, this was an eye-opening trip for Guy. He felt hopeful about creating his Sect. He wanted to do better, he planned to use the information gleaned from these archives to build a Sect he could be proud of.</p>\n<p>Right as Guy entered an imaginative trance, he felt his body getting warped in place. The world around him wavered, blurred and stabilised all within one second. The feeling was similar to the teleportation Guy though when traversing between Karmin's shop in Radiant City and his Headquarters.</p>\n<p>Once his vision cleared, Guy noticed that he was outside the Archives, facing the massive doors leading into it. Guy frowned and muttered, \"The full six hours haven't elapsed yet. What happened?\"</p>\n<p>\"We have to leave,\" Al answered from behind him. Guy smiled and turned to face Markus, Al, and Marek. The last presence came as a surprise because the group's body language felt friendlier all of a sudden, unlike the antagonistic vibe that persisted during their initial encounter. Evidently, something had transpired that changed the relationship dynamics.</p>\n<p>\"There's been some trouble,\" Al continued.</p>\n<p>\"I'm sorry Master,\" Markus apologised immediately. Guy nodded, but then his eyes widened in shock. Markus had just called him Master in front of Marek. Guy nudged his gaze towards the man while looking at Al, hoping that he would clarify the faux-pas.</p>\n<p>\"It wasn't the kid's fault,\" Marek chimed. \"Our Sect Leader's daughter got the fresh idea of messing with me. Power plays and all that crap. The lad was just caught in the crossfire, not that it disadvantaged him in any way. He can hold his own quite well, kudos for having such a capable and smart Disciple, Sect Leader Larks.\"</p>\n<p>\"S-Sect Leader?\" Guy stuttered. 'Okay, A LOT has transpired while I was holed up in the Archives!'</p>\n<p>\"I look forward to meeting you soon,\" Marek said to Guy before turning to Al. \"Well friend, I'm disappointed that we could not spend more time catching up. Hopefully, we can do so in the future. I guess the debacle that ensued before puts me in your favour once again. Don't wait too long to cash this one in.\"</p>\n<p>With that said, Marek gave Al a warm hug and disappeared.</p>\n<p>\"Teacher Jeeves,\" Guy spoke up. \"What happened?\"</p>\n<p>\"I'll tell you everything as we leave. We can't waste any more time here.\"</p>\n<p>Al carried Guy with one hand and Markus with the other and flew out. He didn't take them to the landing bay they arrived at, and simply flew straight out through the translucent formation barrier around the Sect. A few kilometres out, Guy suddenly heard the loud flapping of wings. Craned his neck down and saw Garrud stationed suspiciously underneath them. Right then, he knew what was about to happen and screamed at Al to not do it. However, it was already too late. The moment his lips parted, Al's grip loosened, and the Master and Disciple hurtled down. Thankfully, they landed perfectly on top of Garrud, but the impact rattled their groins. If not for them suddenly empowering that region with their mana, the two would have lost all reproductive capabilities right then and there.</p>\n<p>As Guy nursed his aching tenders, Al's voice resounded in his mind.</p>\n<p>'The Sect Leader's daughter, Cleo Loras, got the bright idea of humiliating Marek by defeating the student of the man who defeated him,' Al started.</p>\n<p>Since he was flying within the radius of Guy's mana sense, the latter responded, 'That's a bit convoluted. And unnecessary.'</p>\n<p>'Losing face through association,' Al rephrased. 'The world of mages is very volatile. In fact, I am guilty of admitting that if we hadn't met, and Markus was really my student and he lost to Cleo, her ploy would have worked. But nowadays I'm a bit more... enlightened I guess?'</p>\n<p>'How did you get caught in this? You aren't one to actively seek conflict,' Guy asked Markus.</p>\n<p>'She lured and trapped me. It came out of the blue, Master. I wasn't prepared,' Markus answered.</p>\n<p>'Did you win?'</p>\n<p>'I did not,' Markus answered. Although, Guy could hear a pleasant intonation in the answer.</p>\n<p>'The boy won,' Al denied immediately. 'If I hadn't stopped him, he would have crippled, or even killed, the girl completely. Don't be mad, he wasn't fully in control of the situation. The girl brought it upon herself by activating a formation that clouded the opponent's rationality.'</p>\n<p>'Good job,' Guy congratulated. 'Tell me everything. I want to know.'</p>\n<p>Markus's face bloomed with a childish smile as he started to recollect the duel from memory. His animated tone and evocative recounting reflected the sheer joy the boy was feeling. Because although, on paper, the duel was declared a loss. Markus saw, first-hand, just how much stronger he had become. Guy was also pleasantly surprised by Markus' report. Although he was averse to combat, he recognised its necessity given the path he was planning to take. To that end, one thing that worried him the most was his and his students' abilities to contend against opponents of similar strength. Markus' victory calmed his tumultuous heart.</p>\n<p>'Although I don't want to discourage you,' Al spoke up as Markus finished his piece. 'Your overwhelming victory today was primarily because Cleo wasn't knowledgeable about your combat style, and she was also overly arrogant when entering into the fight. When facing a calmer and focused opponent, your chances of victory may be slimmer than you think.'</p>\n<p>'I am aware of that,' Markus answered sincerely. 'I lacked proper combat experience while my opponent did not. However, I held the initiative throughout the duel. This could only mean that my opponent entered the duel with a lax state of mind.'</p>\n<p>Al hummed in affirmation. He was satisfied that the duel hadn't inflated Markus' ego. After all, it was the number one killer of mages all over the world.</p>\n<p>'By the way, Teacher Jeeves,' Guy followed up. 'What happened between you and Elder Glista?'</p>\n<p>Al smiled and said, 'We cleared up some misunderstandings and resolved our differences.'</p>\n<p>Al left it at that and flew ahead all the while sporting a bright smile. He would love to elaborate, but it wasn't his secret to tell.</p>\n<hr>\n<p>Back at the Sect, a girl had just woken up from her unconscious coma. Her pock-marked, bruised and burnt skin had returned to its pristine jade-like consistency, and her clothes had been replaced with new ones that once again augmented her angelic beauty. Her broken bones had healed and so had her ruptured internal organs. Everything had returned to normal, except for two things.</p>\n<p>The first of the two was her mind. Losing is a part of growing up. Unfortunately, it wasn't something Cleo had experienced in her life. Every confrontation she entered was measured. She never took action until victory was guaranteed. She was strong, but a lot of her power hinged upon her position as the Sect Leader's daughter, and her intellect in choosing her battles.</p>\n<p>Years of continuous victory had clouded her judgement and boosted her arrogance. She thought that because Markus was in the same cultivation realm as her, and because he had no martial combat experience, he would lose under her blade. However, reality proved otherwise. Inside the seemingly non-confrontational human lay dormant a beast capable of unleashing an unbelievable amount of damage.</p>\n<p>She did not anticipate that Markus would have an inexhaustible supply of mana inside him - the barrage of spells exiting his wand was unending and unrelenting. She did not expect that Markus would have a battle instinct rivalling a seasoned master - he avoided every single attack of hers with minimal movement and with precise calculation as if he knew everything she was throwing his way. She didn't know that the boy had an Abyssal Wyrm's blood coursing through his veins - the voracious ball of death that nearly consumed her was sufficient evidence, and the Sect Leader's daughter had enough knowledge drilled into her to distinguish character traits of special mages.</p>\n<p>Ultimately, she did win. But only through a technicality, and that irked her. She should have lost. But the boy gifted her the victory. How dare he do that!</p>\n<p>Cleo sat up in her bed and was immediately attacked by a vile stench. This was the second thing that failed to return to normal after the fight.</p>\n<p>\"Unfortunately, the Alchemy Pavilion was draining their year's stockpile of alchemical waste, and it was disposed of through the drainage systems. The Pavilion Head stopped over and inspected the Young Miss' condition and said that regretfully, the unpleasant odour will persist for at least another week,\" Korr's flat voice answered.</p>\n<p>Cleo turned around and noticed the emotionless man standing by her bed.</p>\n<p>\"You!\" She bellowed while pointing at him. \"You told me that he was weak!\"</p>\n<p>\"This slave did no such thing,\" Korr shook his head. \"This slave simply offered his evaluation of the boy. The Young Miss' made the final decision.\"</p>\n<p>\"You dare talk back to me?!\" She picked up a ceramic bowl next to her bed and threw it at the man's face with a rageful scream. Contrary to her expectations, Korr raised his hand and caught the bowl before it hit his forehead.</p>\n<p>\"You-\" Cleo choked. Korr stood up to her, this could only mean one thing.</p>\n<p>\"The Sect Leader has called this slave back to serve him,\" Korr said. \"Thus, I bid the Young Miss farewell.\"</p>\n<p>\"Wait!\" Cleo called out frantically as she got to her feet. She didn't bother to put on her footwear and grasped at the man. \"I made a small mistake. Just give me a second chance.\"</p>\n<p>\"The Sect Leader said to convey to the Young Miss that, 'If you make a risky play, do so when you know you will win. Because of your idiocy, I now have to bend even lower in front of Marek.'\" </p>\n<p>In fact, through association, the Sect Leader had also lost a lot of face due to his daughter's humiliating victory. He had planned to retaliate by scheming to undermine Teacher Jeeves and that boy Markus. However, right after the incident, Elder Glista came with full force and rallied support asking to condemn the Sect Leader for offending guests visiting the Sect. They then went on to challenge the Sect Leader's capacity in leading a Sect if he couldn't control his own flesh and blood. Elder Glista also threw out a plethora of accumulated evidence of the Sect Leader's scruples from the past. Since Elder Glista was one of the pillars of the Sect, these allegations couldn't be swept under the rug and had to be brought to debate and discussion. The Sect Leader had little time to counter the allegations since it literally blindsided him. He would have been the one to dole out Cleo's punishment today if not for the bind he was currently in, in holding the other elders at bay.</p>\n<p>Korr paused and said, \"The Young Miss knows full well that the Sect Leader abhors that phrase - 'second chance'. The Young Miss received an opportunity, regretfully she squandered it immediately after. For now, the Young Miss has been ordered to remain within her quarters.\"</p>\n<p>Those words essentially meant that she was grounded until her father released her punishment. After bestowing the punishment, Korr exited her compound. Cleo tried to follow him out, pleading and begging. However, she was stopped by an invisible barrier surrounding her compound. The formation to sequester her had been activated. She was caged.</p>\n<p>\"It was all that boy's fault. Why was he hiding his strength-\"</p>\n<p>Cleo screamed out one excuse after another. The fault of the ritual formations. The fault of her weak blade that cracked under the attack of simple water. The fault of the sun for bearing down on her.</p>\n<p>Her enraged and wronged shouts echoed within the barrier around her compound, failing to exit it due to the noise-cancellation effects layered in the formation.</p>\n<p>She declared that she would have her revenge one day. One day, she would once again challenge Markus Reva. Crush him. And make him beg for her forgiveness for humiliating her.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/59rghrmi3i4qli7baczacct\">Chapter 184 - Grace Opens Up</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/cpv9q4newgverol3d8fchw4\">Chapter 182 - Outplayed, Outdone, Outclassed</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}