{"pageProps":{"note":{"id":"1cioeuukx3qjg2kuud6kmma","title":"Chapter 260 - Moving Planets with My Mind","desc":"","updated":1671424549791,"created":1668947310861,"custom":{},"fname":"volume-4.chapter-260","type":"note","vault":{"fsPath":"vault"},"contentHash":"36ebece3f59eaac2fa2e3c4272b3f259","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-260","id":"1cioeuukx3qjg2kuud6kmma","vaultName":"vault"},"value":"volume-4.chapter-261","position":{"start":{"line":63,"column":3,"offset":10908},"end":{"line":63,"column":27,"offset":10932},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-261"}},{"from":{"fname":"volume-4.chapter-259","id":"yxbracxru4cjxc309xnayia","vaultName":"vault"},"type":"backlink","position":{"start":{"line":105,"column":3,"offset":10917},"end":{"line":105,"column":27,"offset":10941},"indent":[]},"value":"volume-4.chapter-260"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-260---moving-planets-with-my-mind\">Chapter 260 - Moving Planets with My Mind<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-260---moving-planets-with-my-mind\"></a></h1>\n<p>While Marie immersed herself in the dour vision of the future, something profound was transpiring within her that went unnoticed by her, though its effects on the outside world couldn't be so easily missed, especially for someone whose existence had become one with mana itself like Krish.</p>\n<p>A sizeable whirlpool of mana started to form around Marie and started to siphon into her. The temperature in and around her started to rise noticeably. Sweat started to ooze out from her pores that started a cloudy, translucent shade and suddenly turned murky black and vaporised immediately after. In doing so, holes started to form all over her attire, as the material disintegrated at a rapid pace. He also noticed her eyes gaining a familiar golden glow as she activated her Heavenly Eye.</p>\n<p>Krish couldn't help but take a step back with a mix of shock, awe and disbelief. His Disciple was achieving a breakthrough into the Foundation Establishment Realm. Fundamentally, a breakthrough from Mana Condensation Realm only occurs when a mage understands something incredibly profound about their cultivation. Their mind expands, and the body must keep up. Thus, a thorough cleansing is initiated that spans the entirety of the Foundation Establishment Realm. First, it is the Base stage that cleanses the circulatory and nervous systems. The mana burns away all impurities ailing the mage which exits their bodies as a corrosive black liquid. The Internal stage is the second step in Foundation Establishment, which reinforces the internal organs and the bones. The External stage is the last, wherein the muscles, tendons, flesh and everything external get empowered.</p>\n<p>At that moment, Krish caught himself and immediately activated the Heavenly Eye. His gaze ran rampant, everywhere and searched for any sign of deviation or redirection of fate. Usually, for a practitioner of the Heavenly Eye to break through, they need to shift the course of fate irreversibly in some way and suffer the backlash from their actions. This was the only way to gain a profound understanding of fate as it exemplified a fundamental truth: fate is set in stone and to change it one must sacrifice something of equal value.</p>\n<p>To his utter surprise, the world was moving as it was - fate had remained unchanged. And this realisation shattered his thought paradigm completely. To know that there was an alternate pathway, one without loss, well... He would be lying if he wasn't a bit envious. Envy is a rather caustic emotion and one that mages are quick to succumb to. Krish immediately smothered it in its crib after telling himself that all of this was achieved through the gruelling hard work of his Disciple. It was a befitting reward. If there was anyone to blame, it could only be himself. If he had tried a different strategy from the start, he could have achieved the same thing</p>\n<p>That was a lie.</p>\n<p>First off, his Master would have none of it. He wasn't the least bit patient or sympathetic. If Marie were under his Master, she would have been deleted at the first sign of opposition. His Master would no sooner get rid of such an \"impudent\" Disciple than entertain her many flights of fancy. Now, even if his Master gained a shred of empathy and decided to indulge in such endeavours, there was still a massive piece missing. It was the knowledge, especially the unique way of thinking, that gave Marie the ability to snag this achievement. Krish could not match his Disciple because he lacked a man like Guy Larks in his youth.</p>\n<p>\"Now that is something I can be envious of,\" Krish muttered with a bitter smile. \"The people you meet can change your life. Some for better, some for worse. Marie is fortunate to have met such encouraging folk.\" </p>\n<p>\"-myself included,\" He added with a mirthful snort. \"Her life may have started poorly, but it will end on a high note. I can guarantee at least that much.\"</p>\n<p>At that moment, right as Krish was about to deactivate his Heavenly Eye, he caught a sudden shift in the flow of fate. The mana that had settled started to swirl once again, concentrated above his Disciple's head. Krish deciphered the phenomenon immediately as it was a sign of another advancement. A breakthrough followed by an advancement... Unbelievable! But the change in fate concerned him.</p>\n<p>\"What? I didn't do anything.\" Suddenly he was struck with a realisation, and he looked at his Disciple with doubled worry. \"No-\"</p>\n<hr>\n<p>What she saw was a future set in stone according to the laws of Constants. It took her a few scrubbing operations - the process of going forward and back in time multiple times at varying speeds - for her to truly grasp the underlying facts behind the gruesome and dreary scene.</p>\n<p>The True World Sect would grow quickly and, in that process, so would its reputation. The Sect would rise above others in its generation and gain enough prestige to challenge the more renowned sects in the Solar Empire. However, achieving such success wouldn't be without cost. Envy is a toxic emotion and one that the sect would be subject to by its competitors.</p>\n<p>There is a reason why no new sects have risen to the level of the Cloudstrider Sect or the Whispering Dusk Sect ever since the origin of the Empire. The competition between sects is brutal and unforgiving. When the True World Sect eventually reaches the springboard, ready to hit the big leagues, it will face repeated opposition from other sects.</p>\n<p>Sect Leader Larks will become famous. Mortals will flock from far and wide to learn under him because of Sect Leader Larks' policies about admission and learning magic. The status quo will become destabilised, and it will incur the ire of the government as well. After all, the Empire thrives off of the illiteracy of the large majority of common folk. If a rogue entity like Sect Leader Larks entered the scene, then the only crutch that keeps the leaders in power will disappear.</p>\n<p>Which leads to the predicament from earlier. The True World Sect will become embroiled in a conflict from two fronts. Both sides will try to undermine Sect Leader Larks. They will do so by labelling the True World Sect as an unorthodox sect because of Sect Leader Larks' special ability to control others. This way, the True World Sect will lose everything, though it will not be annihilated.</p>\n<p>Marie was certain that Sect Leader Larks wouldn't perish. As her Master said, the True World Sect would propagate, albeit with a different set of members. The True World Sect would thrive, but it wouldn't be without some initial bloodshed. As a Constant, this massacre was an eventuality. It could arrive today, or it could arrive as she lay on her deathbed (whenever that was).</p>\n<p>BUT, Marie did not want that. She did not wish to lose her family. This problem needed fixing.</p>\n<p>Thankfully, Marie had the whole world in her mind to work with. She immediately zoomed around the globe in search of a solution. In the past few years, Marie had learned a key fact of life. There is only so much you can achieve by yourself. What Marie had today was in large part a result of the contributions from a lot of people: Matron Reva, Mister Larks, her Master, and many other folks who'd offered her help along the way.</p>\n<p>The problem the True World Sect would face wasn't one that she could solve all by herself. The trouble they will face is multi-faceted in its cause. But it all came down to the way the Sect interacted with other stakeholders. Mister Larks, for all his wisdom and intelligence, wasn't a shrewd man. He was cautious, but he lacked the level of ruthlessness and resolve needed to safeguard the Sect against unforeseeable threats brought on by the inherent evil of man. To get to that point, Mister Larks would need to stumble and fall and learn from those mistakes. Unfortunately, the consequences of those missteps extended to the rest of her family as well.</p>\n<p>To find the right person, Marie used a set of criteria. She did not want to change the life of people that weren't fated to die, since they had a future within their grasp (mostly). Her focus was on those whose death was a constant and pre-emptive - a wasted life. Those were fewer to leaf through. Amongst those, she looked for the person who had the correct demeanour.</p>\n<p>Fortunately for her, a person that fit the bill (and more) was within her reach. A person slated to die a gruesome death. A person who was forced to live their life hidden. A person whose existence was steeped in layers of lies and deceit. A person with the necessary apathy to make unsavoury decisions and the backbone to act on them. A person with intelligence and aptitude beyond measure.</p>\n<p>Unfortunately, Marie wouldn't be able to save the person as their death was to occur very soon. Coincidentally, Marie wouldn't have to change much to save this person and bring them into the Sect's fold, since a member of the Sect was close to the location of the person's death.</p>\n<p>But how to bridge the gap? Then, Marie remembered her Master worrying once about her changing the flow of fate purely by saying something. A sudden burst of intuition, almost like finding out an extra finger she could control, urged Marie to start drawing upon her mana from her core. She pulled it towards her mental space, filling it to its brim. Gritting her teeth, she started to run an inhuman amount of calculations at a feverish pace.</p>\n<p>The world in her mind was a model of the real one. But with fate imbued into it, it could be said to be a miniature copy of it. So, any changes made here would be automatically reflected outside. A valid hypothesis, one she was prepared to put to the test. In devising this model, Marie had to calculate the behaviour of the celestial bodies in space. She could not change the way humans and objects brought in by fate went about since she had little understanding of their behaviour. The planets, however, that she was familiar with.</p>\n<p>To save the person, an extremely minute (at an incomparably small order of magnitude) change in the orbit of five planets and three moons was required. But even this tiny change required Marie to recalculate a plethora of equations in her mind. Marie moved the overflowing mana and started to enact the change in her mental model. She struggled as her mana started to drain at a feverish pace. Marie worried that she did not have enough to follow through. Fortunately for her, she was completely saturated with high-quality mana thanks to her recent breakthrough, her advancement AND the naturally abundant and concentrated atmospheric mana in and around the Mystic Celestial Sect.</p>\n<p>The change was enacted, and Marie dissipated the model from her mind. She staggered in place, her body weakened completely, and her eyes caught the sweating figure of her Master rushing forward to catch her from falling over.</p>\n<p>\"What have you done?!\" Was all she heard from her troubled Master as she lost consciousness... once again.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/van5o8bwwa4o2klaofrgt60\">Chapter 261 - (Interlude) Pride or Death</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/yxbracxru4cjxc309xnayia\">Chapter 259 - The World in My Mind</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}