{"pageProps":{"note":{"id":"2jts1hbg535hufj59l7fdp9","title":"Chapter 262 - Evil of Man","desc":"","updated":1671684069524,"created":1669567601896,"custom":{},"fname":"volume-4.chapter-262","type":"note","vault":{"fsPath":"vault"},"contentHash":"96cff7170d831219d36501e46559a035","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-262","id":"2jts1hbg535hufj59l7fdp9","vaultName":"vault"},"value":"volume-4.chapter-263","position":{"start":{"line":113,"column":3,"offset":10734},"end":{"line":113,"column":27,"offset":10758},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-263"}},{"from":{"fname":"volume-4.chapter-261","id":"van5o8bwwa4o2klaofrgt60","vaultName":"vault"},"type":"backlink","position":{"start":{"line":133,"column":3,"offset":11588},"end":{"line":133,"column":27,"offset":11612},"indent":[]},"value":"volume-4.chapter-262"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-262---evil-of-man\">Chapter 262 - Evil of Man<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-262---evil-of-man\"></a></h1>\n<p>Her entire life, Shuri spent every waking second in a treacherous swamp where danger lurked behind every corner. Her life was quite literally teetering precariously at the edge of a sharpened blade. Through repeated failures and stumbles, Shuri's instincts became extremely sensitive to encroaching danger.</p>\n<p>Ever since she hitchhiked with the man whose name she deigned not to learn, her instincts were blaring \"DANGER\" ceaselessly. However, Shuri suppressed it and wrote it off as uneasiness wrought by the sudden change in scenery. After all, moving from an environment where one needs to be constantly on the lookout for death-inducing trouble, to another where a mistake didn't always end up with death or serious maiming can be seriously disorienting. Thus, Shuri affiliated the growing sense of foreboding gnawing at her as the result of an idle mind cooking up all kinds of trouble.</p>\n<p>She couldn't have been more wrong! Shuri cursed herself for doubting her highly attuned instincts because danger came knocking and brought with it a side of death.</p>\n<p>It started with a faintly audible whooshing noise that was followed by the loud and troubled neighs of horses. More of those whooshing noises followed, Shuri recognised them as the sounds of arrows cutting through the air. The carriage lurched forward as the horses dashed to save their hides.</p>\n<p>Even with the threat looming over the horizon, Shuri's mind stayed as unperturbed as a still pond. She knew she couldn't run away at this point, the only option was to wait it out and prepare for the worst-case scenario. Shuri quickly popped open the nearest barrel and started to toss out the clothes packed within. The container was just large enough to hold a person of her size, which she took advantage of. Right as the barrel's lid fastened onto the container, Shuri heard an approaching arrow through the gap. The gruesome sound of metal tearing through flesh sounded with a muffle and was immediately followed by the chilling sound of a person drowning in their own blood. The driver had succumbed to the ambush.</p>\n<p>And then the world turned upside down and sideways. Shuri barely held herself together before a sudden change in acceleration caused her head to crash violently against the side of the container she was hiding inside. Then darkness took her.</p>\n<p>In this darkness, Shuri was forced to relive another vivid excerpt from her not-so-fabulous life. Was it Shuri's subconscious guilt that selected this particular memory from all others still occupying real estate in her sticky mind - the guilt of not supporting the only person in the Palace that was on her side unconditionally? Unlikely, because she did not feel any remorse over how the events panned out. The maid girl's support, though emotionally fulfilling, was akin to a tumour that could metastasise at any instance. She would have invited more trouble than what she was worth, so Shuri deemed it better to nip the problem in the bud.</p>\n<p>Needless to say, the maid did not survive the impromptu surgical procedure of separating her tongue from her body. Tragic... but not regretful.</p>\n<p>At least it wasn't another memory with her late mother. The effects of those dreams lingered well past the point Shuri gained consciousness. This could mean that maybe Shuri could exit the inevitable confrontation against the ambushers with minimal harm. She snorted internally at her meagre attempt to latch on to that false hope. There was only certain death on the other side, to think otherwise would be futile. But Shuri wasn't going to succumb to the sweet embrace of death without a fight.</p>\n<p>As she regained consciousness, she was subjected to another disorienting bout of movement before her container shattered and revealed her to the world, and her attackers.</p>\n<p>They were seven men. Each sporting similarly unkempt and overgrown facial hair that was knotted and caked with dirt. They each had a weapon in hand; two carried bows and the rest carried haphazardly forged weapons with rust forming on their surface and their edges deformed through wear and tear. Their eyes carried intense hostility, greed and lust.</p>\n<p>Luckily, the bandits did not anticipate the presence of another entity in the caravan and had left a wide gap in their encirclement, which Shuri took advantage of. She immediately leapt onto her feet and rushed through the gap. She bobbed and weaved just in time for an arrow to miss her head by a hair's width. She took advantage of the surrounding trees to limit her pursuer's line of sight. The danger was all around her, but Shuri was calm.</p>\n<p>Escaping should have been trivial. If there was one thing Shuri was good at, it would be running away. She was fast even with her weak form. However, her opponents had the benefit of familiarity - the forest was their home ground. Shuri's current concern was falling into a trap of their design. They could very well be leading her to a strategic location and boxing her in, and she would be none the wiser because of her ignorance of the surroundings.</p>\n<p>When one loses, it is generally palatable if the failure was due to the opponent's superiority. It is a disgusting punch in the gut, though, if the loss is attributed to one's own stupidity or laxness. And that was exactly what happened as Shuri wove past a tree. The ground dipped sharply and as a result, her ankle twisted. With a rough tumble, she fell to the ground and started to roll haphazardly.</p>\n<p>Fighting the disorientation and the pain assaulting her back and head, she tried to crawl back up and resume her sprint. But it was already too late.</p>\n<p>\"A runner! Just the way I like 'em,\" one of the men chasing her said loudly between his haggard breath, licking his lips between his words.</p>\n<p>\"She's just a little girl,\" another reminded sternly.</p>\n<p>\"Even better.\" the first one snorted. \"Don't worry, girl. This uncle will make you feel reeeeal good.\"</p>\n<p>\"What's that around her neck?\" By this time, the rest had caught up and Shuri's escape plan was thoroughly thwarted.</p>\n<p>\"Don't see anything there...\" One of the voices murmured. At this point, Shuri's brain had checked out and was frantically searching for any avenue for escape. Her hand subconsciously drifted towards her pendant and rubbed it worriedly.</p>\n<p>\"Wait I see it! It looks common.\"</p>\n<p>\"It's a fucking mana gem. It's probably enchanted,\" the man who noticed her pendant first declared. His eyes held a greedy glint.</p>\n<p>At this point, Shuri felt it was time to play her most dreaded card, \"Listen. You people don't want to do this-\"</p>\n<p>\"Oh, here we go. Alright little madam,\" the lust-filled man said with a mocking tone. \"Why should we not go through with this?\"</p>\n<p>\"My father's positioned quite high in the government. Rather than poke a hornet's nest by violating his most treasured daughter, why not choose the smarter path and opt for some 'monetary compensation' for your troubles?\" Shuri offered.</p>\n<p>\"The most treasured daughter wouldn't be caught in such a predicament, don't you think?\" The greedy man pointed out. Shuri could only suppress a grunt at his astuteness. This man was observant, she had to tread carefully.</p>\n<p>\"Regardless, the way I see it, in terms of odds, we are at a greater disadvantage trading you into your family for a ransom as opposed to just taking what we want from you and leaving,\" The greedy man said with a scoff.</p>\n<p>\"That is fair, but if I am hurt, killed or maimed, my father will inflict double the suffering upon you folk,\" Shuri threatened lightly. \"Even an unfavoured daughter is a daughter nonetheless. Do you think he will take this loss of face lying down?\" An ill-advised move to threaten her captors, she was aware, but at this point, there was very little for her to work with.</p>\n<p>\"Again. Turning you in for a ransom will let your family know that it was us who hurt you. With the alternative, no one will know unless a thorough investigation is launched by which time we will be long gone,\" the greedy man shrugged. He moved towards a large rock at the side and leapt atop it.</p>\n<p>\"Alright, let's get this over with!\"</p>\n<p>Shuri immediately assumed a defensive stance and screamed, \"S-Stay back!\"</p>\n<p>\"If you struggle, it will only hurt more.\"</p>\n<p>A man grabbed Shuri from behind and pinned her to the ground on her stomach.</p>\n<p>\"S-Stop! Please,\" Shuri screamed.</p>\n<p>A hand reached for her neck and grasped the pendant.</p>\n<p>\"NO!\" Wiggling her way out of the vice grip her captor had on her, she turned and bit the hand holding the mana gem. Her teeth latched on and ripped off the flesh on the man's hand as he pulled it back by instinct.</p>\n<p>\"FUCK!\" The man yelped. \"The bitch bit me!\"</p>\n<p>He kicked Shuri in her abdomen multiple times to vent his frustration. She couldn't stop pained groans from escaping as the attack persisted relentlessly.</p>\n<p>\"FUCK! That's it, hold her down!\"</p>\n<p>His partners pulled Shuri's limbs apart, while she struggled and failed to stop it from happening.</p>\n<p>\"Those eyes, so much hate,\" the man sneered. \"Don't worry, we'll fix that soon.\"</p>\n<p>Using his dull blade he ripped off the clothes covering Shuri's lower body and started to undo his own.</p>\n<p>Shuri turned her head sideways and looked out into the distance. Death was approaching, and all she could do was sigh in resignation. Why didn't she feel anything? There was no fear, there was no anger, and she even stopped struggling at this point. Maybe living with death around the corner had sort of prepared her for its eventual arrival, making her inoculated to the common emotions at the time of its reckoning.</p>\n<p>She closed her eyes and waited.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>A harmony of cracks, that Shuri immediately recognised as the sounds of bone shattering, brought her out of her state of resignation. This was followed by loud bellows from the surrounding men. Their voice was coarse and guttural, almost like they were suffering through unimaginable pain.</p>\n<p>Suddenly, she started to feel lighter. Her body lifted off the ground. She opened her eyes and saw the men turning into blobs of meat. Her gaze flitted around the scene until it locked on to a new figure. She had never seen this person before.</p>\n<p>It was a boy, possibly a year older than her, holding a foot-long stick pointed in her direction. From the tip of the stick bloomed a myriad of spell circles. He wore a garb reminiscent of sects, with a logo of a globe with green and blue blobs on it. She had never heard of or seen such a symbol before - probably a new sect.</p>\n<p>Shuri swallowed a mouthful of saliva audibly in relief and shock.</p>\n<p>\"Who- Who are you?\"</p>\n<hr>\n<p>Markus awoke early, once again, and started to move through his early morning yoga routine. Today was a special day, and he had to be in tip-top condition for the Sect's sake. Today was the official start of the recruitment drive!</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/e15cwai9zl61qswrlbd3wqu\">Chapter 263 - Setting up the Stall</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/van5o8bwwa4o2klaofrgt60\">Chapter 261 - (Interlude) Pride or Death</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}