{"pageProps":{"note":{"id":"3mosq73nuw3zqqa9cydzzxn","title":"Chapter 343 - Commemoration","desc":"","updated":1690538604724,"created":1688060725498,"custom":{},"fname":"volume-5.chapter-343","type":"note","vault":{"fsPath":"vault"},"contentHash":"1f7379a03b5c7c752ce72c832fcc9e6b","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-343","id":"3mosq73nuw3zqqa9cydzzxn","vaultName":"vault"},"value":"volume-5.chapter-344","position":{"start":{"line":119,"column":3,"offset":11498},"end":{"line":119,"column":27,"offset":11522},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-344"}},{"from":{"fname":"volume-5.chapter-342","id":"02vg0pnd7fs8ic0novrtolk","vaultName":"vault"},"type":"backlink","position":{"start":{"line":109,"column":3,"offset":9444},"end":{"line":109,"column":27,"offset":9468},"indent":[]},"value":"volume-5.chapter-343"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-343---commemoration\">Chapter 343 - Commemoration<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-343---commemoration\"></a></h1>\n<p>\"Amazing! Absolutely amazing!\"</p>\n<p>Sect Leader Larks did not hold back his praise as he used the mana core calculator created by Shuri. His expression was frozen in awe and wonder, as well as childlike amusement as he tested out the device with glee. The duo were currently in the Sect Leader's office.</p>\n<p>\"Although I know the answer already, I just have to ask how you accomplished this?\" The Sect Leader inquired while continuing his vivacious inspection. \"You don't have to answer... I get it... confidentiality and all that. I never thought I'd get to see an actual, functioning, digital calculator in this lifetime!\"</p>\n<p>Shuri scratched her head embarrassedly and said, \"I applied what you taught me about logic gates, and used it to augment the knowledge I already had about Automagy. The result is what you see before you.\"</p>\n<p>The Sect Leader lowered the ball in his hand and gave Shuri an appreciative thumbs-up. \"You know this is why I adore all you children. To be able to see possibilities and connections that adults like me miss. Who'd have thought that Automagy could have such applications- I mean, I could have guessed, but it would have been only a half-informed reach at best.\"</p>\n<p>\"Anyway,\" the Sect Leader interrupted his own rambling and stated, \"This device... I can see it being very useful in the hands of people working extensively with numbers on a regular basis. Take your Senior Sister Marie for example. Back when she used to work with caravans as an accountant, she would have killed to have something useful like this making her life easier.\"</p>\n<p>\"I agree,\" Shuri said while humming contemplatively.</p>\n<p>\"So, what do you wish to do with your creation?\" The Sect Leader probed.</p>\n<p>\"I wish to register a patent for this device,\" Shuri responded decisively, causing the Sect Leader's brows to raise in surprise.</p>\n<p>\"You do realise that in doing so, you will be revealing the technique to the Sect?\" The man reminded.</p>\n<p>\"I don't mind,\" Shuri responded while revealing a satisfied smile. \"This work is far detached enough, and original enough, to not draw comparison with any existing works or techniques.\"</p>\n<p>The two exchanged a meaningful look before simultaneously nodding in the affirmative.</p>\n<p>\"I also wish to add this product to the VTC's (Verum Trading Company) portfolio,\" Shuri declared conclusively.</p>\n<p>In response to that, the man's brows jumped even higher (threatening to jump off his forehead and shoot into the sky). \"T-That's admirable. What is the lead time to produce this calculator?\"</p>\n<p>\"It took me an hour and a half to program the mana core. I can make it faster through some practice and optimisation of the circuitry,\" Shuri answered. \"But the throttle is actually on the rate at which the inert cores are being farmed. I cannot extract more than six inert cores in one go, lest it affects the quality of the cores.\"</p>\n<p>\"Would having more people working with you to extract the cores be of any help?\" The Sect Leader suggested.</p>\n<p>\"It would,\" Shuri said. \"The rate at which the mana sink produces wisps and slimes allows the extraction of up to 25 mana cores in one day before we start hitting a net loss. However-\"</p>\n<p>At that point, the Sect Leader interjected and finished Shuri's sentence for her, \"-However, you will have to share your methods with other people, and since you said that the technique you're employing is proprietary and deeply tied to your family, it would raise red flags if it somehow leaks.\"</p>\n<p>Shuri affirmed Sect Leader Larks' guess with a bitter smile and nod.</p>\n<p>\"What if we try other strategies?\" The Sect Leader proposed. \"I mean, you managed to derive an original interpretation of programming a mana core. I know it's asking for a lot - like asking lightning to strike the same place again - but maybe we could develop a core farming method of our own as well?\"</p>\n<p>Shuri bobbed her head in thought as she considered the idea. \"It would take a lot of time, and resources to research that problem. And to be honest, I don't feel like taking on that task at the moment. I mean, the calculator doesn't NEED to be ubiquitous just yet. A mana core IS a scarce resource, it wouldn't do us any good to flood the market with this product.\"</p>\n<p>\"You make a good point. I guess I got ahead of myself there,\" the Sect Leader doubled back while scratching his head embarrassedly. At that moment, the door to the office resounded with three knocks in a peculiar pattern. A smile flashed past the Sect Leader's face, which he quickly hid amidst a clearly fake coughing fit.</p>\n<p>\"Let us put a pin on this discussion for now. Why don't you take the rest of the day off and relax? Seeing as you've just advanced, you deserve some time to consolidate your cultivation,\" the Sect Leader said with a serious expression. He tapped his desk with his fingers frantically before adding, \"Oh! Make sure to drop by the mess hall. I know you've missed your meals again. I'd rather not have to explain this situation to Grace again, it is quite embarrassing, I'm not going to lie.\"</p>\n<p>Shuri chuckled at the Sect Leader's words before she rose, bowed, and left the office.</p>\n<p>She decided to take the Sect Leader's advice and beelined towards the mess hall to get some much-needed sustenance. Advancing into the Foundation Establishment is half fuelled by mana and half fuelled by the body itself. After all, the body is the vessel that contains the will and soul. The process of advancement takes a lot of energy, that is a fact. However, a Foundation Establishment realm mage does not feel the instinctual hunger a mortal would feel which is the body's trigger to refuel itself. Many similar processes become a matter of practice rather than instinct after advancement (such as cleansing oneself, evicting waste from the body, and so on) - it is one of the most basic tethers of mortality a person sheds upon stepping down the path of cultivation. After all, a mage in the Core Formation realm has more things to worry about than voiding their bowels.</p>\n<p>As Shuri approached the building, a strange sense of suppression started to drown her. The feeling could be likened to someone suddenly losing their senses as if they were just snatched from them. Of course, she could still see, smell and hear, but only using her eyes, nose and ears. Her mana sense, which had expanded and become more sensitive, was completely shut off - stolen from her.</p>\n<p>A sense of foreboding descended on her, and she took a few steps back by instinct. A part of her deep down, that she only recently decided to stop listening to, was warning her to turn tail. And just as her body decided to follow that instinct, she collided with two people standing right behind her.</p>\n<p>\"Where do you think you're going?\" It was Casey, a girl, a member of the Sect. She was unusually large (or maybe Shuri was small for hers), and she had a sturdy frame.</p>\n<p>\"Yeah! You were told to go to the mess hall!\" Another giantess for her age Lacey, who also happened to be Casey's twin, spoke up with a much squeakier voice.</p>\n<p>\"Umm... I- I think I forgot something in my room...\" Shuri put together an excuse quickly, though her darting gaze did little to sell the lie.</p>\n<p>\"Tell us what it is, and we will get it for you. You should go into the mess hall,\" Casey said with a monotone, stony voice.</p>\n<p>\"Yeah! Go into the hall!\" Lacey parroted.</p>\n<p>The voice in her head started to scream anxiously. Shuri's thoughts ran rampant and a myriad of scenarios started to form in her mind.</p>\n<p>'I knew it! Standing out too much, while positive in the eyes of those in charge, is poisonous for my so-called peers. Jealousy is a slippery slope, and my advancement has broken the camel's back. What kind of bullying will they put me through? I should be stronger, now that I have advanced. But is it worth it to apply my strength against these kids? In the eyes of the Sect Leader, it would put me in a much worse light, even if he is against bullying in general. Should I try convincing these girls to let me go? What were their weaknesses again? Right! Their favourite dolls were crafted by their mother. But that's too far away-'</p>\n<p>\"You two should give her some space,\" a familiar, and dreaded, voice spoke up calmly from behind the girls. \"Can't you see that she is freaking out?\"</p>\n<p>\"B-But Senior Sister, we were told to guide her into the mess hall,\" Casey spoke up innocently.</p>\n<p>'Putting up an act?' Shuri mocked. 'She'll see right through it,' she added with confidence. She was certain that according to Marie's character, she wouldn't tolerate bullying.</p>\n<p>\"You two carry on. I'll take her in,\" Marie said, completely shattering Shuri's expectations and sending her spiralling down a well of regret.</p>\n<p>A firm hand grasped Shuri's shoulder. Marie leaned in and whispered, \"It's time to face the music. Your pace has attracted a lot of attention, after all.\"</p>\n<p>Shuri shuddered. There was no turning back. She prepared herself for what lay beyond the doors.</p>\n<p>\"SURPRISE!!!!!!!\" Many voices overlapped and exploded at once, accentuated with childish sounds and a lot of light. Shuri stood with her mouth agape at the unbelievable sight.</p>\n<p>The entire Sect, barring Jean and Kili, had congregated in the mess hall. They all wore weird, conical hats made out of parchment with the word \"Congratulations\" printed on them with funny fonts - even the in-house Tesseract Transformation monster stood at the side with a pink cone on his head.</p>\n<p>\"Can't believe you're having me suppress a mere Foundation Establishment realm whelp for what? A surprise party?!\" The elderly man mumbled just loud enough for the room to hear. The children giggled at the man's outburst.</p>\n<p>\"Come on now, Master,\" Marie said as she followed Shuri through the door. \"Shuri here is the first member of the True World Sect to break through into the Foundation Establishment realm. It calls for a proper celebration!\"</p>\n<p>\"Marie's right, you know?\" The Sect Leader said while entering the room. \"This is a momentous occasion that calls for a proper celebration.\"</p>\n<p>The Sect Leader clapped his hands and the crowd split through the middle, revealing Matron Reva who held a plate with a cylindrical, white food item on it. Atop the cylinder, the text \"Congratulations on your Breakthrough, Shuri!\" was written with colourful cream. And arranged on the cylinder were many thin, colourful candles.</p>\n<p>\"I tried following your recipe to the letter, Guy- I mean Sect Leader Larks,\" Matron Reva said with a wry smile. \"I hope it tastes as good as you described it.\"</p>\n<p>\"It's the first time anyone's making it,\" the Sect Leader said. \"This will set a benchmark for future cakes so stop fretting!\"</p>\n<p>\"Alright everyone, gather around!\" The Sect Leader called out, and the crowd moved haphazardly around Shuri. \"I wanted to create a tradition. You see, advancing into the Foundation Establishment realm is a great achievement. It marks the first true step into cultivation. In some ways, it is a sign of hope!\"</p>\n<p>\"Umm, what am I supposed to do?\" Shuri asked doubtfully, unable to take the anticipating gaze all around her.</p>\n<p>\"Well, close your eyes, make a wish and blow the candles,\" the Sect Leader explained. \"The wish can be anything you want it to be. But make sure not to tell anyone, lest the wish doesn't come true!\"</p>\n<p>'Childish,' Shuri thought to herself, but her lips spread out with a smile.</p>\n<p>\"I wish...\" And she blew out the candles.</p>\n<p>\"CONGRATULATIONS!\"</p>\n<p>\"Cut the cake!\"</p>\n<p>\"Yaaaay!\"</p>\n<p>The celebration continued into the night. And Shuri went to bed that day with a heartfelt smile overflowing with happiness.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/89zxhpn3rv6uam7gvgadu9t\">Chapter 344 - All Play and No Work...</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/02vg0pnd7fs8ic0novrtolk\">Chapter 342 - Breakthrough in Automagy</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}