{"pageProps":{"note":{"id":"4su0hp9ghk6w9hftqc1wez3","title":"Chapter 310 - Curious Shuri","desc":"","updated":1683705104609,"created":1680412593669,"custom":{},"fname":"volume-5.chapter-310","type":"note","vault":{"fsPath":"vault"},"contentHash":"e5789225ea7524bb4872e0f7a93b09e0","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-310","id":"4su0hp9ghk6w9hftqc1wez3","vaultName":"vault"},"value":"volume-5.chapter-311","position":{"start":{"line":95,"column":3,"offset":11044},"end":{"line":95,"column":27,"offset":11068},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-311"}},{"from":{"fname":"volume-5.chapter-309","id":"jrr2hwauiw7cyb8kh3fz5x4","vaultName":"vault"},"type":"backlink","position":{"start":{"line":103,"column":3,"offset":10359},"end":{"line":103,"column":27,"offset":10383},"indent":[]},"value":"volume-5.chapter-310"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-310---curious-shuri\">Chapter 310 - Curious Shuri<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-310---curious-shuri\"></a></h1>\n<p>\"Curiosity killed the cat.\"</p>\n<p>This turn of phrase was an apt reminder that kept Shuri alive throughout her rather short yet danger-prone life. It was often better to not know something than to die knowing too much. People forget that knowledge is power, and power is like a magnet that attracts trouble. Shuri lost count (not really) of the number of people within the castles who lost their tongue or their head just for being more informed than they were supposed to, or for going out of their way to know something they didn't need to. Shuri kept a safe distance from all sorts of palace intrigue and always kept her inherent curiosity in check.</p>\n<p>However, her environment had changed. After living in a place where curiosity was unwaveringly punished, she was feeling shell-shocked to experience an environment where it was actively rewarded, encouraged even. In fact, what feared Shuri the most was that somehow, this new environment was stroking her ego and her need to show off her mental prowess which she didn't think existed!</p>\n<p>\"It's the constant barrage of compliments...\" Shuri said out loud as she ducked under a low-hanging branch. She was currently trekking through the forest that bordered the Sect in an attempt to survey the mountain it was built on.</p>\n<p>Shuri was just a kid on the cusp of becoming a teenager, after all. And kids, by nature, are curious. Unfortunately, she never got the opportunity to scratch that itch in her younger years. And having such an uninhibited outlet so suddenly caused her to loosen her grip on the stranglehold of her curiosity. Shuri also realised that she had made a crucial mistake of only reinforcing her resilience against all kinds of negative attacks of verbal and physical modes, as even basic words of positive reinforcement circumvented all of her defensive systems. It was like a city building a wall only on its East and North sides after experiencing sieges from neighbours in that direction, but leaving the West and South unguarded. She tried her hardest after entering the True World Sect to build up her defences and protect herself, but she realised that everything was barrelling out of her control quicker than she could respond.</p>\n<p>\"What am I even doing here?\" Shuri moaned out loud before halting in her steps and sitting down on a rocky outcropping.</p>\n<p>That was a rhetorical question. Shuri knew exactly what she was doing here. There were two purposes for her admittedly rash and unaccompanied trip into the forest, and both of them were to confirm her suspicions. The first suspicion of hers was to confirm a theory regarding the low mana levels around the Sect, which bordered on scarcity. Shuri finally remembered where she had heard the phrase mana sink, as it was thrown out casually by Markus during their trip to the Sect. He used it offhandedly to describe what the surroundings of the Sect felt like, and not based on the true definition of the phrase.</p>\n<p>In the last three weeks, Shuri and her peers were given regular assignments to practise a battery of spells with their newly crafted wands. The assignments were scheduled by Jean to ensure that the process was safe and no one would hurt themselves in the process. Shuri was fine with this. She would follow the instructions and blend in with the group. Everyone progressed at a steady pace, except for Shuri who seemed to be advancing above the pack which was horrible news! While the others were still hovering at the start of the Early Stage of Mana Condensation Realm, Shuri was in the Middle Stage. She had no idea why her cultivation was advancing so quickly, and when she asked Marie all she got in response was: \"Because you're gifted!\"</p>\n<p>Shuri couldn't even hide her cultivation (even if she knew how to) because she was forced to undergo weekly checkups with Jean to monitor her well-being!</p>\n<p>On the bright side (at least that's what Shuri would tell herself regularly), she now had a wide enough mana domain to |Inspect| her surroundings and understand things more intimately. And the first thing she used this newfound ability on was to properly gauge the mana scarcity of her surroundings.</p>\n<p>The books forwarded by her mother's clan provided extremely precise details about what constitutes a mana sink. A mana sink is always in a mana-scarce region, but not the other way around. So Shuri needed to run different series of tests and observations. The process would be easy if the inspector was someone in the Foundation Establishment realm or above, as their mana domain would be large enough to provide better readings. However, Shuri was apprehensive about sharing the Yoruz Clan's books with anyone else; the name was still taboo in the Solar Empire.</p>\n<p>She had to make do with her piddling domain, which was admittedly much harder. Mana doesn't just disappear from a place. It can disperse, causing scarcity, but the nature of dispersal is what cements scarcity as a sink. The first sign of a mana sink is the formation of directed currents converging to a particular location. The alternative is if mana actively avoids a particular region. These are more common and are usually a result of artificial intervention such as from the existence of certain kinds of inheritance grounds, spells and ritual formations, and so on.</p>\n<p>The further you are from a sink, the weaker the currents appear to the mana sense. Isolating the current with her limited mana domain turned out to be a numerically intensive process involving discretisation, which would have been a breeze for the math monster in human form - Marie. But Shuri couldn't recruit her assistance... for reasons.</p>\n<p>But after a day's worth of work, split over multiple days, Shuri finally narrowed down the nature of the current flow. This was what she was following right now. After taking a few minutes to catch her breath, she stood up and continued her trek. Her vigilance was turned to its maximum value and her movements were steady.</p>\n<p>As she vaulted over another branch and landed on her feet, a series of movements caught her attention. She immediately pushed her back against the nearest tree and looked around the denser forestry. Her eyes darted around, searching for the source of the noise until a few moving shadows caused them to halt and narrow. Shuri swallowed a dry gulp as her mouth dried up like a desert in the middle of summer.</p>\n<p>A low growl resonated as paws started to move out of the darkness, revealing the snarling faces of a pack of drooling wolves. The creatures moved with coordination, circling her, cornering her. The pack leader, who was the largest of the group, released a chuff causing the rest to move closer while he remained in the back.</p>\n<p>Shuri glanced upwards and scolded herself for finding the shortest tree in the area to hide against. Even if she climbed this, the height wouldn't be enough to keep her out of the range of the wolves if they stood on their hind legs.</p>\n<p>She reached into her coat and pulled out her wand. Although death was staring down her nose, she wasn't prepared to accept it yet.</p>\n<p>An ethereal purple spell formed at the tip of the wand, and a |Fireball| barrelled towards one of the wolves, who dodged it with an anticlimactic strafe. Shuri bit back an insult and tried again.</p>\n<p>And again.</p>\n<p>But these wolves seemed smart, precognitive even. Even their blind spots weren't blind to them as they manoeuvred around the attack easily. At that moment, she realised that the alpha remaining behind was directing the group with varying sounds and noises. He should have been her target from the start!</p>\n<p>Alas, it was too late. A moment of hesitation was enough for the wolves to capitalise. The closest one pounced at Shuri with its mouth ajar.</p>\n<p>She raised her hands instinctively and waited for the pain.</p>\n<p>But what followed was a strong gust of wind blowing past her face followed by yelps of pain from her attackers. Opening her eyes, she was greeted by a violent sight of a snaking wind vortex brushing circling her and pushing the pack away. The wolves barked and tried to intimidate the vortex only to be greeted by a mouthful of air and a concussion. The alpha was smarter and immediately howled to order a retreat. He glared at Shuri before he left, as a warning no doubt.</p>\n<p>\"Isn't this a coincidence,\" a familiar voice spoke up as it circled past Shuri's \"protective\" tree. \"Now why would you do something so dangerous by yourself?\" Marie chided Shuri with her hands on her hips.</p>\n<p>\"I knew it!\" Shuri responded. \"You couldn't have known that I would be here unless you were following me, OR you foresaw my future and chose to intervene here!\"</p>\n<p>\"What are you talking about?\" Marie responded with one brow cocked with intrigue.</p>\n<p>\"Why are you so honed in on me as opposed to everyone else? From the beginning, I was the only one in your sights! Why is that? What is your intention with me?\" Shuri shot back one after another.</p>\n<p>\"Woah! Woah!\" Marie interrupted, moving her hands in a reconciliatory motion. \"Hold your horses! I wasn't following you.\"</p>\n<p>Marie moved aside and revealed a confused Dora. \"I was just accompanying this rascal for her mission.\"</p>\n<p>\"Mission?\" Shuri parrotted, voicing her confusion.</p>\n<p>\"I'm going to meet Fancy!\" Dora answered while moving forward with a small potted flower.</p>\n<p>Shuri forcefully suppressed her curiosity from voicing out the question regarding this Fancy's identity. Thankfully, Marie took over with a question directed her way.</p>\n<p>\"What are you doing here?\"</p>\n<p>\"I'm testing a few hypotheses,\" Shuri responded vaguely.</p>\n<p>\"Well, I hope none of those hypotheses required you to walk around a forest filled with predators, with a bloody piece of meat in your pocket?\" Marie spoke back sarcastically.</p>\n<p>'Fuck!' Shuri reached into the pocket and retrieved said piece of bloody meat. She tossed it aside and suppressed a growl from escaping her mouth.</p>\n<p>Her second suspicion would remain unsolved today. She wanted to confirm the reason for the undue interest Marie had in her. This rather risky manoeuvre would verify it, but it seemed that the girl was a step ahead of Shuri... as always.</p>\n<p>'No matter! I will get you... eventually...' Shuri promised herself while she followed Marie and Dora as they trekked onwards.</p>\n<p>Interestingly, their path overlapped with Shuri's trajectory towards the suspected mana sink. Shuri decided to follow up on her curiosity and chose to inquire about who this Fancy was.</p>\n<p>At that moment, the group passed through an imperceptible barrier. Shuri's vision warped, and what appeared to be a dense forest shifted to reveal a vast meadow filled with beautiful flowers and a pleasant atmosphere hanging above it.</p>\n<p>\"This-\" Shuri was about to speak when Dora's horror-stricken shriek suddenly drowned everything.</p>\n<p>\"FANCY!\" Dora bounded forward, towards a large tree at the centre of the meadow, but was immediately caught by Marie.</p>\n<p>\"Dora, wait! It's dangerous!\"</p>\n<p>Shuri looked ahead and noticed a heavy mist of pollen covering one quadrant of the meadow, which was completely wrecked as if a small battle had transpired there.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/3yb19a49c2gefgsir8d3ik0\">Chapter 311 - Directed Evolution</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/jrr2hwauiw7cyb8kh3fz5x4\">Chapter 309 - Build Your Own Wand</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}