{"pageProps":{"note":{"id":"4ujedu14w2zi4a0cgdjijxt","title":"Chapter 226 - Final Goodbye","desc":"","updated":1664179998852,"created":1661363901835,"custom":{},"fname":"volume-4.chapter-226","type":"note","vault":{"fsPath":"vault"},"contentHash":"cbb4e1289bb1c1e77391463530391750","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-226","id":"4ujedu14w2zi4a0cgdjijxt","vaultName":"vault"},"value":"volume-4.chapter-227","position":{"start":{"line":75,"column":3,"offset":11328},"end":{"line":75,"column":27,"offset":11352},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-227"}},{"from":{"fname":"volume-4.chapter-225","id":"s6ln2hfnjcz0y2bpxq7d123","vaultName":"vault"},"type":"backlink","position":{"start":{"line":81,"column":3,"offset":10132},"end":{"line":81,"column":27,"offset":10156},"indent":[]},"value":"volume-4.chapter-226"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-226---final-goodbye\">Chapter 226 - Final Goodbye<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-226---final-goodbye\"></a></h1>\n<p>The Palace of the Sun was like a fortress. Although there weren't many large-scale and visible fortifications surrounding its structure, it was a fact that no one unauthorised could enter or exit the Palace with their lives intact. Through the use of a myriad of ritual formations, artefacts, and a handful of veritable mage powerhouses, the Palace of the Sun was an impenetrable monument that acted both ways.</p>\n<p>If it were so easy to escape from the Palace, Shuri would have done so years ago. There are always eyes and ears guarding and observing the goings on in the Inner Palace. The only safe place is within a courtyard which is further guarded by privacy ritual formations that ward off snoopers. Of course, observers can't keep track of everything all the time. In certain instances, there are lapses in surveillance that one can take advantage of. But these gaps are tight and require intimate knowledge of the inner workings of the palace security to exploit thoroughly.</p>\n<p>Eunuch Bang had worked in the palace for at least a decade and a half by this point and he was high enough on the totem pole and had the right connections to have access to this information.</p>\n<p>\"Eunuch Bang!\" A mid-to-high countertenor voice, a common characteristic among eunuchs who were castrated prior to or during their puberty, interrupted Eunuch Bang's hurried steps. Eunuch Bang flinched subtly, he knew who the voice belonged to and he was already anticipating the exhausting barbs he would have to contend with by entertaining the source of the voice. But there was nothing he could do, he couldn't avoid it. After all, the voice belonged to the Eunuch assigned to the currently favoured Concubine Lowl.</p>\n<p>\"Eunuch Cass,\" he greeted with a strained yet professional smile. He turned to face a slender figure of a man, or rather a slightly larger child, adorned in the standard garish green uniform worn by the eunuchs of the palace. The man-boy's face was drenched in layers of make-up, a requirement enforced upon Eunuchs to further suppress their masculinity (we couldn't have the women of the inner palace getting attracted to men other than the Emperor!).</p>\n<p>\"This one wonders where Eunuch Bang is so frantically rushing off to, with a Petruvian Carpet to boot?\" Eunuch Cass mocked. \"The way you're grasping at the roll almost convinced me that you are hiding away your dignity in there.\"</p>\n<p>The jeer elicited a chorus of muffled snickers from the entourage following Eunuch Cass. Eunuch Bang stifled a growl and shook his head at the immaturity of the group. 'It's as though losing their cock and balls has stunted their growth in more ways than one.'</p>\n<p>A myriad of retorts flitted through Eunuch Bang's mind at that instant. Alas, he had to discard over ninety per cent of those come-backs because he was pretty sure it would all just go over their heads. Nonetheless, indulging these miscreants with a repartee would be counterproductive and time-wasting.</p>\n<p>Eunuch Bang revealed a dim-witted laugh and scratched his head with his free hand, \"Oh this? I'm taking this to the Willow Wood Courtyard. The existing carpet in Princess Shuri's welcoming room is a bit worn out.\"</p>\n<p>The man-boy's face twitched as he failed to recollect where the Willow Wood Courtyard was and who Princess Shuri was. Luckily one of his lackeys leaned forward and clarified.</p>\n<p>\"It's the Haunted Courtyard,\" they said.</p>\n<p>Eunuch Cass shuddered involuntarily at the mention of that forsaken courtyard. He had once gotten lost in the periphery of the maze-like garden at night and nearly soiled his uniform after a creeper collapsed on him without warning. It was an embarrassing memory he dearly wished to erase from his mind. Unfortunately, that tryst was observed by one of the members of security and was a common topic of jest in their circle.</p>\n<p>\"I'll be going then,\" Eunuch Bang quickly said while Eunuch Cass wallowed in his irritation and started to walk briskly towards his destination. He only had a few minutes remaining to enter the safety of Princess Shuri's courtyard, before the observers resumed roving their eyes over the Inner Court.</p>\n<p>He walked with floating steps, gliding seamlessly over the ground until he finally arrived at the depressing and eerie gardens garrisoning the Haunted Courtyard. Like a cat navigating through thick shrubbery, Eunuch Bang slithered and wove through the foliage, all the while slinging the roll of carpet over his shoulders. Once he faced the entrance to the courtyard, he hurriedly calmed his nervous breath, raised his free fist and proceeded to open the door.</p>\n<hr>\n<p>\"Although the Empire forbids and heavily polices blood magic, every descendent of the Emperor is monitored and tracked using an intricately and secretly woven blood magic ritual formation,\" Eunuch Bang explained to Shuri as she gazed unwaveringly at the comatose body of a Palace Maid resting on an unfurled roll of carpet.</p>\n<p>\"As long as the ritual formation recognises the Princess as alive, it will raise an alarm once Your Highness leaves the Palace premises,\" he elaborated. \"This was how they were able to track down the Second Princess when she sneaked out of the Palace for a tour of the city in disguise so easily. I was able to glean this information from the Security Department through great difficulty.\"</p>\n<p>\"Let's move forth all the formal talk,\" Shuri declared. \"We are past titles at this point.\"</p>\n<p>Eunuch Bang revealed a wry smile and continued, \"Thankfully, the blood magic ritual formation is as basic as it gets. Its targeting method is the blood flowing through your body. Hence, on paper, it should be possible to fool it if we remove all the blood inside your body and replace it with another's.\"</p>\n<p>\"Theoretically?\"</p>\n<p>\"It's not like I've had the opportunity to try it out with another Prince or Princess,\" Eunuch Bang jested sarcastically. \"But I can assure you that it is absolutely safe. I have done the leg work and run tests with the technique. It involved a lot of scouring through the black markets to get my hands on this method - if the Solar Sect Alliance or the Department of Interior were to learn of this the punishments would be severe as it is blood magic, after all.\"</p>\n<p>\"It's not like I have a choice in this matter anyways,\" Shuri evoked with a sigh. \"What of my escape strategy? I am guessing I'll be switching my attire with this maid?\"</p>\n<p>\"Actually...\" Eunuch Bang drawled as he yanked his pupils towards a folded set of clothes hidden amidst the crease of the carpet. With brows cocked up curiously, Shuri bent over and unfolded them only to instinctively recoil with irritation and disgust.</p>\n<p>\"It is easier and markedly safer to travel disguised as a boy,\" Eunuch Bang said assuringly.</p>\n<p>\"I'm not wearing this,\" Shuri declared while crumpling the simple male commoner attire consisting of a basic cotton shirt and roughspun trousers.</p>\n<p>\"I implore you to reconsider,\" Eunuch Bang tried again, only to receive a resolute denial in the form of a blank stare from Shuri. Releasing a sigh, Eunuch Bang pulled out his hand from his loose cuffs and flicked forward a circular plate in his palms. From it, another set of outfits spawned out, this time it belonged to a commoner girl.</p>\n<p>\"I shall prepare the spell while you change,\" Eunuch Bang said.</p>\n<p>Within ten minutes, Eunuch Bang drew out two large spell circles that intertwined at their circumferences. At the centre of one, he lay the comatose maid and on the other lay a conscious Shuri. The man released a long breath of air to clear his airways and then pulled in a lungful of fresh breath. Following that, a rumble of unintelligible words left his lips.</p>\n<p>As the spell chanting progressed, the drawn circles started to gain an ethereal purple glow, which started to turn a dangerous shade of red progressively. The ethereal circles rose from the ground and started to rotate like two gears meshing. With a hiss followed by a pop, a gushing cloud of red droplets started to rush out from the comatose maid and Shuri synchronously. Both their skin started to turn paler as a mirrored human form of scarlet-red, undulating blood took shape above their bodies. The change was significantly more visible on Shuri's face since she lacked the olive tan the maid had due to her lack of regular exposure to the sun. As the extraction progressed further, the women's hair started to change shade as well and assumed an aged silver colour. Finally, once the undulating blood human above their bodies gained a substantially sold form, Eunuch Bang stopped his incantation and rotated his arms clockwise. He stopped as his right arm was above his head palm facing downwards, and his left arm was by his abdomen palm facing upwards. In achieving this posture, the two blood humans switched positions above their respective sources. Finally, with an echoing clap, Eunuch Bang brought his hands together causing the blood humans to pop like a pressurised vessel. The red particles started to dissipate and rushed back into the bodies of the humans below them, bringing back the tint and life to their aged skin, though their discoloured hair remained as is.</p>\n<p>\"Did it work?\" Shuri asked between heavy breaths.</p>\n<p>\"It did,\" Eunuch Bang confirmed.</p>\n<p>\"In my life in the Inner Palace, I have learned that curiosity can often lead to a quicker end, which is to say that knowing little is a boon. The only way to survive here is to care about one person and that is yourself - I treated affection and empathy as poison. Because of that, I find it difficult to fathom how my mother could go through everything she did for my sake. I cannot fathom why you are walking down this path for me either,\" Shuri confessed. \"You do realise what lies at the end of this road for you, right?\"</p>\n<p>To that, Eunuch Bang revealed a mirthful laugh and said, \"There will come a time when the truth will reveal itself. You will meet a person- no I pray dearly that you do meet a person who will burst through all the barriers you have in place to shield your heart and soul. I pray dearly that you find a person who connects with you, makes you feel all the emotions you have repressed, makes you smile every day and makes you want to spill out all of your secrets without withholding anything. Because only then will you realise that maybe, just maybe, drinking a chalice full of this poison called affection and empathy for their sake may not be so bad after all. Because even if you succumb to this poison and die an untimely death it will all be worth it since there will no longer be any regrets tying your soul down and eating you up from within.\"</p>\n<p>Shuri absorbed Eunuch Bang's final words, though she could not understand all of them. With a morose nod, she said, \"Today, Shuri Sol has died. I thank you for everything you have done, and everything you have sacrificed for me and my mother, Eunuch Bang. My final order as the Princess shall be this: Do not suffer in your death.\"</p>\n<p>Eunuch Bang lowered his head in assurance and did not look up at the girl's face that reminded him so dearly of his deceased Mistress. While he suppressed his overflowing whimpers and tears, Shuri turned around and made her way towards the secret exit at the back of the kitchen. Her face and gaze remained unwavering, and her heart was resolute. No emotion barring an unassailable tranquillity overtook her mind.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/18y227lz3py7x5ybgusrx48\">Chapter 227 - Distraction</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/s6ln2hfnjcz0y2bpxq7d123\">Chapter 225 - Tenuous Peace</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}