{"pageProps":{"note":{"id":"5cj9g2ginzmg94d6hlj6h32","title":"Chapter 354 - The Frivolous Four - The Fire (Part One)","desc":"","updated":1693396124155,"created":1690200365811,"custom":{},"fname":"volume-5.chapter-354","type":"note","vault":{"fsPath":"vault"},"contentHash":"b9622edd26264e4983a6e5ea891c452a","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-354","id":"5cj9g2ginzmg94d6hlj6h32","vaultName":"vault"},"value":"volume-5.chapter-355","position":{"start":{"line":103,"column":3,"offset":10768},"end":{"line":103,"column":27,"offset":10792},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-355"}},{"from":{"fname":"volume-5.chapter-353","id":"44qqd29dnp7y32wzt9i09et","vaultName":"vault"},"type":"backlink","position":{"start":{"line":129,"column":3,"offset":10123},"end":{"line":129,"column":27,"offset":10147},"indent":[]},"value":"volume-5.chapter-354"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-354---the-frivolous-four---the-fire-part-one\">Chapter 354 - The Frivolous Four - The Fire (Part One)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-354---the-frivolous-four---the-fire-part-one\"></a></h1>\n<p>\"You don't have to follow us, you know?\" Markus said casually to Dora, who was walking beside him and struggling to keep up with the pace of the group of five consisting of Revian, Kevan, Casey, Lacey and Markus.</p>\n<p>\"I have to go meet Fancy anyways - it's been some time since we last talked,\" Dora said between breaths while waving her hand dismissively. \"She said she was going to be busy growing, or something like that. She went into her tree and hasn't come out since then.\"</p>\n<p>\"Are you sure that she is okay?\" Markus probed. \"Marie told me that the creat-\"</p>\n<p>He held back his words as Dora gave him an enraged glare. \"I mean- Marie told me that Fancy underwent some unknown fusion evolution.\"</p>\n<p>\"You know what's weird?\" Dora responded with a high pitch. \"I don't even remember that happening. One second, I was looking at one part of the meadow completely wrecked and Fancy dying, and the next thing I knew, I was looking at a completely different Fancy who was completely fine.\"</p>\n<p>\"You did something, how do you not remember?\" Markus responded in disbelief.</p>\n<p>\"I don't know,\" Dora shrugged while continuing the trek.</p>\n<p>\"And that doesn't bother you?\"</p>\n<p>\"Whatever happened saved Fancy,\" Dora answered matter-of-factly. \"Who cares what it was.\"</p>\n<p>Markus wanted to argue against that point, saying, 'What if whatever happened has some negative consequences of the line?'</p>\n<p>But then he didn't because he realised Dora wasn't old enough to understand what \"far-reaching consequences\" are. Actions have consequences, some are immediate, and others are more distant and vaguer. People make decisions based on a set window of time within which their actions yield a particular consequence. Maturity is the process by which this time window grows large enough to encompass your entire lifetime.</p>\n<p>Dora's time window was short, which was fine. Markus did not want his younger sister to mature too early like he and Marie did. After all, living in ignorance was a gift only afforded by children.</p>\n<p>\"Well, try not to disturb them,\" Markus warned while picking up the panting girl and placing her on his shoulder. \"They are about to do something dangerous, so let's not make it harder for them than it already is.\"</p>\n<p>Dora nodded with a serious expression and dragged her pinched index finger and thumb over her lips, \"My lips are sealed!\"</p>\n<p>Markus let out a light chuckle and followed the quartet of investigators walking with both excitement and hesitation. He could feel the palpable tension growing on them with each step forward. It was the anticipation and expectation of what was to come.</p>\n<p>At this moment, only a single thought - a question - swam in their heads: \"Will the experiment succeed or will it fail?\"</p>\n<p>As such, Markus didn't feel the same level of pressure in anticipation, because he had a gist of how the experiment would turn out. After living and working closely with Marie, he'd learned how to decrypt her cryptic words. Things that were said in passing held meaning. Things that sounded simple and straightforward often weren't. And things that were important and emphasised... well, they were important!</p>\n<p>Luckily, this skill also extended to the words spoken by her Master who, thankfully, wasn't so annoyingly cryptic as she was. Her Master said that the experiment wouldn't fail as long as the quartet stuck to their safety procedures to the letter. While this wasn't an explicit indication of whether the experiment was successful or not, it did carry one key meaning. If the experiment wasn't going to fail then they were certain to get some kind of meaningful result. Even if the result wasn't a success, but a dud, it would be a learning experience.</p>\n<p>Of course, no one WANTS their experiment to not yield anything - it is only natural.</p>\n<p>A few minutes later, the group arrived at a familiar location in the forest, at which point Dora swiftly leapt off of Markus' shoulder and rushed forward.</p>\n<p>As she crossed an imaginary threshold, Dora vanished like smoke in the air.</p>\n<p>\"So this is the place?\" Revian turned and asked Markus, looking for confirmation. Responding with a firm nod, Markus walked onwards and followed Dora through the imaginary threshold.</p>\n<p>The scene before him crumbled like powdery snow, and the previously dense shrubbery dispersed to show a beautiful meadow sprawling with flowers of various shapes, sizes and colours. At the centre of the meadow, which rose like a small hill, stood an intimidating tree that appeared hollow and porous with large holes dotting every visible section of its bark. Surprisingly though, there was an eerie darkness inside that set off alarm bells across Markus' spine.</p>\n<p>Dora, though, was not hindered by the creepy tree and skipped towards it eagerly, while calling out, \"Fancy! I'm back!\"</p>\n<p>Markus stopped the urge to pull the girl back, trusting the fact (against his better judgement) that the creature within wouldn't hurt her. Thankfully, the creature did not show itself no matter how much Dora called out its name. After making sure that the coast was clear, he edged closer to his disappointed sibling and pulled her close into a consoling hug.</p>\n<p>By this time, the quarter outside the illusory meadow had passed the barrier and entered the vibrant field.</p>\n<p>\"\"Wow\"\" The twins evoked in a tone overflowing with enamoured awe.</p>\n<p>The boys were however drawn to the tree, which properly itched their adventurous spirits. Little did they know that a beast capable of putting them into an endless sleep had set it up as its abode.</p>\n<p>\"Let's not gawk around,\" Markus declared with a loud clap. \"Start the preparation for the experiment.\"</p>\n<p>The quartet snapped out of their reverie and shuffled around to set up the experiment ground.</p>\n<p>\"What is the radius within which the mana sink's effects are valid?\" Revian asked out loud.</p>\n<p>Markus tilted his head sideways, in thought, and answered, \"According to Shuri, it should cover the entire meadow. Actually, you can treat the flower field as the boundary.\"</p>\n<p>\"Can we use the scorched region?\" Kevan inquired as he moved towards the sector of the meadow devoid of any plants - a remnant of the battle that once took place here.</p>\n<p>\"That would be preferred. We should strive to maintain the state of the environment where we work,\" Markus explained.</p>\n<p>The group agreed with each member nodding simultaneously. Revian dropped the bag he was carrying to the ground carefully and pulled out a box from within. Opening it up, he revealed stacks of mana crystals perfectly cut into cuboids of standard yet varying sizes.</p>\n<p>\"This is an expensive experiment,\" Markus reminded. \"Please be mindful of wastage. Mana crystals aren't so easy to source for sects like ours. Usually, large and most medium-sized sects are built on mana-dense regions which tend to have caves that grow mana crystals naturally. Ours, on the other hand, is built next to a sink. This means that while there is an abundance of inert cores (which is arguably more expensive than mana crystals) we face a shortage of mana crystals.\"</p>\n<p>\"We've tried to minimise wastage to the best of our abilities,\" Casey affirmed. \"The excess shavings from these crystals have found use in some minor alchemical work spearheaded by Matron Reva.\"</p>\n<p>\"Also,\" Lacey interjected. \"We've reworked our experiment procedure slightly. We anticipate up to two failed trials from each of us - which is a worst-case estimate.\"</p>\n<p>\"We first verified the density of a mana crystal using the buoyancy principle, by submerging the crystal in a container of fluid (distilled water). The mass of a series of cuboid mana crystals of varying volumes was measured. We then checked the displaced volume of water when submerging the crystal, against the geometric volume and confirmed that they were the same. Dividing mass and volume yielded the density, which was found to be consistent with an error of +/- 0.0043 kg/m^3. It was also found that a mana crystal is pure and compact with no air pockets or irregularities,\" Revian declared. \"That short study also spawned a hypothesis that mana crystals are formed in a manner similar to salt crystals, which warrants further study but is not the focus of this experiment.\"</p>\n<p>\"You should post that hypothesis on the public boards and encourage others,\" Markus offered. \"There's a lot of idle minds roaming around in the Sect that could use some purpose.\"</p>\n<p>Revian retrieved another box from his bag and opened it to reveal a programmed mana core the size of his palm. \"The Time-Core developed by Senior Sister Shuri has been tested and confirmed to be functional and precise to the nearest millisecond.\"</p>\n<p>He picked out another box and revealed another programmed core the size of a marble, \"The Tempera-Core developed by Senior Sister Shuri has been tested and confirmed to be precise to the nearest 0.01 Kelvin.\"</p>\n<p>Finally, he picked up a small (nearly twice the size of his palm), vacuum-sealed metal tank covered with greying wool that had two colourless and lustrous mana gems attached to its side and a slot for a mana core on its opposite end. \"The Caloric Tank filled halfway with Enthermis Fluid, was tested and confirmed to be functional.\"</p>\n<p>The Caloric Tank was an invention devised by the quartet. Its purpose was to contain heat. It was made out of copper with a fire-resistant wool outer coating. Inside, was a fixed volume of Enthermis Fluid, a commonly used alchemical catalyst with high thermal conductivity and specific heat capacity (which was also determined by a separate caloric test). One of the mana gems on the tank, when exposed to fire, would absorb the heat released from the exothermic reaction and completely translate it into kinetic energy to increase the temperature of the fluid within. Until the second mana gem is activated, the container would maintain the temperature until the first mana gem runs out of mana (which was implausible since the upkeep of mana cost was trivial). The enchantment was a creation of the quartet and took them an entire week. It was commissioned through the Burning Forge as there could be no room for errors!</p>\n<p>Revian carefully attached the Tempera-Core to its respective slot on the container and turned it on to verify that the system worked.</p>\n<p>The entire experiment was being bankrolled by the Sect, which did add a huge burden upon the shoulders of the young scientists. Failure was an option, but not a welcome one.</p>\n<p>The group released a long breath of anticipation altogether. This experiment took over a month to set up, to get all the apparatuses ready and run the preliminary tests that would validate the safety and accuracy of the results obtained.</p>\n<p>Kevan glanced at his lab mates and asked for the final time, \"Are we all ready?\"</p>\n<p>The question was met with a firm and determined nod from the other three. And so, it began.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/9fyqscdtc0jazuzzbaecmg0\">Chapter 355 - The Frivolous Four - The Fire (Part Two)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/44qqd29dnp7y32wzt9i09et\">Chapter 353 - The Frivolous Four - The Spark (Part Two)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}