{"pageProps":{"note":{"id":"5jnhw8ky7ej1zmffmxx5zpo","title":"Chapter 349 - The Design Process","desc":"","updated":1691135813211,"created":1689332255873,"custom":{},"fname":"volume-5.chapter-349","type":"note","vault":{"fsPath":"vault"},"contentHash":"23e9cd28ad04b69055fe63b50ae1435a","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-349","id":"5jnhw8ky7ej1zmffmxx5zpo","vaultName":"vault"},"value":"volume-5.chapter-350","position":{"start":{"line":71,"column":3,"offset":10645},"end":{"line":71,"column":27,"offset":10669},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-350"}},{"from":{"fname":"volume-5.chapter-348","id":"ygwlpee3vw412qev3r10nto","vaultName":"vault"},"type":"backlink","position":{"start":{"line":121,"column":3,"offset":10091},"end":{"line":121,"column":27,"offset":10115},"indent":[]},"value":"volume-5.chapter-349"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-349---the-design-process\">Chapter 349 - The Design Process<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-349---the-design-process\"></a></h1>\n<p>There are over 43 quintillion unique possible arrangements for a standard 3-by-3-by-3 Rubik's cube, which is an incredibly large number! To put it into perspective, if someone were to count from 1 to 43 quintillion at a rate of one number per second, it would take them approximately 1.37 trillion years to reach that amount. This exceeds the age of the universe by several orders of magnitude.</p>\n<p>When we reduce the cube to a two-by-two-by-two, the number of possible arrangements is significantly decreased to just 3,674,160 possibilities, slightly over three million. Even this smaller number is still quite substantial and difficult to comprehend.</p>\n<p>Shuri found this fascinating. It was just a factoid, after all, but it sparked a sense of possibility. It both stimulated and satisfied the itch originating from her core.</p>\n<p>Her thoughts returned to Yohn reading his book using tactile sensors. Being visually impaired means lacking one of the senses most people take for granted: sight. While individuals can survive and lead relatively normal lives without taste or smell, the absence of hearing or touch makes life more challenging. However, for someone who is blind, their entire life is completely upended.</p>\n<p>A blind person must rely on their remaining senses to compensate for their lack of sight – they need to listen, feel, and smell to navigate their surroundings and understand what to do. Yet, the limitations imposed by the absence of vision are particularly difficult to overcome in the realms of magic and cultivation. This is because casting spells requires envisioning intricate spell circles. For someone who has never seen a spell circle, achieving this becomes impossible. A mage who becomes blind can still continue their path in magic, but a novice without prior knowledge of magic who is blind would be unable to progress.</p>\n<p>In fact, even a mage who becomes blind after embarking on their magical journey would struggle to cast unfamiliar and new spell circles. Standard spell circles are read as a whole, unlike those developed using the modular spellmaking method with compartmentalization. In the latter method, the components of a spell can be rearranged, allowing for the construction of spells on the fly. So, if a mage afflicted with blindness had been introduced to this methodology before losing their sight, they would not face the same difficulty in casting spells.</p>\n<p>\"Arrangements, tactility, modularity,\" Shuri repeated.</p>\n<p>Individually, these three concepts didn't make much sense. However, when Shuri brought them together, it triggered an explosion of ideas in her mind.</p>\n<p>\"Yohn doesn't have to see the spell circle, he just has to cast it; his mana channels need to be stimulated,\" Shuri started.</p>\n<p>\"Spell modularity implies that we can put them together like building blocks to achieve the results we desire,\" she continued.</p>\n<p>\"And tactility...\" Shuri harkened back to her method to solve the Rubik's cube. She had familiarised herself with it to the point that the solution process had turned into muscle memory. She could quite literally solve the cube with her eyes closed.</p>\n<p>\"You need such familiarity and speed when casting spells, especially in a combat capacity,\" she affirmed. She and her visually gifted peers could cast spells in quick succession with the help of the wand. Now, she could even cast simpler spells without the help of the wand.</p>\n<p>Images, concepts, ideas and solutions started to flash through her memory, nothing stood in place for more than a second. To her, it felt like she was on the cusp of coming up with an answer, but was just one step shy. It was almost the same as when you're on the edge of a sneeze but not all there yet, except the moment was extended for a much longer and more excruciating duration.</p>\n<p>Shuri grabbed her head and released a long breath of air. The way her mind was approaching the problem felt scattered and aimless. To her, it felt similar to a candle burning in the middle. \"There's no end to it if things go on like this. I need a process.\"</p>\n<p>She retrieved an empty parchment paper from her desk and started by writing \"Defining the Problem\" as a heading. The first step in the design process was understanding what is the problem that needs solving. This is usually written in the form of a design brief. This answers the question of who the target audience or market is. What the objective of the project is (what is the need or want being met)? When is the project deliverable by? Where is the product meant to be used? Why is this project significant?</p>\n<p>\"The target audience is Yohn- No, that seems too specific. Let's say it's for the visually impaired folk looking to walk the path of magic and cultivation. The objective is as defined, which is to provide an alternate pathway to cast spells, work the mana channels and advance in cultivation. It needs to be finished as soon as possible. The output from this project will be used in place of a magic wand. It is significant because...\"</p>\n<p>Shuri stopped writing and looked at the incomplete sentence with a bitter smile. She felt there was definitely some irony in answering that question. All her life, all Shuri worried about and cared for was herself; survival of self above all else. This could be said to be the first time she was ever attempting to do something of significance for the benefit of another person. She could string together words and rationalise her actions to say that they would benefit her in the end. But the fact remained, \"In the end, this project will make magic more accessible to people. Disabilities won't be a barrier of entry any more.\"</p>\n<p>With the brief finalised, it was time to jot down the design specifications.</p>\n<p>The device should provide tactile cues to convey information to the user. This could involve buttons, switches, or touch-sensitive surfaces that offer tactile feedback, such as raised symbols or Braille. Shuri discarded the idea of audio feedback or cues because it was impractical in combat. You would basically be projecting your actions to the opponent, and the sound could get doused in the heat of battle.</p>\n<p>The device should be designed with accessibility in mind, ensuring that blind users can easily and intuitively interact with it. This includes considering factors such as button placement, size, and spacing, as well as designing a logical and straightforward user interface.</p>\n<p>Since the person cannot see, the device should represent the spells in a non-visual format.</p>\n<p>The device could incorporate features to assist with navigation and orientation, helping blind users locate and select spells. This might involve directional cues or a tactile interface that allows for exploration and easy navigation.</p>\n<p>Considering the practicality of using the device, it should be designed to be durable, lightweight, and portable. This allows users to easily carry and use the device in different environments or settings.</p>\n<p>Implement safety features to prevent accidental or unintended spell casting. This could include confirmation prompts or physical safeguards to ensure users are intentionally initiating spells and prevent unintended consequences.</p>\n<p>Use durable and reliable materials that can withstand regular usage and potential impacts. Consider factors such as grip, ergonomics, and overall device durability to enhance usability and longevity.</p>\n<p>Finally, for the matter of future-proofing, the device could include features to support learning and skill development for blind users. This might involve a tutorial mode, accessible documentation, or built-in learning resources to help users understand the magic system and improve their casting abilities.</p>\n<p>These were among the more important design specifications Shuri listed.</p>\n<p>The design brief and specifications provided Shuri with a solid and comprehensive framework to guide her throughout the design process. They served as a valuable reference, ensuring that she wouldn't deviate or become distracted by unrelated ideas. Now, whenever her mind generated new concepts or solutions during idle moments, Shuri could assess their relevance and alignment with the brief and specifications. This allowed her to easily discard irrelevant ideas or store them for future consideration, maintaining a clear focus on the intended goals of the project.</p>\n<p>With the initial groundwork of the design brief and specifications completed, Shuri realized that the next crucial step was to embark on the journey of research and information gathering. This phase would involve conducting both primary and secondary research to delve deeper into the problem at hand. The primary goal was to gain a comprehensive understanding of the challenges faced by visually impaired individuals in the realm of magic and cultivation. Additionally, this research would help her avoid redundancy by identifying any existing solutions or attempts made in this area. By building upon previous knowledge and experiences, Shuri could refine her approach and strive for better results.</p>\n<p>Before diving into the research, Shuri recognized the importance of obtaining a first-hand perspective from Yohn, the intended user of the magic casting device. Understanding his unique needs, preferences, and experiences would be invaluable in shaping the design and ensuring its effectiveness. With this in mind, she planned to arrange a private meeting with Yohn, providing an opportunity for an open and honest discussion.</p>\n<p>In addition to consulting with Yohn, Shuri also planned to explore the vast resources available at the library. She hoped to discover information on existing aids designed for the visually impaired, seeking inspiration and insights. Shuri was particularly interested in uncovering any records or historical accounts related to blind mages if such information existed. This knowledge could potentially shed light on past attempts to address the challenges faced by visually impaired individuals in magic casting.</p>\n<p>However, Shuri was well aware that the library might not hold all the answers she sought. To bridge any information gaps, she planned to leverage the regular visits of travelling merchants to the village. Shuri intended to commission purchases or seek their guidance in finding relevant materials, devices, or even accounts from other bookstores that might provide further insights into her research.</p>\n<p>Feeling a mixture of exhaustion and determination, Shuri chuckled at the irony of returning to the library so soon after returning from that place. With a tired groan, she gathered her belongings and began her ascent from the dormitory and up the steps leading back to the library.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/bywoev0d5p1dc6eyg9svls2\">Chapter 350 - The Research</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/ygwlpee3vw412qev3r10nto\">Chapter 348 - Identifying Needs</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}