{"pageProps":{"note":{"id":"5rn1vdafy3i4u000jnxnaof","title":"Chapter 316 - My \"New\" Master","desc":"","updated":1684909421148,"created":1681724303242,"custom":{},"fname":"volume-5.chapter-316","type":"note","vault":{"fsPath":"vault"},"contentHash":"268006e3e702c9c34ea7de4a207e08dd","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-316","id":"5rn1vdafy3i4u000jnxnaof","vaultName":"vault"},"value":"volume-5.chapter-317","position":{"start":{"line":119,"column":3,"offset":10771},"end":{"line":119,"column":27,"offset":10795},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-317"}},{"from":{"fname":"volume-5.chapter-315","id":"63zasb2xzmxm8ksxr258ndi","vaultName":"vault"},"type":"backlink","position":{"start":{"line":87,"column":3,"offset":11366},"end":{"line":87,"column":27,"offset":11390},"indent":[]},"value":"volume-5.chapter-316"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-316---my-new-master\">Chapter 316 - My \"New\" Master<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-316---my-new-master\"></a></h1>\n<p>Markus approached his Master's room tentatively, his steps uncertain. Ever since his Master had achieved a breakthrough into the Core Formation realm, Markus had sensed a subtle change in his countenance and an indescribable aura about him.</p>\n<p>As he crossed the imaginary threshold ten feet from his Master's door, a heavy aura enveloped him, making each step increasingly difficult and the air denser.</p>\n<p>'This is my Master's mana domain,' Markus confirmed silently, wiping the cold sweat from his forehead. As a mage ascends to the Core Formation realm, they become more like beings of mana - ethereals. Eventually, the mana in and around the mage becomes an extension of their body, controlled involuntarily with the ease of breathing. Markus' Master was currently struggling to gain control over his substantially expanded mana domain.</p>\n<p>A mage in the Foundation Establishment realm could afford to leave their mana domain in its maximum circumference since it was relatively weak. However, a Core Formation realm mage's mana domain was triple the size and much stronger. Therefore, it was impractical to leave it active as it would cause inconvenience and offence to others. Thus, the mage had to keep their domain within a reasonable radius, a challenging task akin to an extremely muscular person wearing a shirt two sizes too small.</p>\n<p>After Markus took his third step into his Master's torrential domain, the pressure abruptly dissipated.</p>\n<p>'Sorry about that,' his Master's voice resonated within his mind via Mana Transmission. 'It's still a work in progress.'</p>\n<p>Markus managed a bitter smile, shaking his head as he slid open the door to his Master's room. As he entered, he took a deep breath, filling his lungs with the thick smoke of incense that permeated the air. The scent was indistinct but not unpleasant, and he felt a sense of calm wash over him.</p>\n<p>The room was simple, with minimal furniture and decoration. The only thing that stood out was the three large blackboards in the corner of the room. They were filled with chalk writing, diagrams and tables in his Master's distinct handwriting. His Master sat cross-legged on the floor behind the low work table, with his eyes closed as though in meditation. Markus did not wish to disturb his Master, and thus he assumed a cross-legged pose opposite him and waited patiently.</p>\n<p>As seconds ticked by, Markus' breathing slowed, and his sight grew blurrier.</p>\n<p>\"What do you see?\" He heard an authoritative, baritone voice all around him.</p>\n<p>\"I-I-\" Markus tried to speak, but his tongue failed him.</p>\n<p>At that moment, Markus felt a heavy thrust pressing against his chest, pulling the air out of his lungs. The weight pressing down on him receded abruptly, and he suddenly felt himself being pulled out of his own body.</p>\n<p>For a brief second, Markus felt himself turning into smoke - he became one with the concentrated air around him. His vision changed, and what he saw was a garbled mess of colours, lights, and blurry shapes. The nonsensical downpour of information started to grow sharper until he finally saw his own unconscious body. This vision lasted for a fraction of a second before he felt his smoke form dissipating. He opened his eyes and saw that the air in the room was free of smoke, and his Master was right up against his face with a palm placed on his chest.</p>\n<p>\"What did you see?\" The question was repeated, and Markus realised it was his Master's new voice.</p>\n<p>\"I don't know,\" Markus answered, noticing the right side of his Master's face twitching violently for a fraction of a second before his entire face assumed an uncertain frown.</p>\n<p>\"How did it feel?\" His Master followed up while crawling back into a cross-legged pose behind the worktable.</p>\n<p>\"Like I was no longer inside my body,\" Markus said, summarising the surreal experience.</p>\n<p>\"Did it feel good?\" His Master probed.</p>\n<p>\"A bit,\" was Markus' response.</p>\n<p>\"Interesting...\" His Master muttered.</p>\n<p>\"Umm,\" Markus vocalised, drawing his Master's attention. \"What was that?\"</p>\n<p>\"What was what? The smoke, the experience, or what I'm trying to do?\" His Master listed with a mischievous grin.</p>\n<p>\"Yes,\" Markus offered with a light chuckle.</p>\n<p>\"Well, that was the smoke from the burning of Dream Sage Grass.\"</p>\n<p>\"Isn't that a controlled substance?!\" Markus blurted out, choosing his words carefully to avoid implying that his Master had committed a crime.</p>\n<p>\"It is controlled only for mortals. Not for mages,\" Master corrected. \"The drug is flushed out of your system within seconds of ingestion. Don't worry, I've confirmed this with Jean already - you know just how difficult she can be.\"</p>\n<p>\"So am I right to assume that the experience was just a trip?\" Markus hypothesised.</p>\n<p>\"Not quite. It was an out-of-body spiritual excursion. Or at least an attempt.\" Master Larks reached for an open book on his table and turned it towards Markus. \"Mage Rizla documented his experiments to determine when it was easiest to advance one's spiritual cultivation. It is uncharacteristically thorough and follows the scientific method to the letter. It is an interesting read if you can ignore the casual racism, human rights violations, and multiple war crimes and crimes against humanity that he committed in the process.\"</p>\n<p>Markus squinted his brows and read the open page before his eyes darted out of their sockets. \"This is vile!\"</p>\n<p>\"Just skip to the results,\" Master Larks followed up immediately. \"It states that one can find greater success if they attempt spiritual cultivation in the early stages of magehood. The process is difficult since the tethers that bind you to the mortal realm can be very distracting and can avert your focus from your spirituality. But the use of Dream Sage Grass was shown to have some beneficial effect in the process.\"</p>\n<p>\"The results seem well substantiated, so I tried it out on myself. As expected, the effect was weaker on me due to my superior metabolism, but it should have a greater influence on you. Just earlier, I saw that it was working on you. I didn't want to waste this opportunity, so I tried a new technique I had in the works through which one can pull their soul out of their body.\"</p>\n<p>Markus sputtered before exclaiming, \"That sounds unsafe, Master!\"</p>\n<p>\"Not really. It's not so trivial to simply extract the entire soul from your body. One could even say it's impossible. The soul cannot exist without a vessel, just as a will cannot manifest and maintain itself physically in the world without a soul. In fact, the Tesseract Transformation realm is achieved when the mana core is fashioned into a vessel to hold the soul, which in turn ensures that the core doesn't dissipate. It's a perfect example of circular dependency,\" his Master paused the explanation to snort mirthfully. \"Anyway, at present, the vessel for your soul is your body. So I cannot completely remove your soul from it. If I did manage to do it, it would mean that I was practising necromancy and that too at a high level.\"</p>\n<p>\"Is there a purpose behind this technique?\" Markus redirected while trying to suppress the discomfort from the casual violation his Master just committed on him.</p>\n<p>\"It's to gain a better understanding of one's soul. If you can experience what it feels like to see the world through your spiritual eyes, it will make it easier for you to cultivate it,\" Master Larks explained.</p>\n<p>\"That sounds very... complicated,\" Markus admitted, his tone marred with confusion. At that instance, he noticed his Master's face twitching violently once again, and his head jerked abruptly from one side to the other.</p>\n<p>Worried, Markus reached forward to support his Master, but the maddened movement halted, and his Master spoke again. However, while the voice had the same tone, it had a much more pleasant and warm timbre.</p>\n<p>\"I'm sorry about that,\" his Master said with a sincere, apologetic frown. \"I guess I got ahead of myself there and forced you into something you weren't prepared for. It won't happen again.\"</p>\n<p>While the apology was directed towards Markus, he noticed a faintly chastising undertone that seemed to be self-directed.</p>\n<p>\"Umm... It's okay,\" Markus said apprehensively.</p>\n<p>\"No,\" was his Master's adamant response, \"it is not.\"</p>\n<p>Again, the snipe felt self-directed. The right corner of his Master's lip twitched violently, which was immediately met with a tight slap by his Master's left hand.</p>\n<p>\"Nonetheless,\" Master Larks continued through the left side of his mouth. \"Is this month's progress report?\"</p>\n<p>Markus nodded as he placed the folder he had carried with him on his Master's work table.</p>\n<p>\"I've been tracking the performance and progress of the students according to the designated metrics. At this rate, we can expect the cohort to move on to the intermediate level within the next month,\" Markus reported.</p>\n<p>\"That's good to hear. What is the student feedback regarding the course content and workload?\"</p>\n<p>Markus showed a bitter smile and said, \"They aren't used to such open communication.\"</p>\n<p>As he said this, Markus retrieved three sheets of paper from the bottom of the folder. \"The answers are far too diplomatic. In order to not offend anyone, they're being very respectful, and their criticism is packaged as praise.\"</p>\n<p>Master Larks perused the papers and nodded affirmatively. \"We may have to introduce some positive reinforcement to encourage the children to voice their criticism more openly.\"</p>\n<p>\"The presumed risk-versus-reward ratio is very high,\" Markus emphasised. \"From their point of view, they have more to lose if their criticism is taken poorly. So I suspect the reward must reflect this discrepancy.\"</p>\n<p>\"We'll have to brainstorm something for that, then,\" Master Larks hummed.</p>\n<p>The discussion continued for a few more minutes as Master Larks inquired about how specific children were coping with the new life.</p>\n<p>\"I am concerned about Yohn,\" Master Larks pointed out. \"Whilst his peers are progressing with magic, he has not been able to take a step down the path. I fear he will feel left out and harbour resentment.\"</p>\n<p>\"Jean has been researching methods to supplement his loss of vision,\" Markus reasoned. \"However, progress has been slow - non-existent, in fact! If his cultivation were just a bit higher, he could rely on his mana senses, but without the ability to cast a spell or cultivate, I do not think that is an option.\"</p>\n<p>\"I propose that we prioritise this matter,\" Master Larks declared. \"We cannot leave a child behind like this, especially when our sect is just starting.\"</p>\n<p>\"I will inform the others accordingly,\" Markus affirmed. As the discussion drew to a close, he stood up to leave.</p>\n<p>\"Oh, I almost forgot!\" Master Larks' voice called out just as Markus' hand touched the door handle. \"Since when do we have a Lowe's Hardware, Landscaping and Construction within our business portfolio?\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/8s06d0tbflsp5i55xor0ymo\">Chapter 317 - (Hostile) Takeover</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/63zasb2xzmxm8ksxr258ndi\">Chapter 315 - Familiar Territory</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}