{"pageProps":{"note":{"id":"5y3ady3hspeewor90o7dokg","title":"Chapter 290 - Round Two","desc":"","updated":1678269707106,"created":1675791043845,"custom":{},"fname":"volume-4.chapter-290","type":"note","vault":{"fsPath":"vault"},"contentHash":"0e505b3e43b40a9a8c88d39c8fbdb957","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-290","id":"5y3ady3hspeewor90o7dokg","vaultName":"vault"},"value":"volume-4.chapter-291","position":{"start":{"line":53,"column":3,"offset":11066},"end":{"line":53,"column":27,"offset":11090},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-291"}},{"from":{"fname":"volume-4.chapter-289","id":"ixrqv93p3op4dt3e8quknsy","vaultName":"vault"},"type":"backlink","position":{"start":{"line":147,"column":3,"offset":9779},"end":{"line":147,"column":27,"offset":9803},"indent":[]},"value":"volume-4.chapter-290"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-290---round-two\">Chapter 290 - Round Two<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-290---round-two\"></a></h1>\n<p>Josie knew immediately that the man before her was the same vermin she fought earlier in the quarantine. The stench exuded by his mana matched that creature's down to a 'T''. Josie knew that it wasn't the last she'd seen of that vermin. Except, she didn't expect their next encounter to be so soon, and that too with herself at such a massive disadvantage. In their last encounter, the creature was at the peak of the Foundation Establishment realm - merely a centimetre away from stepping into Core Formation. With a beast's inherent advantages covering for the gap in cultivation, the fight was only incrementally in Josie's favour. However, the creature had somehow broken through. Even after losing so much, it advanced into the Core Formation realm.</p>\n<p>With this change, the creature-turned-man completely outclassed Josie. This became immediately evident when the creature followed up its charge with a wide swipe of its left hand. Josie intended to block the attack, but she quickly realised that the force was well beyond her limit even after reinforcing her body with mana. This was the gulf between a mage and a beast within the same cultivation realm! In response, Josie let herself get pushed back by the attack and caught herself as she careened away.</p>\n<p>\"What exactly are you?\" Josie said gritting her teeth.</p>\n<p>The man tilted his head, with a crazed and confused expression on his face. His clothes were ragged and torn - there were weapon marks as well as tears caused by a human pulling on them. Josie matched his face with that of the man who she amputated a few days back. He was also wearing the same armour, except it had degraded significantly through battle and environmental damage. His hair was messier and tangled, singed in some places too. He revealed his blood-soaked teeth with an agitated smile and then used his tongue to lick the blood leaking out from the side of his lips.</p>\n<p>He got down on all fours and covered the gap within a fraction of a second. The speed was faster than Josie could track. The ground quite literally caved in where he used to stand due to the immense force exerted by his legs. The following attack turned into a grapple, as he tried to overpower Josie into the ground. As a ranged attacker, Josie had to separate herself. She tried dodging and weaving around natural obstacles, but the man waved his hands with a maddened fervour, obliterating the trees and rock in his path.</p>\n<p>Left without an option, Josie quickly conjured up a gust of air and used it to accelerate mid-dodge to confuse the man. Evidently, it worked. Josie capitalised on the sudden decrease in immediate pressure and started to fire off wind-based attacks with impunity. This time, she did not hold back, she did not have the luxury of holding back.</p>\n<p>As if mocking her, the man crossed his fists and weathered the attacks unflinchingly. Josie caught the sudden increase in projected mana in front of his crossed fists that was blocking the attacks from coming his way - possibly a standard ward, although the output was greatly inefficient. But it seemed like the man could afford it!</p>\n<p>Josie bit down on her lips and continued to fire her attacks. There were |Wind Blades|, |Pressure Balls| and |Howling Fists| thrown in his path, which he seamlessly side-stepped or weathered. Yet he did not let off applying pressure on her. One fortunate find was that the man hadn't grown completely accustomed to his body just yet. This was a common problem known to affect beasts entering the Core Formation realm after they reforged their bodies, especially if the beast decides to reforge itself to adorn a form that is in stark contrast from his original biological state. The sudden lack of or addition of appendages, the shrunken or enlarged form, and the shift in natural sensors all have a compounding effect. The man in particular was finding it hard to estimate the reach of his arms. He opted for wide and telegraphed movements, which was the only reason Josie could survive so far.</p>\n<p>When two magical beings fight against each other, they are actually entering a war on two fronts. There is the physical fight, which involves melee and weaponised combat and draws on the duelists' internal mana, and there is the arcane fight which involves the recruitment of ambient mana within the combatants' mana domains. A mage cannot use ambient mana personally, but they can rely on it to sustain their spells when range is involved. Losing both fights is a guaranteed loss, and winning both of them is impossible when a fight is between mages of matching realms. One has to weigh the importance of both in any combat scenario. A ranged magic user would prefer to prioritise their control over the overlapping domain, but if they let go of their presence in the physical realm by loosening the reinforcement of their defences, they risk dying to a rogue melee attack. The same can be said for a physical combatant who ignores the overlapping domain, as they risk being affected by spells acting directly in their personal space.</p>\n<p>The man before her was originally a beast. Beasts that have advanced cultivations have a natural disposition and instinctual control over mana - it is just like eating or breathing. Therefore, his power over his domain, whose diameter exceeded Josie's even though he only just advanced, was staggering. Josie was fighting an uphill battle on that front, as she tried to wrest control over a measly amount in her immediate vicinity. Her ranged spells were being predicted, and most lost juice within seconds of leaving her controlled domain. The physical fight was no better either. While the man lacked grace and technique, he had unparalleled adaptability. An attack that fell twice did not succeed on the third attempt.</p>\n<p>Josie clicked her tongue with irritation. \"As expected from a being born a rat and turned human, two of the most adaptable creatures in the world!\"</p>\n<p>The forested area had grown barren and wrecked under the unforgiving and haphazard assault of the beast-turned-man. He cared little for what went around him and moved with a singular purpose - to kill Josie. Unfortunately, Josie could not contain the man thus risking possible danger befalling her Young Miss and the little ones, as they tried and failed to escape from the \"hot zone\".</p>\n<p>The defeat was assured for Josie, and worse yet it would lead to the death of her Young Miss. That was an even more unpardonable crime! This was unless she took extreme measures.</p>\n<p>Josie decided to capitalise on the man's most obvious weakness - his arms! Although he used his 'weapons' haphazardly, they carried immense power. Nothing was more dangerous than a neophyte handling a weapon beyond their capacity. Knowing that they're contending against newbies causes the opponent to lower their guard, only to get caught by the weapon at an off angle and lose their lives in the process. Josie chose to remove the wildcard!</p>\n<p>In a strange twist, she narrowed the gap she so ardently tried to maintain. The sudden reversal caused the man to hesitate, only momentarily though. But that fraction of a second was enough for Josie to stab his overextended right arm with a dart. The dart was tipped with Dimiretium, an extremely rare metal alloy of Dinarius, Mithril and Auretium. The three metals comprising it are highly magically reactive. Dinarius is sometimes used as an accelerant for ritual formations by mixing it in with chalk dust. Auretium is used in jewellery to create lustrous and light accessories that are also conducive towards enchantments. Mithril is used in all enchantment inscriptions. However, in the 2:2:6 (by weight) mixture of those three metals, one creates one of the most aggressive magic neutralisers. It is naturally inhibitive towards mana circulation. The cause for this behaviour is highly debated, and one that Josie deems unnecessary to explore. Since all that mattered was its application, which was to pierce magic in all its forms.</p>\n<p>Unfortunately, Dimiretium is highly brittle and cannot be fashioned into weapons. But, a needle was within its physical limits. The hollow needle pierced through the man's passive mana reinforcement and dipped into his flesh. Then, immediately after, the solvent stored within the dart injected itself into the muscle. As the man reeled back, Josie quickly followed it up with another dart, this time to the left hand.</p>\n<p>Josie turned tail and ran without hesitation. It was weird to show one's back while in combat, but this was a strategic retreat as within seconds a loud explosion sounded behind her. Josie looked over her shoulder and saw the man with the right side of his torso charred and wrecked beyond recognition. His right arm was missing, and so was his shoulder and a good chunk of his right chest. The flesh on the right side of his face was ripped, revealing parts of his skull and the entirety of his right teeth. The man moved decisively and swung his left arm upwards. It dislodged like a doll part and flew towards the sky before another massive explosion resounded from above.</p>\n<p>\"Fucking rats!\" Josie cursed. If the second explosion struck true, the fight would have been assuredly in her court. Nonetheless, she could rest assured that there was some advantage here. The man was without arms and thoroughly damaged on one side.</p>\n<p>\"PLAYED. ALL. CARD! SEE. MINE!\"</p>\n<p>At times, Josie wondered if there really was a being up above everyone's reach manipulating things on a whim. Large organised religion never really took hold on Gaea, what with the power of gods being accessible to those with time, resources or an excess of luck. Some cults followed a charismatic leader, but even those rarely survived the passing of the spearhead. Nonetheless, by either sheer bad luck or the machinations of an unknown deity above, Josie's momentary respite was shattered as the man exuded an animalistic growl. Then, from the stumps to his side, noxious gas started to ooze out with a consistency nearing that of a liquid. It condensed and resembled arms - not human but faintly ratlike. But the man didn't stop there. All around him, his mana started to turn a murky black shade. All life in his immediate vicinity wilted, and the ground itself grew desiccated. This...</p>\n<p>\"The Plague-\" Josie did not finish that sentence. She could not finish that sentence because he burst forward with even more speed and vigour. The gaseous arms rushed uninterrupted directly towards her chest. Josie could feel that the force behind them was lesser, so she opted to parry the attacks with a side swipe. It was a success, but the momentary contact she had with the gas wrecked her attire and started to attack the mana protecting her body.</p>\n<p>And while she frantically cleansed that contamination, a third attack winded her and whipped her back like a ragdoll.</p>\n<p>From behind him, under his armour, an arm extended outward, holding another arm, holding another arm, holding another arm, and finally another arm.</p>\n<p>The creature-turned-man had fashioned himself a tail. One made entirely out of arms.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/hi341oyun57mzz3hdwwxk63\">Chapter 291 - Second Wind</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/ixrqv93p3op4dt3e8quknsy\">Chapter 289 - Intercepted</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}