{"pageProps":{"note":{"id":"63fiIjUJFKSOR7GZqzAAF","title":"Chapter 073 - Paradigm Shift","desc":"","updated":1643626604929,"created":1643569484041,"custom":{},"fname":"volume-1.chapter-073","type":"note","vault":{"fsPath":"vault"},"contentHash":"f85dc9f883cde9850756a3ecafb9feaf","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-073","id":"63fiIjUJFKSOR7GZqzAAF","vaultName":"vault"},"value":"volume-1.chapter-074","position":{"start":{"line":119,"column":3,"offset":10980},"end":{"line":119,"column":27,"offset":11004},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-074"}},{"from":{"fname":"volume-1.chapter-072","id":"TwOHEYKq4tVIxYkho5gXR","vaultName":"vault"},"type":"backlink","position":{"start":{"line":115,"column":3,"offset":8698},"end":{"line":115,"column":27,"offset":8722},"indent":[]},"value":"volume-1.chapter-073"}],"anchors":{"^2":{"type":"block","value":"2","line":104,"column":9}},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-073---paradigm-shift\">Chapter 073 - Paradigm Shift<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-073---paradigm-shift\"></a></h1>\n<p>It was hard for Markus to come to terms with his loss at the Apprentice Tournament. He had persisted till the end, yet all it took was one spell to turn the tides. The experience was etched into Markus' heart like a troublesome scar. Not just the disappointment from the loss, but the pain that built up to the defeat.</p>\n<p>\"It felt like an immense force was bearing down on me. But the weird thing was that it was distributed, not concentrated. Each and every single fibre of my being was experiencing the pressure all at once!\" Markus recounted ponderously.</p>\n<ul>\n<li>\"It was the strongest spell I have ever seen or experienced...\"</li>\n</ul>\n<p>Guy nodded morosely and commented, \"I'm sorry that you had to go through that. I cannot imagine how much pain you were under.\"</p>\n<p>Markus immediately shook his head and added, \"No, Master! You shouldn't apologise! It was my decision to participate. I could have very easily turned it down.\"</p>\n<p>He sighed and continued, \"As you've told me many times. That fight, and my loss, was an inevitability. While I cannot readily agree with that sentiment, I respect your perspective and understand the underlying implication of what you're trying to convey. However, accepting my loss does not negate it from history.\"</p>\n<p>\"I agree,\" Guy answered.</p>\n<p>\"With that in mind, I've been reevaluating the match in search of areas for improvement. If I were to confront my opponent once again, how can I achieve a victory?\" Markus declared.</p>\n<p>\"But, no matter what, I end up with the same conclusion: there is just no way! And that is BECAUSE of the spell Gaige cast at the end.\" As he finished the sentence, Markus' shoulders drooped in defeat.</p>\n<p>Taking the hint, Guy continued in Markus' place, \"So, you've been exploring different avenues to learn the spell?\"</p>\n<p>\"That was my initial intention. Through research, I was able to posit that the spell could have been in some ways connected to a special bloodline or physique. It could have also been a spell passed down within his clan. I also couldn't write off the possibility that it was taught to him through some fortuitous encounter, maybe by his teacher even - Teacher Way,\" Markus explained.</p>\n<p>\"Those routes were obviously dead-ends. Even if I knew the source of the spell, there wasn't anything I could do to obtain it. Which meant that I was only left with another option: to use my existing knowledge to create the spell.\"</p>\n<p>\"Understandable,\" Guy commented.</p>\n<p>\"I then started with a mind-map of what I knew already that could be connected to the spell, and details that were unknown and required additional digging,\" Markus said as he retrieved a wooden board hidden behind his dress cupboard. On it, he had etched an elaborate map detailing his different hypotheses and findings as well as his arguments and counter-arguments to various theories he'd learned along the way.</p>\n<p>\"Through some investigation, I was able to determine that the spell was categorised under the darkness element,\" Markus commented, to which Guy interjected with a question, \"How do you know that it was affiliated with the darkness element?\"</p>\n<p>\"Right! Soothsayer Nara told me. I wasn't able to find any publications, but he happened to have some experience dealing with spells categorised under the darkness element, and those details aligned with my experiences as well. So I deduced that they were the one and the same,\" Markus answered.</p>\n<p>'It's him again!' Guy noted down the occurrence of such a convenient coincidence in his mind. He would pursue this line of questioning at a later date.</p>\n<p>\"As I was saying, the name 'darkness' implied that the spell might have some connection with light, given how the absence of light is the definition of darkness. After some contemplation, it made sense to me. Moreover, given how light is also a form of energy, and since the effect of the spell could be categorised as non-contact, the conclusion seemed valid.\"</p>\n<p>\"However, this brought up the question, how can you qualitatively define the opposite of light, that is darkness, as an energy?\"</p>\n<p>Guy interrupted Markus with a question, \"What makes you think that the so-called 'darkness' element is the opposite of the 'light' element?\"</p>\n<p>Markus tilted his head and answered, \"Isn't it a logical conclusion? I mean, the opposite of the standard fire element is water. To counter lightning, you use earth. To counter water, lightning, and so on...\"</p>\n<p>\"That's the old way of thinking, isn't it? But we know for a fact that the world doesn't work that way,\" Guy clarified.</p>\n<p>Markus exhaled loudly and spoke with some irritation, \"I get that, I do. But the way you taught me hasn't led me to any worthwhile discoveries-\"</p>\n<p>\"Then, has the old method worked out? Looking at the state of your room, I would say that it hasn't,\" Guy interrupted.</p>\n<p>Markus stewed in silence with his head hung low. He curled his palm into a fist as a long-suppressed rage threatened to spill over. He wasn't angry at his Master. No, his grievance was solely directed towards himself. This was all he could amount to, and it pained him to accept that fact. Life was never fair, if it were then there would be no sorrow in this world. Even though he'd managed to catch up to his peers in the marathon called life, he could see that while others would persist till the end, he was doomed to drop off midway.</p>\n<p>\"Actually, the problem isn't that there is no way to define the element known as 'darkness' through scientific reasoning, it's that you aren't able to conceptualise the phenomenon given your current thought paradigm,\" Guy pointed out, interjecting Markus' detractive thoughts.</p>\n<p>\"Honestly, it isn't even your fault. The idea in and of itself is so hard to fathom that someone without the proper background or knowledge cannot conceptualise it organically,\" Guy elaborated.</p>\n<p>Facing Markus' confounded expression Guy wore a mysterious smile. \"Let's start from the first thing you said. 'It felt like an immense force was bearing down on me'. What can you derive from that statement?\"</p>\n<p>Markus nodded in contemplation and began voicing his thoughts, \"Force bearing down... are you implying that the spell had something to do with exerting a force?\"</p>\n<p>\"You then added, 'the weird thing was that it was distributed, not concentrated'. What does that tell you?\"</p>\n<p>\"Distributed force... But I know that it was contactless... So it was a field of some sort?\" Markus asked.</p>\n<p>\"Let's bring it all together,\" Guy instructed.</p>\n<p>\"A force field. Since it wasn't specifically targetting metallic objects, nor was it acting on charges, I can rule out both magnetic and electric fields. So the only thing that remains is gravity?\"</p>\n<p>Guy nodded with a beaming smile, \"Bingo!\"</p>\n<p>\"But that doesn't make any sense! I've already entertained that theory before, but it yielded nothing. For instance, how can gravity interface with light?\" Markus challenged</p>\n<p>\"And that's where the problem starts. Your thought paradigm is limited by what you know. But consider the following case: A supermassive star is nearing the end of its life. At its demise, it undergoes an enormous explosion of cosmic proportion, propelling plasma and matter into space haphazardly. But what of the mass that remains? The star was so massive during its main sequence that the remaining mass is far denser than what could have been imagined. Without thermonuclear pressure to oppose the rapidly increasing gravitational forces, the mass collapses in on itself. It compresses so much that it literally bores into the fabric of space-time, creating a region where the gravity is so strong, that nothing can escape it.\"</p>\n<p>As Guy finished and cleared his throat to diminish the after-effects of using his teaching voice, he was met with Markus' awestruck gaze.</p>\n<p>\"What is this thing called, Master?\"</p>\n<p>\"A black hole!\" Guy answered matter of factly, to which Markus narrowed his eyes.</p>\n<p>\"That's a very straightforward name...\" He muttered. But then he quickly shook his head and continued, \"But I still don't understand, Master. How can gravity, something that is known to act on masses, affect light which is a form of energy?\"</p>\n<p>Guy sighed as he answered, \"That's because light has a dual nature. It is a form of energy AND has a material form, known as a photon.\"</p>\n<p>\"What? How does that even work?!\" Markus exclaimed in disbelief.</p>\n<p>\"If you can suspend your scepticism just a little bit and entertain the thought that light can exhibit material properties, then we can actually derive a simple formula to describe a theoretical radius a cosmic body needs to have, given its mass, so that it can be defined as a black hole.\" Guy enthusiastically picked up a handy chalkboard in Markus' room and began writing on it.</p>\n<p>\"Let us start by equating kinetic energy of a mass and kinetic energy due to gravity:\"</p>\n<p>1/2 mv^2 = GMm/r</p>\n<p>\"Let us evaluate kinetic energy of a mass on the left-hand side as applying to light, which through its duality can be defined as photon particles. We use 'c' to define the speed of light, and since a photon is essentially massless we can cancel out 'm' on both sides:\"</p>\n<p>1/2 c^2 = GM/r</p>\n<p>\"Rearranging this formula yields:\"</p>\n<p><a aria-hidden=\"true\" class=\"block-anchor anchor-heading icon-link\" id=\"^2\" href=\"#^2\"></a>r = 2GM/c</p>\n<p>\"As you can see. Given a cosmic body with mass M, in order for it to classify as a black hole, it needs to have a radius defined by this formula. This is called the Schwarzschild radius of a black hole. And as seen here, it is defined by the fact that a black hole is able to capture light! Isn't this fascinating?\"</p>\n<p>Markus nodded, then shook his head, \"I understand what you're trying to explain here, but I can't get my head around this idea...\"</p>\n<p>Guy grimaced and replied, \"To truly grasp the implications of this theory, you either need to be inducted into the field of general relativity or need to see a black hole. I think you should have experienced something similar to it, albeit only an infinitesimal fraction of a true black hole, through Gaige's ultimate spell.\"</p>\n<p>And with that, the duo entered a state of complete silence.</p>\n<p>Markus was totally stumped by everything his Master revealed to him in the past few minutes. While he trusted his Master wholeheartedly and believed everything he had taught him, this was the first time Markus was unable to internalise and assimilate his Master's teachings. It wasn't that he thought his Master was lying to him, just that the entire concept sounded so ludicrous his mind just wasn't willing to accept it.</p>\n<p>Maybe Guy understood these sentiments in Markus' blank gaze, because he followed up with a thoughtful revelation, \"The scientific process is full of such paradigm shifts. Sometimes, you end up in a dead-end where the only way to get out is by looking at the problem from a different, sometimes revolutionary perspective. The many truths of this world are seldom straightforward.\"</p>\n<p>Yet this still could not alleviate Markus' current struggle. Right as Guy was about to call it a day and urge Markus to take some time to absorb what he had learned, an unconventional thought struck him.</p>\n<p>'Truth of the world... Maybe...'</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/smGG2GnLM6dQNGA2MwFaY\">Chapter 074 - I See Dead Stars</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/TwOHEYKq4tVIxYkho5gXR\">Chapter 072 - Do Not Try This at Home</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}