{"pageProps":{"note":{"id":"63zasb2xzmxm8ksxr258ndi","title":"Chapter 315 - Familiar Territory","desc":"","updated":1684738029177,"created":1681385631355,"custom":{},"fname":"volume-5.chapter-315","type":"note","vault":{"fsPath":"vault"},"contentHash":"7a11d9b775525418dc9e7ea69a995149","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-315","id":"63zasb2xzmxm8ksxr258ndi","vaultName":"vault"},"value":"volume-5.chapter-316","position":{"start":{"line":87,"column":3,"offset":11366},"end":{"line":87,"column":27,"offset":11390},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-316"}},{"from":{"fname":"volume-5.chapter-314","id":"mdboxb4oaw81y3w9dsu5dkj","vaultName":"vault"},"type":"backlink","position":{"start":{"line":105,"column":3,"offset":10104},"end":{"line":105,"column":27,"offset":10128},"indent":[]},"value":"volume-5.chapter-315"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-315---familiar-territory\">Chapter 315 - Familiar Territory<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-315---familiar-territory\"></a></h1>\n<p>It didn't take much convincing for Markus to agree to Shuri's second term and request. In the grand scheme of things, it wasn't costly as compared to the first one that called for setting up a slime and wisp farm. A large-scale landscaping operation would be required as the meadow entrance to the underground cavern where Fancy lived was off-limits. But the investment was worth it, and a rough financial analysis indicated that they could turn a profit within three and a half years with just Shuri harvesting the mana cores.</p>\n<p>In the end, this was Shuri's initiative and the responsibility fell on her to come up with a plan for the entire operation. She would then have to take this plan for approval from the Sect and things would move forward thusly. This itself was a heavy workload, but thankfully as Marie promised, the transition into the Innovator Track greatly reduced her responsibilities in the research assistantship - she was now back to a single stack.</p>\n<p>Shuri wasn't sure if she should be grateful for the reversion, as she kept getting this feeling that she was somehow tricked into her current position by some highly tactful manoeuvring on Marie's part. Ultimately, it was only an itchy feeling at the back of her mind telling her that she had somehow walked into a trap. But, Shuri was too far gone that turning back was no longer an option.</p>\n<p>Coming up with a feasible landscaping plan was tough. Shuri didn't know where to begin. After multiple field inspection trips, which mostly involved moving in large circles and pulsing her mana sense under her feet, she managed to narrow down a suitable location where the digging could begin to tap into the cavern underneath the mountain. Compared to the opening in the hidden meadow, this one would require some heavy-duty work that would move a lot of earth around. It wasn't something that mortal labourers could achieve within the time limit she set for herself.</p>\n<p>So, Shuri made a tricky decision and started to recruit help from her peers. Luckily they were only kids with little training in political social engineering such as herself. A few trades here and promises to tutor them there later, Shuri had a veritable horde of magically capable labourers.</p>\n<p>Shuri furnished her workers with a modified |Earth Shift| spell that could compound when a target is hit by multiple casters at the same time. She created this spell with the help of the Modular Spellmaking Guide and Spell Circle Compartmentalisation Paper from the advanced course material. She had to admit that the Sect's approach towards spell-casting was incredibly intuitive and efficient. She never thought that it was possible to break down the arcane magical concepts that were steeped in subjectivity down to a science.</p>\n<p>After the project was approved, Shuri worked as the foreman and guided the teens in moving the earth and rocks to form a narrow and spiralling passageway underground to the approximate depth of the cavern. From that point, they built a tunnel that moved in the meadow's general direction. While this sounded simple on paper, it was far from it. Shuri learned, both through experience and subsequent heavy reading, that cave-ins and tunnel collapses were a thing if there was no support structure in place. Luckily the first collapse didn't hurt anyone, or else she would have to submit another hefty accident report and await further evaluation and worse yet, attract the Sect Leader's attention.</p>\n<p>But a single mistake was enough for Shuri to learn. And from that point onwards, she decided to take a less hurried path and approached Markus for some advice.</p>\n<p>\"When you started to get all the sect members involved in your project, while I was happy that you were finally socialising, I was worried that you would end up hurting people in your zeal,\" Markus said with a relieved sigh. \"While it is good to be confident in oneself, it is often superior to accept one's shortcomings and ask for help especially if failure leads to catastrophe.\"</p>\n<p>Shuri bit her lips to cover her irritation. \"You were aware that I would fail, and yet you approved the landscaping plan?\"</p>\n<p>Markus nodded with a distressed smile, \"I wanted to try something out.\"</p>\n<p>\"Are you kidding? People would have got hurt!\" Shuri exclaimed with an enraged growl.</p>\n<p>\"No, they wouldn't have. I confirmed it with Marie,\" Markus responded immediately while patting the air in a calming gesture. \"You see, one of my concerns since you joined our Sect is how little you've gone out of your way to ask for help from others.\"</p>\n<p>\"Why does that matter?\" Shuri argued.</p>\n<p>\"It matters a lot. A person capable of asking for assistance is humble and knows the limits of their abilities. These are the people who will live the longest as they know when to advance and when to retreat. You barely ever asked for help from others, so I wanted to see if it was because of overflowing self-confidence or because you hadn't faced a challenge where you fell short... Or if it was because you didn't trust us to have your best interest in mind. But now that you're here asking for assistance, I can rest assured that my worries were unfounded,\" Markus concluded with a smile.</p>\n<p>Shuri couldn't stop her eyes from twitching at Markus' explanation. Here she was, trying to quell her existence in the eyes of the Sect by not disturbing others and asking for assistance. And yet her actions inadvertently had the opposite effect. The fact that she was probably the only one not seeking assistance from others made her stick out like a sore thumb!</p>\n<p>\"Well... what's the verdict?\" Shuri said, trying to divert the conversation.</p>\n<p>\"I already mailed and requisitioned Lowe's Builders and Landscapers a few days back. You should hear back from them very soon. For the record, I can make this decision as a representative of the Verum Trading Company as we are one of the board members and major investors of your proposal,\" Markus pointed out.</p>\n<p>Although it irked Shuri for someone else to make the business decisions for her, \"Is this going to be a regular thing? For the board members and investors to bypass me and make overarching business decisions like this?\"</p>\n<p>\"Only if the current trajectory has a possibility to result in catastrophic consequences for the business,\" Markus answered with a raised index finger. \"It is ultimately up to you whether you want to move forward by contracting them or not. But if you cannot justify your decision, it will call into question your capacity to lead a business, in which case we will personally step forward.\"</p>\n<p>Shuri was sceptical about that statement. What determined if the consequence would be catastrophic? What parameters were being used to judge this? Obviously, this was just Markus flexing his power over Shuri and showing that she was only the CEO of her company in everything but name. With a casual flick of his writing utensil, he had rendered her last few days' worths of work redundant.</p>\n<p>\"Please don't be discouraged,\" Markus emphasised with a \"sincere\" frown. \"I only called Lowe's to put them in contact with you. In the end, it will still be you managing the entire landscaping process and everything that comes after. I only did what you intended to ask of me but earlier.\"</p>\n<p>At the end of the sentence, his brows quirked up and an awkward smile showed on his mien. He then muttered in a low voice, \"Did I just turn into Marie back there?\"</p>\n<p>Shuri could only nod at that and make her exit.</p>\n<hr>\n<p>True to Markus' words, the construction and landscaping company arrived within two days. The owner was the first to enter the Sect ground and beelined for the Administrative Building.</p>\n<p>The man, Lobert Lowe, was short and stout and walked with an uncharacteristic swiftness. He represented your average mortal yuppie merchant who just got into a contract with a Sect with the hopes of some benefits in his generation, or the next, or the next, and so on. He spoke with a fawning intonation and walked with a slight hunch while in front of the Sect's members. However, in the presence of his subordinates, he walked with such a straight back and puffed and raised chest that his hefty belly nearly disappeared into his abdomen. He was your typical \"worship the powerful and bully the weak\" kind of guy. This was supported by the uncomfortable Markus wore the entire time the man talked and waxed poetry over the Sect, its Leader and its members.</p>\n<p>\"Anyways,\" Markus raised his palm to cut short the man's endless words of meaningless praise. \"Shuri here will be the one that will be handling everything. So please continue the discussion with her.\"</p>\n<p>Markus could not wait to extricate himself from the company of this man, which was perfectly fine with Shuri. As he left, though, he shot Shuri an apologetic gaze probably feeling guilty over leaving her in such unpleasant company.</p>\n<p>On the contrary, Shuri was overjoyed as she was now reentering familiar territory. Lobert was predictable. He was one of the kinds of people that surrounded her throughout her life. The True World Sect could only be described as an anomaly.</p>\n<p>A sense of euphoria started to bubble from within Shuri as the man's slimy smile turned her way. Why was she feeling so excited? It was the same feeling a serial killer would have when they were suddenly placed in a hidden alley with a helpless victim crouched and feeding cats in front of them, and with their backs turned the killer's way.</p>\n<p>Shuri was starved. Her failure upon failure to properly gauge the social dynamics within the Sect grated her mentally. Now that she was facing a predictable opponent, he was feeling the same sense of relief a fish would feel when dropped back into the water after a long while of deprivation.</p>\n<p>\"Miss Shuri! The name of the star that guides lost travellers! What a perfect name for the one leading the project,\" the man started. Unwittingly, this sent a shiver of elation through Shuri's spine. She had to swallow a mouthful of saliva before opening her mouth and speaking.</p>\n<p>\"Umm... Honestly, I have no idea what to do,\" Shuri said with a distressed tone and a droplet of tear rolling out the corner of her eyes. \"Please, uncle!\" She exclaimed while grabbing the hefty man's right hand with both her hands.</p>\n<p>\"Please help me! If this goes wrong then my position in the Sect...\" A flash of abject fear flashed across Shuri's face. \"I made a huge gambit! If this goes well then I will get promoted into the upper echelons of this Sect, otherwise, I'll- I'll-\"</p>\n<p>The man's face cycled through a myriad of expressions. It was confusion that quickly warped into a neutral yet faintly devious expression that a predator would wear when prey was within view. \"Don't worry child!\" He said while patting Shuri's hand gently. \"This uncle will make sure nothing goes wrong.\"</p>\n<p>Shuri revealed an overjoyed yet innocent smile, hiding a devious grin that would have dwarfed the crafty businessman's.</p>\n<p>\"Although...\" the man continued. \"This uncle will need some help in return...\"</p>\n<p>\"Anything!\" Shuri shot back with no hesitation. \"I'll do anything as long as it is within my power!\"</p>\n<p>\"Perfect.\" A sly glint glittered in Lobert's eyes. He was probably already envisioning his family rising up and dominating the market with his children as mages and so on.</p>\n<p>Shuri dangled the bait. The fat fish was already circling it. Getting caught was just an eventuality.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/5rn1vdafy3i4u000jnxnaof\">Chapter 316 - My \"New\" Master</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/mdboxb4oaw81y3w9dsu5dkj\">Chapter 314 - \"...and for that reason, I'm in!\"</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}