{"pageProps":{"note":{"id":"7m3h2ywgsl1h1h51q4rigra","title":"Chapter 281 - Lose an Arm to Save the Body","desc":"","updated":1675847115280,"created":1673974822141,"custom":{},"fname":"volume-4.chapter-281","type":"note","vault":{"fsPath":"vault"},"contentHash":"e64fc1caec88c08a3e016f61b8d9ca15","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-281","id":"7m3h2ywgsl1h1h51q4rigra","vaultName":"vault"},"value":"tags.She","alias":"#She","position":{"start":{"line":32,"column":1,"offset":1731},"end":{"line":32,"column":5,"offset":1735},"indent":[]},"xvault":false,"to":{"fname":"tags.She"}},{"type":"wiki","from":{"fname":"volume-4.chapter-281","id":"7m3h2ywgsl1h1h51q4rigra","vaultName":"vault"},"value":"volume-4.chapter-282","position":{"start":{"line":133,"column":3,"offset":10173},"end":{"line":133,"column":27,"offset":10197},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-282"}},{"from":{"fname":"volume-4.chapter-280","id":"t0q1a5gxhv98zvi3hmx2y7s","vaultName":"vault"},"type":"backlink","position":{"start":{"line":83,"column":3,"offset":11608},"end":{"line":83,"column":27,"offset":11632},"indent":[]},"value":"volume-4.chapter-281"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-281---lose-an-arm-to-save-the-body\">Chapter 281 - Lose an Arm to Save the Body<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-281---lose-an-arm-to-save-the-body\"></a></h1>\n<p>Hearing no response, Jean started to inch closer towards the source of the hushed sounds, while keeping her mana senses extended to their limits. The sphere of mana spread outwards and immediately intercepted two figures hiding under the floorboards of the house. Jean furrowed her brows and shoved her hand into the wood and pulled it out.</p>\n<p>A shriek overlaid on top of a deathly cough resounded, as the forms of a dishevelled girl hunched defensively over her laying mother came into view. It would have been a welcome sight, if not for the fact that the mother was covered completely in black blisters of which a few had already ruptured and gotten onto the skin and face of the girl. Jean immediately bent over and yanked the girl away from her mother.</p>\n<p>\"NO!\" The girl yelled. \"Let me go!\"</p>\n<p>\"You will die!\" Jean shot back.</p>\n<p><em>What does this remind you of?</em></p>\n<p>'Not. Now.'</p>\n<p>\"Let me go! Mom!\" The little girl yelled frantically as she tried to claw herself away from Jean's grasp.</p>\n<p>\"You will be in danger! Please, listen to me,\" Jean implored.</p>\n<p>\"NO! LET ME GO!\" The girl cried. \"MOM!\"</p>\n<p>The woman, who was visibly dehydrated and deathly pale, released a pained cough, \"Kili...\"</p>\n<p>\"MOM! I'm here- MOM!\"</p>\n<p>\"Don't... come...\" the woman groaned through heavy breath. The girl went limp in Jean's hand and started to whimper sorrowfully. The woman turned her head slightly and looked at Jean through glazed-over eyes.</p>\n<p>\"Protect... her...\" Those were the woman's final words before her breath seized and her heart stopped.</p>\n<p>\"Mom?\" The girl yelped. Jean immediately pressed her fingers against the side of the girl's neck and overloaded the motor nerve bundles altogether, knocking her out.</p>\n<p><em>You let another mother die!</em> The voice taunted.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#She (Private)</a> was already on her last leg by the time we arrived. There was nothing you could do-#</p>\n<p><em>Excuses!</em></p>\n<p>Jean retreated and pressed her back against the wall, and covered her face with her palms. Her breath started to grow frantic. In her mind, the image of the deceased woman started to overlap with her mother.</p>\n<p><em>You killed me!</em></p>\n<p><em>MURDERER!</em></p>\n<p><em>MURDERER! MURDERER! MURDERER! KILL YOURSELF! KILL YOURSELF! KILL-</em></p>\n<p>\"Young Miss!\" Josie's voice cut through the malicious din polluting her thoughts.</p>\n<p>\"Josie? Y-You're here! W-What happened?\" Jean shot back successively.</p>\n<p>\"Well-\"</p>\n<hr>\n<p>Every animal learns through reinforcement. When an action begets a positive reaction, it is something to be repeated. When an action begets a negative reaction, it is something to be avoided. This is the basic equation that governs every sentient creature's life. But as these creatures gain intelligence and self-determination, they learn to find the benefits that can be gained from an action that begets a negative reaction and vice versa. It is the process of evaluating opportunity costs.</p>\n<p>To cultivate this ability, one must either take the least favourable step voluntarily, on must face a loss so serious that they are forced to take that step.</p>\n<p>The Rat King had hit a bottleneck. He'd learned that the more he exuded the heat accumulating near his core, the stronger he became. He'd learned that the more he assimilated, the stronger he became. Following these base instincts helped him become more powerful. All the pests living in his territory started to submit to his prowess and perished, while his own empire grew uninhibited.</p>\n<p>After he realised his potential, the Rat King never had to approach the pests in his garden personally. His subjects could spread his presence, culling the locals, and then he could swoop in and clean up after. It was a streamlined process.</p>\n<p>It was just another day, cleaning up after his subjects. The Rat King had truly succumbed to acedia, letting himself assimilate with his kind and grow into a form that suited his process. He had highly elastic appendages made of his kin that he had subsumed. All he had to do was let those appendages reap his harvest and move on to the next location. Recently, the 'crops' in his kingdom were growing scarcer, he anticipated expanding outwards. But his subjects brought word of stronger pests cordoning his borders. He was confident he could take them on, just like he did with those dastardly worms, but it couldn't be achieved immediately. He was close to advancement, he could feel it, but something was holding him back.</p>\n<p>Suddenly, the Rat King felt one of his appendages disappearing. The pain radiated through his body, amplifying as each of the subsumed minds comprising his body started to scream in pain. Then another one was lost, and then another-</p>\n<p>Who dares!</p>\n<p>For the first time in a long while, in rat years, the Rat King left his throne and burrowed through the ground in the direction of his lost appendages. The ground shook as he moved, and the burrows his kind had built groaned as they tried to accommodate his overgrown size.</p>\n<p>He released a majestic roar as he let his form breach into the sunlight, and prepared to face the pest that caused him so much pain.</p>\n<p>'This one looks like them? How did she hurt me so?' It was a question bordering between rage, fear and curiosity. In his experience, the smooth-skinned pests with fur growing solely on their heads were weak. They were the quickest to succumb to his presence. Yet this one hadn't... strange... But it was also a cause for concern. But for the Rat King, who was filled with arrogance after coasting through his long life, in rat years, this was just a slightly stronger pest that needed his direct attention.</p>\n<p>And so he burst into action, his appendages flailed in a maddened rage and his jaws spread open invitingly.</p>\n<p>However, the confrontation did not go the way he expected. The pest was standing its ground annoyingly well. With his new form, the Rat King had the advantage of sight and flexibility so by his estimates the victory should have been quick. But the fight just kept going on and on, and he was starting to take more and more damage as it progressed, while the pest remained relatively unharmed.</p>\n<p>Then suddenly, the pest exuded even greater pressure. His instincts screamed out warning signs, and he knew that the fight would quickly become unfavourable. And it did. One by one, the pest started to slice away at his limbs. He tried to regrow them by assimilating more of his brethren, but he recognised that this was not sustainable in the long run - the pest did not show any signs of slowing its attacks at all!</p>\n<p>The pest's attacks grew even more fearsome, and the Rat King found himself getting pushed further and further towards his demise. That was it!</p>\n<p>He decided he'd had enough.</p>\n<p>He started to circulate his mana and tap into the heat in his core. The pest had made a huge mistake, and it ought to be taught a valuable lesson!</p>\n<p>He endured the damage the pest inflicted on him as he prepared for the finale.</p>\n<p>His body expanded and, a second later, discharged a magnificent wave of black gas.</p>\n<p>He saw on as the pest drowned in the dark flurry, and awaited its inevitable demise. He would relish its measly offering of flesh!</p>\n<p>But the world played a cruel trick on him. It came out the other side, unscathed and unaffected.</p>\n<p>The pest uttered a few words the Rat King did not understand, but its aura grew more ferocious.</p>\n<p>He had lost.</p>\n<p>Miserably.</p>\n<p>It was at this moment, that the Rat King considered a choice he'd written off ages back, in rat years. All that rats cared about was survival. There was no pride, no territorialism, just survival by any means necessary. If surviving meant that one had to sacrifice a limb or tail, a rat would do it readily. This was written into the instincts of his kind and was something he'd suppressed in trying to grow stronger. But as he came face to face with death, all of his assumed instincts dissipated. It was either fight or flight, and he was all out of fight.</p>\n<p>In a decisive move, the Rat King sacrificed his kingly form - that was falling apart after the pest's vicious attacks - and receded into one of the forms of his brethren. He sacrificed a large chunk of power he'd accumulated to distract the pest, just as those worms with legs dropped their tails at the sign of danger.</p>\n<p>From his peripheral vision, he observed the pest summon a massive ball of whirling wind. Right as the pest tossed the ball towards his shedding shell, he leapt and receded into the hole he'd used earlier to arrive at this location.</p>\n<hr>\n<p>\"This slave killed it,\" Josie responded. \"It was responsible for the illness- for everything.\"</p>\n<p>\"I realised after seeing it release that cloud,\" Jean affirmed. \"What exactly was it?\"</p>\n<p>\"This slave does not know. I have not heard of or seen anything like this before. Research is necessary on this matter. Though it is evident through extrapolation that it used rats as the vector to spread the illness,\" Josie surmised.</p>\n<p>\"Should we report to the Balen Duchy about this?\" Jean asked with a faintly hopeful tone.</p>\n<p>\"This slave doesn't expect anything to come off of it. This decision to sequester the area was probably implemented in finality. They have officially given up on this region in hopes of salvaging it in a few years,\" Josie reminded. \"This slave believes that a viable cure is necessary to properly convince the Duchy to take any action.\"</p>\n<p>A sombre silence hung in the air after those words were said. It was a sad truth that Jean still wasn't ready to believe. Nonetheless, she was here to save the people, so a cure should only be an eventuality... hopefully.</p>\n<p>\"What are you planning to do now?\" Jean followed up, breaking the silence.</p>\n<p>\"Now that this slave knows the cause, she will continue to cull the rat population,\" Josie declared. \"And, I shall be on the lookout for the creature.\"</p>\n<p>\"I thought you said, you killed it,\" Jean blurted out.</p>\n<p>\"It built its body out of rats,\" Josie reminded. \"Therefore its mind must work like one. If I know rats and believe me when I say that you can find no other more intimate with those pests, that thing should have chopped its arm to save its body.\"</p>\n<p>\"Meaning...\"</p>\n<p>\"Meaning that this is probably not the last we will see of that creature,\" Josie muttered ominously. \"So this slave suggests that the Young Miss keep herself prepared.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/15yiaah20e77597p1nobfm3\">Chapter 282 - Managing an Epidemic</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/t0q1a5gxhv98zvi3hmx2y7s\">Chapter 280 - The Abomination</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}