{"pageProps":{"note":{"id":"7s7i7qlgcbd4iur6fil8llu","title":"Chapter 193 - An Apt Name","desc":"","updated":1656443736054,"created":1654412169862,"custom":{},"fname":"volume-3.chapter-193","type":"note","vault":{"fsPath":"vault"},"contentHash":"087a2d1a90ac28a5870f462b995952ce","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-193","id":"7s7i7qlgcbd4iur6fil8llu","vaultName":"vault"},"value":"volume-3.chapter-194","position":{"start":{"line":131,"column":3,"offset":10503},"end":{"line":131,"column":27,"offset":10527},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-194"}},{"from":{"fname":"volume-3.chapter-192","id":"hx1nee4jkb2enw7rs5we1oq","vaultName":"vault"},"type":"backlink","position":{"start":{"line":97,"column":3,"offset":9748},"end":{"line":97,"column":27,"offset":9772},"indent":[]},"value":"volume-3.chapter-193"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-193---an-apt-name\">Chapter 193 - An Apt Name<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-193---an-apt-name\"></a></h1>\n<p>\"According to my Master, the name of a Sect matters a lot,\" Marie said offhandedly. \"Are you sure that you want us to do it?\"</p>\n<p>\"Ultimately, the Sect will service you folk,\" Guy shrugged. \"Who better to bestow it its name than those that will comprise it?\"</p>\n<p>Guy observed a complicated expression spawn across everyone's face. He could see that they were struggling with it. It was understandable. After all, he was putting them on the spot with this request. No one could turn on their creativity like a switch, on-demand unless they were Kano of course - that boy was a well of creativity that seemingly never ran dry. He could create seasons that didn't exist, sceneries that were beyond mythical, beasts that hadn't been envisioned before, and he could evoke emotions that couldn't be put into words. Guy was tempted to take Kano's input in this, but he figured that there were still a few more years left until the Sect became relevant to Kano. Who could predict if Kano would even be interested in joining the Sect at that time? This is considering that the Sect existed at that time. All in all, it wasn't fair to do so.</p>\n<p>\"Let's follow this strategy,\" Guy declared as he clapped his hands. \"We will spend ten minutes, brainstorming ideas. Each person will come up with one name, and why they chose it. They must present their honest opinions and profess their case. After that, the quorum will debate the name. Whether it is viable? Whether it needs to be changed? And so on. Sound reasonable?\"</p>\n<p>The group hummed and proceeded with the activity. Right as they started, Marie noticed that Guy wasn't doing anything, \"Aren't you participating as well, Sect Leader?\"</p>\n<p>\"I came up with a few names earlier. I didn't like them,\" Guy confessed while shaking his head.</p>\n<p>\"We could still debate on it,\" Marie offered.</p>\n<p>\"That's not necessary. I won't go with it even if you guys decide it. Those that contribute, have the right to veto their own works,\" Guy retorted smugly.</p>\n<p>With that, all three of Guy's students regressed into contemplation. Each of their approaches to this was different, and unique befitting their personalities.</p>\n<p>Marie was methodical. She promptly drew a table on a piece of paper and started to list out names off the top of her head followed by their pros and cons.</p>\n<p>Jean was measured in her approach. It looked like she debated her ideas internally to a thorough level before her writing utensil pressed itself against the paper.</p>\n<p>Markus, for better or worse, followed Guy's strategy of drawing a mind map and generating ideas based on key phrases and concepts. Although many sites and books promoted this method for brainstorming ideas, Guy admitted that it never really worked for him. All it did was complicate the matter further by amplifying the number of choices he had to filter between exponentially with each new branch. But this was all Guy's opinion, maybe it worked for others. Why else would organisation gurus push it so enthusiastically?</p>\n<p>Guy kept time mentally, and to his surprise, the trio finished their first set of ideas well ahead of the ten minutes he set earlier.</p>\n<p>\"Who's going first?\"</p>\n<p>\"Me,\" Marie volunteered. She walked up to the front of the class and prepared to speak when Guy quickly reminded her to jot down the name on the blackboard.</p>\n<p>\"The name I went for was 'Bright Horizons Sect'. I chose this name for two reasons. The first is to establish an optimistic impression of the Sect. People that join this Sect can expect appreciative growth in the future. Secondly, the name can also act as an auspicious marker, indicating that the Sect will experience great success.\"</p>\n<p>\"Good job, Marie,\" Guy commended. He was proud of Marie's enthusiasm and readiness to put herself out there.</p>\n<p>\"Now, the floor is open for your opinions. Please keep it civil and constructive,\" Guy said.</p>\n<p>\"I think it's a nice name,\" Jean opined. \"It presents a possible vision of the Sect, for both its members and itself.\"</p>\n<p>\"I also agree,\" Markus chimed in. \"But I also feel like the name is a bit open-ended and vague.\"</p>\n<p>\"Can you expand on that Markus?\" Guy volleyed.</p>\n<p>\"The name does not explore the present nature of the Sect. It professes what the Sect could be and achieve. But it does not portray what members can expect from the Sect in the present. I think we should try to include details along those lines as well,\" Markus expounded.</p>\n<p>Marie flashed her tongue as a cheeky challenge and returned to her seat.</p>\n<p>\"I-I will go next,\" Jean said while raising her hand.</p>\n<p>\"Along the veins of Senior Brother's reasoning, the name I came up with is 'Renewal Sect'. It alludes to how Sect Leader intends to redefine the function and purpose of a Sect while offering members a second chance and new opportunities. It also resonated with me since I was able to renew my quest towards becoming a healer and my passion for the subject.\"</p>\n<p>\"Good! Something personal, I like it,\" Guy commended. \"What about you guys?\"</p>\n<p>\"It's good,\" Marie nodded.</p>\n<p>\"Same here,\" Markus affirmed.</p>\n<p>\"That's it?\" Guy snorted. \"Okay...\" he shrugged seeing as no one was willing to provide additional criticisms. He figured that the two were being considerate of Jean, who struggled with public speaking in general due to her inability to gauge the audience. He was satisfied that they thought that way, but he didn't miss the slight disappointment flashing across Jean's face as she returned to her seat.</p>\n<p>'She was hoping to receive an opportunity to stand her ground,' Guy confirmed mentally.</p>\n<p>\"Although I like the name, Jean,\" Guy said. \"I feel that it lacks sufficient punch. It doesn't have the force needed to stand out amongst other, more prominent sects. Do you understand what I mean?\"</p>\n<p>Jean's eyes opened up with satisfaction and she nodded thoughtfully. \"Now that it's been pointed out, I can see the shortcoming. Thank you Sect Leader.\"</p>\n<p>\"By the way, I noticed that everyone's calling me Sect Leader now?\" Guy segued. \"We haven't even officially established the Sect yet, isn't it a bit premature?\"</p>\n<p>\"We all know it's an eventuality,\" Marie chuckled. \"We're just getting used to it.\"</p>\n<p>\"It's too long!\" Guy said while shaking his head. \"I don't think you can call me Teacher without getting sued by the Co-operative. So, just call me Mister Larks or just Guy. \"</p>\n<p>\"Okay, Guy it is,\" Marie affirmed with a muffled laugh.</p>\n<p>\"Marie!\" Markus yelped. \"Master,\" he then pleaded with a worried gaze.</p>\n<p>\"You can call me whatever you want, Markus. Respect doesn't adhere to a name, but the person,\" Guy said while waving his hands. He turned to Jean and gazed at her expectantly.</p>\n<p>\"I will call you Mister Larks...\" the girl mumbled.</p>\n<p>\"Since that's out of the way, let's get back to the business at hand. Markus, it's your turn now,\" Guy redirected.</p>\n<p>\"My current frontrunner for sect names is the 'Shifting Paradigms Sect',\" Markus started. \"It's inspired by how we are constantly encouraged and forced to question our beliefs and biases and broaden our understanding of the trivialities that prevail around us. Even the simplest of phenomena have innumerable mechanisms underlying them that at first glance are impossible to fathom. Yet as you unfurl it, layer by layer, things start to make sense.\"</p>\n<p>\"That's a wonderful rationale, Markus,\" Guy congratulated.</p>\n<p>\"I agree,\" Marie followed up. \"But I think it's too complicated and wordy. Paradigm is a tough word that I don't think many people will know the meaning of. And it's a mouthful.\"</p>\n<p>\"That is a fair point,\" Guy agreed. \"No matter, we still have time. Let's resume the process. Marie, now it's your turn.\"</p>\n<p>They then continued the brainstorming session. Incrementally, the blackboard was populated with a plethora of names offered by his three students. However, the discussion stopped maintaining its civility near the end, as exhaustion and irritability started to take hold of their minds. After all, it was never pleasant having your ideas denied.</p>\n<p>By the end, a still silence reigned in the class. No one took the initiative to go up to the board and jot down another name. Either they were out of ideas, or just didn't have the motivation to do so.</p>\n<p>Guy looked around and sighed upon seeing the morose faces.</p>\n<p>'I guess I'll have to go with one of my own,' he concluded begrudgingly. As he was about to erase the names from the board, Jean shot up from her seat.</p>\n<p>Her eyes flashed with a rare sparkle, and she gulped excitedly.</p>\n<p>\"I... I have another one!\" She exclaimed uncharacteristically.</p>\n<p>She walked up to the front and started explaining.</p>\n<p>\"I got inspired by Senior Brother's very first idea,\" she said while pointing at the crossed-out 'Shifting Paradigms Sect' on the blackboard. \"Senior Brother defined it as the result of peeling away the layers of obfuscations to get to the truth. To put it another way, here we learn how to look beyond the falsehoods presented to us and get to the fundamental truths. A world without mana, that is the truth.\"</p>\n<p>With an extremely agitated expression, she declared, \"'True World Sect'! That is the name. It defines what we seek to do here. It encapsulates the vision, and the mission succinctly. And, it is short and catchy, like Mister Larks pointed out.\"</p>\n<p>The still silence that impregnated the room morphed into one filled with excitement. While the students contemplated this idea, something moved within Guy's soul.</p>\n<p>All of a sudden, he started to feel animated as the name echoed within his mind. A part of him was resonating with it. The minute tear within the RoK widened slightly, and an ominous aura rippled out before dissipating.</p>\n<p>\"I like it!\" Guy asserted. \"Opinions?\"</p>\n<p>\"It's perfect,\" Marie agreed, and so did Markus.</p>\n<p>\"So that does it then. From here on out, our Sect with be known as the True World Sect.\"</p>\n<p>With a booming voice, Guy added with fervour, \"Our vision is to educate the uninformed masses of the truth that our world is built upon. And our mission is to cultivate free thinkers that can challenge the established facts that lack proper scientific founding and pursue the truth no matter the co-\"</p>\n<p>Guy coughed as he finally caught himself. He shook his head to clear his rampant and somewhat anarchic thoughts and alternated his gaze between his students who sported a confused expression.</p>\n<p>\"I, uh...\" he muttered. \"I'm feeling a bit woozy. I stayed up all night brainstorming. I ought to rest,\" he said with a strained smile.</p>\n<p>\"Anyways, class dismissed.\"</p>\n<p>'That was weird. I lost myself there for a second. I... I think I need to clear my head a little bit.'</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/l9vnstr3u6eacbswha9d5rq\">Chapter 194 - The Same Person</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/hx1nee4jkb2enw7rs5we1oq\">Chapter 192 - Crowdsourcing</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}