{"pageProps":{"note":{"id":"8mt6uqc0lo7yl9qtz1kc95a","title":"Chapter 206 - Through the Heavenly Eye","desc":"","updated":1659347046628,"created":1656854577915,"custom":{},"fname":"volume-3.chapter-206","type":"note","vault":{"fsPath":"vault"},"contentHash":"f6ad129cc02f7bdd7d12b88ac30ea5a0","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-206","id":"8mt6uqc0lo7yl9qtz1kc95a","vaultName":"vault"},"value":"volume-3.chapter-207","position":{"start":{"line":103,"column":3,"offset":10768},"end":{"line":103,"column":27,"offset":10792},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-207"}},{"from":{"fname":"volume-3.chapter-205","id":"82wjew670hdukpfhehp300s","vaultName":"vault"},"type":"backlink","position":{"start":{"line":95,"column":3,"offset":10189},"end":{"line":95,"column":27,"offset":10213},"indent":[]},"value":"volume-3.chapter-206"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-206---through-the-heavenly-eye\">Chapter 206 - Through the Heavenly Eye<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-206---through-the-heavenly-eye\"></a></h1>\n<p>Krish observed Marie, his Disciple, with a sublime smile - one that originated from the deepest recesses of his heart which had frozen over many years ago. It was in moments like these, marinating in the achievements of his Disciple, that he would remember the oft-spoken words of his own Master as he was approaching his end.</p>\n<p>\"As practitioners of the Heavenly Eye, we have very little to look forward to in our lives. With all the power of foresight that our cultivation grants us, it takes away something very important that motivates us to look forward to the next day - hope. This was until I took on a Disciple. After you became my ward, every day presented me with new possibilities. Every time you made progress, I would immediately look forward to the new heights you would reach. Hope was brought back into my life.\"</p>\n<p>At this moment, Krish could empathise with his Master. As he observed his Disciple progress, the long-lost hopefulness was reinvigorated and his frozen heart began to thaw anew. But everything good must come to an end eventually - a pained frown formed on Krish's face and began to deepen progressively.</p>\n<p>This change wasn't missed by Marie who, although entrenched in an excited trance, was fully aware of her surroundings - especially her Master.</p>\n<p>\"Is something wrong?\" She asked casually.</p>\n<p>Krish inhaled deeply and said, \"Not at the moment. Don't overuse the Heavenly Eye, you don't have enough mana to sustain it for long. I don't want Matron Reva coming after me again.\"</p>\n<p>Marie chuckled and dissipated the gold luminance from her eyes.</p>\n<p>\"Rest well today, don't overexert yourself. Tomorrow, I will show you how to use the Heavenly Eye in place of Divination,\" Krish continued.</p>\n<p>\"Is there a reason for that? Since Divination works well enough for me, why don't we try something else?\" Marie proposed.</p>\n<p>\"My intention isn't for you to drop Divination due to it becoming redundant. I've already established that it is far safer to divine the future than to observe it directly with the Heavenly Eye. The reason why we're starting this way is that it will help you grow familiar with the Heavenly Eye more quickly,\" Krish explained.</p>\n<p>\"Off you go!\" He waved as he urge the girl out of the cottage.</p>\n<p>As Krish observed her back jubilantly bobbing up the steps, his previous frown returned once again.</p>\n<p>When he achieved perfected resonance, his Master told him: \"Power always requires a sacrifice.\"</p>\n<p>Krish didn't know what he meant, nor did he recognise the severity of those words. It was only much later when he attempted to breach into the Foundation Establishment realm that he experienced just how soaked in irony magic was.</p>\n<p>As Al grew stronger and stronger by consuming more and more knowledge, he sacrificed the ability to innovate. The more Guy pursues the so-called \"Truth\" of the world, the quicker he loses his own grasp of reality.</p>\n<p>Just like that, the cost one must pay to gaze further into the cryptic phenomenon called \"Fate\" is their present. To see the future, a part of their present needs to be lost. And that is what Marie needed to experience to jump from the Mana Condensation realm into the Foundation Establishment realm and become a true mage. Krish knew this for a fact. If it were before, Krish would have forced Marie to go through with it right after her perfected resonance and pushed her into the Foundation Establishment realm - just like how his own Master did with him.</p>\n<p>Yet now Krish was hesitating. He did not want her to experience it - the pain. Why was that? Did his own Master feel that way about him? Krish didn't think so since he didn't feel any hesitance or reluctance in his Master's actions.</p>\n<p>Krish hummed and entered a meditative state, as he pondered over his thoughts and actions.</p>\n<p>'Why am I behaving this way?' Why was he suddenly letting emotions dictate his decisions? Krish firmly believed that his Master had turned him into a cold, calculative mechanism like himself. If this were true, then his mind should not have wavered earlier. The fact that it did, implied that the impeccable mechanism was compromised - rust had taken hold.</p>\n<p>'Is it undesirable?' Krish countered. To call it rust would mean that Krish was averse to this change. The fact was, Krish did not despise his new outlook. It made him feel more alive - more involved with the world around him. He was fully aware that in doing so he had opened himself up to greater danger. The more he cared about others, the more he would feel inclined to adjust their fates. A quick glance at his deformed leg cemented that thought.</p>\n<p>'Then WHY?! Why am I still not discouraged?' This was a question he could not find the answer to with his Heavenly Eye.</p>\n<p>\"Even after all these years, I'm still discovering new facets about myself,\" Krish sighed. He then collapsed onto his mattress and chuckled. \"Maybe this is how Master managed to live for so long. He must have unearthed parts of himself he never even knew about by interacting with me. Now that I think about it, when he passed, his character was nothing like the man who took me in as his Disciple.\"</p>\n<p>\"I guess this is my path now,\" Krish muttered. \"I must prepare for it accordingly. There has to be an alternative.\"</p>\n<hr>\n<p>The following day, Marie arrived at Krish's cottage punctually. He could feel the excitement oozing out of her body even before opening the door.</p>\n<p>\"Master!\" She called out. \"I'm here. Let's do this!\"</p>\n<p>\"Calm down, there's no hurry,\" Krish responded as he opened the door.</p>\n<p>\"Of course, YOU would say that,\" Marie grumbled while entering.</p>\n<p>\"There's no need to be impatient. We cannot be hasty, it is not safe,\" Krish advised.</p>\n<p>\"I'm patient. It's just that I have this feeling that I'm really close, you know?\" She answered. \"The sooner I learn how to use the Heavenly Eye properly, the sooner I can advance to the Foundation Establishment realm.\"</p>\n<p>Krish revealed a twitching smile and redirected the discussion, \"Sit in the lotus position. Follow the same method I taught you yesterday to activate the Eye.\"</p>\n<p>Marrie hummed affirmatively and closed her eye to focus on the flow of her mana. She moved it through her channels, towards her eyes and let them saturate. With a slow reveal, her eyelids separated revealing a pair of bright golden pupils.</p>\n<p>\"What do I do now?\" Marie asked.</p>\n<p>\"Throttle the flow of mana to your eyes first. You're expending more than is required,\" Krish instructed. \"Decrease the flow until I say stop.\"</p>\n<p>Marie proceeded to do just that and started to lower the mana flowing through her channels. To do this, she had to control the mana released from her nascent core that was allowed to circulate through her body. As she was in the Mana Condensation realm, and was yet to form a proper core, this process was much harder and required her to enter a perfectly controlled meditative state where she was aware of what transpired within her body.</p>\n<p>Slowly, the brightness in her eyes started to dim, although the gold wash remained present.</p>\n<p>\"That's sufficient,\" Krish reminded. \"Divining with the Heavenly Eye is similar to the method we've worked with before. For one, you will have to state the inquiry you wish to receive the answer to, and you will need to obtain the answer from the waves of fate that are emitted and received from the world. However, the intermediate steps vary significantly.\"</p>\n<p>\"A word of caution,\" Krish paused. \"Although the results obtained from the Heavenly Eye are extremely precise and descriptive, they expend significantly more mana per use. Before, this expenditure could be justified since regular Divination was highly subjective and was equally lacking in precision. However, with the method you've developed, I don't think that is the case anymore. At this point, the only benefit of using the Heavenly Eye to divine the future is if the question alludes to Constant events.\"</p>\n<p>\"Now clear your mind, and ask a very basic question,\" Krish started. \"Once the question is asked, focus only on the wave that is being emitted.\"</p>\n<p>Marie sucked on the inside of her teeth as she thought over her inquiry. \"When will Mister Larks return to Twilight Village?\"</p>\n<p>The moment the words left her mouth, so did a series of waves. Unlike earlier, Marie did not have to tune into the \"frequency\" of the waves of fate with her mana sense. Her eyes could ACTUALLY see them move. Without wasting another moment she turned her focus on the wave. Within seconds of doing so, she felt her vision warping. The wave started to split before her eyes. Instead of acting like a regular wave spreading outwards like before, what she saw were a multitude of silver-coloured strings that extended from her to different locations. Some of these strings were thick, others not so much. What they all had in common were vibrations, as in they were all twitching periodically.</p>\n<p>\"These strings are tied to potential entities, living or non-living, that may be related to the question you've proposed. Each of them will indicate how these entities will influence the outcome. The Heavenly Eye decomposes the waves of fate automatically for you, just like how your original method does it. To decipher the response, focus on any string in front of you. The thicker they are, the greater their involvement in the outcome.\"</p>\n<p>Marie followed the instructions and shifted her focus to the thickest string originating from her. At that instant, she felt her sight shifting. The world around her split into a lustrous golden cloud, that started to turn colours rapidly.</p>\n<p>With a flourish, her vision gained clarity. At this instant, she no longer felt as though she was inhabiting a body - she felt like a disembodied head floating around. She was currently \"floating\" inside what looked like a luxurious carriage. It was rocking jerkily, which reminded her of the painful ride to the village.</p>\n<p>\"I did not expect that we would return so soon, Master,\" Markus' voice hooked her attention. \"It's only been a month. I believe we still have some more work left?\"</p>\n<p>\"The builders will be arriving very soon. I need to prepare the area and finish up the plans,\" Mister Larks' voice answered. Marie turned around and saw the two conversers shifting their weight between their buttocks to offset the ache brought upon by their ride.</p>\n<p>\"Why hasn't anyone developed some form of suspension system for these carriages!\" Mister Larks exclaimed as his head collided against the walls of the carriage.</p>\n<p>And with that, the vision dissipated and Marie found herself back in the cottage with her Master. Before she could speak, though, she suddenly felt sapped of energy and collapsed on her back. She hadn't lost her consciousness yet, but she was exhausted.</p>\n<p>\"As I said,\" her Master's voice spoke up. \"It is immensely taxing but equally precise.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/pklupi9yj8jw97t6cisk7kf\">Chapter 207 - Stalling</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/82wjew670hdukpfhehp300s\">Chapter 205 - Opening the Heavenly Eye</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}