{"pageProps":{"note":{"id":"8wt7zdt1qo9drsv6qvlbzae","title":"Chapter 369 - The Debate (Rebuttal Segment)","desc":"","updated":1696241023488,"created":1693254062802,"custom":{},"fname":"volume-5.chapter-369","type":"note","vault":{"fsPath":"vault"},"contentHash":"0abc77b10c444cefead5193d77094551","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-369","id":"8wt7zdt1qo9drsv6qvlbzae","vaultName":"vault"},"value":"volume-5.chapter-370","position":{"start":{"line":55,"column":3,"offset":11267},"end":{"line":55,"column":27,"offset":11291},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-370"}},{"from":{"fname":"volume-5.chapter-368","id":"oc5xu3c8gs9f52owjsh2rw4","vaultName":"vault"},"type":"backlink","position":{"start":{"line":91,"column":3,"offset":10507},"end":{"line":91,"column":27,"offset":10531},"indent":[]},"value":"volume-5.chapter-369"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-369---the-debate-rebuttal-segment\">Chapter 369 - The Debate (Rebuttal Segment)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-369---the-debate-rebuttal-segment\"></a></h1>\n<p>The Rebuttal round started with heavier applause, with palpable excitement radiating from the crowd. There were even some enthusiastic whooping as the debaters ascended the stage. The celebration was not unlike the time when two combatants with years of rivalry squared off against each other for a main-event match. Guy let out a satisfied smile as he observed the reactions from the crowd. He wasn't surprised, though, as he expected things to turn out like this from the start.</p>\n<p>A debate is only as interesting as how invested the participants are in the topic they are supporting. People need to care about what they are arguing in favour of. If that emotion is evident, it then permeates into the crowd and makes them invested in the debate as well. Each of the seven debaters on stage is committed to a stance. They believe it from the bottom of their hearts and are willing to fight in its favour (as evidenced by the fistfight they got into). Guy also took a few creative liberties with the debate format which he carried over from his past life. The standard format wasn't so sensational, opting for a more reserved and methodical process. For instance, during cross-examination, there isn't usually a dialogue between the examiner and examinee - the question and answer are fairly detached. But Guy figured that having some confrontation during the cross-examination period would sensationalise it a bit more, thus making it a bit more engaging for the audience. This was especially important in the Constructive segments since they are fairly less confrontational - it is about building up the argument.</p>\n<p>The Rebuttal segment is all about defence. Each team would try to break apart the opposing argument while propping up their own. Guy looked to his left and gestured for Norris to step forward.</p>\n<p>\"The first debater stepping up is the team defending Definition 2, Norris.\"</p>\n<p>Norris approached the podium with uncertain steps. As he watched her come closer, Guy realised why her team had placed her at the tail end of the debate segment. The girl was practically crumbling under stage fright. If she was to be confronted during cross-examination, Guy was certain that she would fall apart altogether. Her gaze was lowered, and the piece of paper in her hand was nearly crumpled into a ball with stress. She grabbed the podium with both her hands, let out a long breath while closing her eyes, and started speaking.</p>\n<p>\"While we acknowledge the affirmative's drive for standardization, we contend that Definition 1's tunnel vision and rigidity conflict with the nature of magic itself in the process. Indeed, standardization is valuable, but it must be achieved without sacrificing the core essence and versatility of magic. Definition 1 essentially places an asterisk against the very definition it proposes, suggesting that as long as all the dominoes fall into place – a specific spell is cast, a controlled scenario is established – only then can we truly measure mana. Magic is irregular, and mana is defined by the True World Sect to be the 'cheat code' that averts the natural laws. If we try to curtail magic in all its forms through the same lens of natural phenomena, we will be sacrificing the primary nature of magic itself. Sure, it is necessary to regular a procedure so that it is repeatable and can provide comparable results no matter who performs it, but Definition 1 is far too strict in its limitations to be viable universally.\"</p>\n<p>Norris' voice wasn't so loud as the others before her, as she was naturally a timid individual. However, the conviction in her words was far greater than all those before her, which roused the crowd that had returned fresh after the break and brought them right back into the heated debate.</p>\n<p>Guy returned to the podium and urged the girl, who had reverted into a timid hunch, back to her team.</p>\n<p>\"An amazing first rebuttal by Norris, let us have a round of applause!\" Guy initiated with some enthusiastic clapping. He wanted to encourage the girl to be confident in herself. Public speaking is tough for everyone. But having an especially bad experience can dissuade them from ever trying again. Guy wanted Norris' first attempt to be memorable and positive.</p>\n<p>\"Our next speaker is from the team defending Definition 1, Lacey.\"</p>\n<p>Lacey approached the stadium amidst light applause. It was evident that she, just like her sister, was more famous amongst the Sect members. Especially because she was one of the creators of a game played by everyone on campus. Guy was sure that there would be some bias in the play caused by the girls' fame when it finally came time for the audience to vote for the victor of the debate. 'We'll address that if need be.'</p>\n<p>Guy didn't want to doctor the results... but he also didn't want the outcome of this pilot program to set a precedent for other debates down the line. To him, some unethical manipulation against bias, and in favour of fairness was forgivable.</p>\n<p>\"In response to the negative, we assert that Definition 1 isn't about reductionism but about establishing a common language for the measurement of mana. By measuring energy through a specific transformation, we provide a consistent yardstick for comparisons. This is not evident in Definition 2. While we agree that magic and mana are fluid and variable, it is antithetical to hinge a concept that needs to be used by a myriad of people across different backgrounds and abilities on this variability as it makes it hard for everyone to have the same 'language' when communicating knowledge amongst themselves. We believe that the definition of a unit of mana is important for all future magical research as all analysis will be built upon it. And this research can be in a myriad of fields within magic, natural sciences and social sciences. Therefore, it is important to have an invariable structure so that whatever research that is built upon it doesn't collapse in the future.\"</p>\n<p>Guy walked up on stage and transitioned to the next speaker, \"Since the team supporting Definition 2 has one member short, a member who has already spoken has the opportunity to address the house again. Who will be stepping forth?\"</p>\n<p>The members of the second team exchanged glances before Krane reached forward and tapped Norris on her shoulder. Norris jerked in place, half-shocked and half-anxious. She pointed a finger to herself and mouthed, \"Me?\", with an expression oozing with self-doubt. Her team members, in turn, nodded affirmatively and started to clap for her instead. This ember burst into a burgeoning flame as the entire audience joined in to welcome Norris to the podium.</p>\n<p>The blushing girl walked with small but hurried steps to the podium. She cleared her throat, placed the crumpled paper in front of her, and started speaking. Her voice wasn't as unsure as in the previous attempt. Which Guy pegged as a sign of progress.</p>\n<p>\"While Definition 1 claims to establish a so-called 'common language' it is still reliant on the |Firestarter| spell. The issue is that the heat transfer through that method is inconsistent. In their report, they have employed strategies to ensure that the transfer is as efficient as possible, but that places a burden on the apparatus and environment where the experiment must be undertaken. Heat energy transfer through fire is inefficient by nature. Since it isn't directional, some energy is lost through convection and radiation from the sides. Even with the systems in place, as defined in their experimentation, we believe that the mana unit definition is subject to a systematic error, making it structurally unsound as a basis for future experiments. This isn't the case with the transmutation of mana to mass, as it is proven to be a lossless process. This is why Definition 2 is the most appropriate definition of the Mana Unit.\"</p>\n<p>Once Norris finished speaking, she was guided back to her place amongst her team members amidst a round of applause. Guy then looked towards Revian, the final participant. The boy shared a look with his team members, who returned an encouraging smile, and the girls pumped their fists excitedly.</p>\n<p>Revian took the podium and started the final rebuttal of the round. \"While the opposing team makes a good point about the inefficient nature of heat transfer through the fire, they also rightfully emphasised the steps we took to ensure that such wastage was negated. Yet, even with the claimed inefficiency, we stand behind the application of the |Firestarter| spell because it is possible to measure the loss and solve for the systematic error - the enthalpy (a thermodynamic quantity that measures the energy in a system) of the chemical reaction is known, and an extension experiment can be performed to obtain the systematic error.”</p>\n<p>“However, Definition 2 relies on mass conservation and while the opposing team claims that it is lossless, it is only a claim that remains unproven. No study delves into the exact nature in which mana is transmuted into mass. Mass in equals mass out is true if the reaction is chemical in nature. Is magical transmutation a chemical reaction? Or is the reaction happening at an atomic level? If I were to use a hundred gram mana crystal to create a diamond, and then another mana crystal to create a piece of coal, would the diamond and coal weigh the same? While the opposing team claims that Definition 2 is robust as it is based on the law of conservation of mass, they are conveniently overlooking this glaring hole in their experiment. This is why we believe that Definition 1 is the most apt descriptor of the Mana Unit.\"</p>\n<p>Guy returned to the podium and waited as the applause died down. \"The teams have now finished making their arguments. Before we move on to the deliberation round to determine the winner, each team will now have a minute to make a closing remark. Would the team leaders please stand?\"</p>\n<p>Kevan and Luce stood up behind their tables on cue. Kevan looked towards the judges and audience and started speaking, \"In our final plea, we assert that Definition 1 isn't about suppression but about providing a standardized measure that accommodates magic's universal principles. Our approach bridges the gap between precision and creativity, fostering a common ground for discussions. By quantifying mana through a specific energy transformation, we capture its essence while maintaining coherence and comparability.\"</p>\n<p>Next, Luce did the same, \"In our closing, we reiterate that magic's essence lies in its open and variable nature. Definition 2, which ties mana to water creation through the |Water Spout| spell, embraces this nature while ensuring that it is open to everyone - without having to rely on complex processes and apparatus. Furthermore, by aligning the process with a robust law of mass conservation, we ensure that any external factors that may affect the definition are avoided.\"</p>\n<p>As the two members sat down, roaring applause and intense cheering resonated within the room. Elder Nara, in the judge's seat, turned around and revealed an intrigued smile, while Guy bore a grin that could outshine the sun.</p>\n<p>\"That went better than expected,\" Guy said to himself as he waited for the symphonic ruckus to die down so that he could bring the event to a close.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/lm5j9b10k4llxrmlcbp2lzk\">Chapter 370 - The Dreaded Outcome</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/oc5xu3c8gs9f52owjsh2rw4\">Chapter 368 - The Debate (Constructive Segment)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}