{"pageProps":{"note":{"id":"8yHlwQ8Fgv7SezJAn2fRq","title":"Chapter 042 - Guide to Avoid Getting Face-Slapped","desc":"","updated":1643622488715,"created":1643569263418,"custom":{},"fname":"volume-1.chapter-042","type":"note","vault":{"fsPath":"vault"},"contentHash":"021538dc28c1f08a924a31028df52dfc","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-042","id":"8yHlwQ8Fgv7SezJAn2fRq","vaultName":"vault"},"value":"volume-1.chapter-043","position":{"start":{"line":125,"column":3,"offset":11455},"end":{"line":125,"column":27,"offset":11479},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-043"}},{"from":{"fname":"volume-1.chapter-041","id":"cdxRZhRrekexmIyrOm5nY","vaultName":"vault"},"type":"backlink","position":{"start":{"line":89,"column":3,"offset":9713},"end":{"line":89,"column":27,"offset":9737},"indent":[]},"value":"volume-1.chapter-042"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-042---guide-to-avoid-getting-face-slapped\">Chapter 042 - Guide to Avoid Getting Face-Slapped<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-042---guide-to-avoid-getting-face-slapped\"></a></h1>\n<p>Wei Zao had initially set out this day to find a suitable weapon for his student. Gaige was trained in swordsmanship, and his cultivation method was also complemented by sword arts. While he himself didn't have any money to fund the purchase, Gaige had regained his family's interest and secured his father's backing once again. The process was fairly generic, a couple of duelling challenges here, a few insults and sleights there... Anyways, the end result was that they had more money to work with now, and a solid backer.</p>\n<p>Gaige's father didn't actually write Gaige off following the repeated failures in cultivation. The man still held a deep affection for his blue-eyed sweetheart and the product of their love and had spent great efforts in the shadows to help Gaige. He couldn't appear to show favouritism to his \"illegitimate son\" in front of his legal wife and her family, lest it descends into a full-blown conflict between clans. Therefore, the man was infinitely grateful to Wei Zao for helping his ward out and offered this world's equivalent of a \"black card\" for his personal coffers, which could be used to fund Gaige in any way possible.</p>\n<p>Although Wei Zao was eager to create a weapon on his own that was perfectly suited for Gaige, he realised the process wasn't so simple since the Omniscient Library didn't provide hints in smithing and enchanting like with alchemy. Forging, smithing and enchanting were inherently fluid in nature, and it was impossible to write precise instructions that applied universally.</p>\n<p>Therefore, the only logical option was to search out suitable weapons from the market. The world was vast, there must be something out there that could meet his student's needs!</p>\n<p>With that in mind, Wei Zao directly approached the most well-known weapon and armour store in Radiant City, The Burning Forge. The moment he entered its premises, he was reminded of the luxury boutiques from his old world. Various weapons and armours were set out in display, with their information pasted conveniently next to them. The sales representatives stationed nearby would assist in terms of usage and fitting. The store even offered personalised forging services; it was definitely a high-class establishment.</p>\n<p>Wei Zao grew extremely excited and started to inspect all the items in the store to see how they matched up with Gaige's cultivation and specialisations.</p>\n<p>He found a perfect sword, advertised to be forged with an alloy that the Omniscient Library stated could resonate with dark-type mana and cultivation. It was totally suitable for Gaige!</p>\n<p>Wei Zao approached the display sword and stroked the weapon carefully, causing a book to materialise in his Omniscient Library. As Wei Zao read through it, his brows furrowed. He quickly waved at a representative, and asked with curiosity, \"Are the display pieces supposed to be cheaper replicas of the real deal?\"</p>\n<p>The representative tilted his head in confusion and shook his head, \"No, Sir. These pieces are exact replicas of the actual weapon. We have unexposed versions of the same weapon in storage which we resize and sharpen to fit the user's needs. These display pieces offer the customer a way to judge their compatibility with the weapons.\"</p>\n<p>Wei Zao didn't lower his voice and spoke, \"But this weapon isn't made of hundred-per cent Gandorium blend as advertised, though.\"</p>\n<p>\"Excuse me?\" The representative retorted incredulously.</p>\n<p>\"The information sheet here states that the sword is forged with the purest Gandorium blend. However, the piece seems to be only 80% Gandorium, the rest is comprised of Orichalcum. I guess it is easy to confuse since their aesthetic properties are similar and Orichalcum is functionally inert. But the result is a 5% reduction in the sword's resonance with a plethora of mana types. I know that it sounds minor, but for a mage at a lower realm, each per cent means a lot,\" Wei Zao rattled calmly.</p>\n<p>The representative glanced around in panic as he saw a crowd forming. This was bad news!</p>\n<p>\"What's wrong?\"</p>\n<p>\"That man claims that the sword is falsely advertised.\"</p>\n<p>\"The Burning Forge wouldn't pull something like that, right? They're a reputed establishment.\"</p>\n<p>\"Who can say for sure? Let's watch what happens.\"</p>\n<p>The representative grit his teeth and retorted with as much respect as he could muster, \"Sir, please don't make such wild claims without evidence. The Burning Forge prides itself for its quality and after-sale services.\"</p>\n<p>Wei Zao frowned when he heard that. Here he was, offering a well-meaning explanation out of goodwill, only to receive the scorn of the opposite party. \"I'm not making things up. Why don't you inspect the sword?\"</p>\n<p>Everyone gasped at that claim. To inspect an artefact meant to call in a Smithing and Enchanting Guild's official to run an inspection. This was so that the results were unbiased and accurate. While it may seem like a trivial process, the result could make or break an individual or company. If the guild announced that the sword was as Wei Zao claimed, then The Burning Forge would suffer a huge blow and lose its credibility.</p>\n<p>The inspection process was heavily skewed against the smith or enchanter, and the person calling for the inspection faced no consequences. The reason for this was backed by many historical cons and schemes, resulting in the guild cracking down on fakers and their members.</p>\n<p>Wei Zao's blatant call for an inspection angered the representative and he retorted in a raised voice, \"Can this Sir please explain his reasoning? Are you a licensed member of the Smithing and Enchanting Guild?\"</p>\n<p>Wei Zao replied with a wry smile, \"Not really...\"</p>\n<p>\"They how can you go about making such claims and expect us to believe it. Is calling for an inspection from the guild such as easy ask that just about anyone can do it? Furthermore, aren't you looking down on The Burning Forge?\"</p>\n<p>Wei Zao retaliated dramatically, \"I've only been pointing it out to you out of goodwill. But it looks like you aren't willing to accept it. Let do this: I am willing to stake double, NO! Quadruple! of what this sword is being sold for. If what I've claimed is false then I will pay this establishment immediately and never show my face here ever again. However, if what I said is true...\"</p>\n<p>The representative caught on to the extended pause and prepared to agree to the challenge, \"If it is true then The Burning Forge will personally apologise to you and make amends to all the individuals that have purchased this sword, monetarily!\"</p>\n<hr>\n<p>This was what Karmin saw when he arrived at the shop floor.</p>\n<p>\"Who the hell does this man think he is?\" Karmin muttered in anger. He wasn't giving Karmin any face by blatantly making wild claims about his business' integrity.</p>\n<p>Karmin was about to go and affirm the representative's challenge and add additional stakes to thoroughly suppress this Jo Way. But the moment he took a step, he recollected Guy's advice.</p>\n<p>\"Jo Way isn't a simple person...\"</p>\n<p>Karmin pondered on it for a bit. What did Guy mean when he said that? Karim glanced at Jo Way's resolute and confident expression, and he wavered.</p>\n<p>'What if he was right?' Karmin exclaimed. 'No! I can't take any risks!'</p>\n<p>Karmin coughed audibly and drew everyone's attention, \"You! Who are you to make such promises on behalf of The Burning Forge?\"</p>\n<p>\"That's Mister Zola, the 2-star Smith!\"</p>\n<p>\"Him? Wow, he looks so imposing!\"</p>\n<p>Karmin shook his head to tune out from the conversations running in the background. He drilled his eyes into the representative and glared meaningfully. The representative was a little shaken at first, but his training kicked in. He had worked in The Burning Forge for over 5 years now, and he had personally interacted with Karmin on many occasions. So, he was quick to pick up the hints Karmin was dropping. He bowed down apologetically and said, \"I apologise for my presumptuousness, Mister Zola. I got too agitated, and my tongue slipped.\"</p>\n<p>Karmin frowned, as an act, and continued, \"Why are you apologising to me? What is The Burning Forge's unspoken rule?\"</p>\n<p>Without waiting for anyone to make stupid guesses, he answered his own question, \"The customer is always right!\"</p>\n<p>The representative was quick to swallow his irritation and offered a convincing apology to Jo Way.</p>\n<p>\"For your mistake, I will be suspending you without pay, effective immediately!\" Karmin declared and once again glared meaningfully at the representative. Thankfully, the man had the presence of mind and caught on to the additional hints.</p>\n<p>'Mister Zola is trying to redirect the crowd's attention!'</p>\n<p>He then quickly walked out with faked dejection and drooping shoulders.</p>\n<p>\"Mister Zola is so unwavering. The Burning Forge truly does care for their customers!\"</p>\n<p>\"You're so right! Wait, what are we standing around here for again?\"</p>\n<p>\"I don't know... Oh right! I came to buy a new shield for my wife. Man, she is so strong!\"</p>\n<p>Karmin sighed in relief internally and approached Jo Way, who appeared to be discombobulated by the awkward turn of events. This wasn't how things usually turned out...</p>\n<p>\"I apologise for my employee's rudeness. It was my fault for not training them properly,\" he apologised.</p>\n<p>Karmin didn't wait for Jo Way to respond, though. Because he right away snapped his fingers and seamlessly guided Jo Way away from the sword, \"Right! Why don't we do it this way...\"</p>\n<p>He pulled out a token from his coat pocket and offered it to Jo Way with both hands. \"This is The Burning Forge's personal forging token. It is only available to the VIPs and the elites that are affiliated with our establishment. This token works like a gift, by which the holder can request The Burning Forge to make for them a single, personalised item to meet their needs. I saw that you are looking for a sword made of Gandorium blend. using this token, you can ask for one made of a Gandorium-Brionium composite, free of charge!\"</p>\n<p>Jo Way's eyes visibly widened at that statement. Brionium was an extremely rare metal that was a hundred times more resonant to the dark-type element. Jo Way initially wanted to find a weapon made completely out of Brionium for Gaige, but he recognised that it was financially impossible even with the \"black card\".</p>\n<p>Jo Way gulped audibly and accepted the token. \"It's no big deal! Thank you for this token. I will gladly take you up on that offer.\"</p>\n<p>With it finally, in his hands, Jo Way quickly darted out of the store with an excited expression. Since he now had a freebie token, he could design a weapon bespoke to Gaige's cultivation and martial art.</p>\n<p>Once Jo Way turned a corner, Karmin waved his hands and another representative walked up to him with the displayed sword.</p>\n<p>Karmin moved his hands over the blade and used a magnification artefact to observe it carefully. As his hands slid further, the frown on his face turned grew deeper.</p>\n<p>He faced the representative next to him and instructed, \"Tell Callum to seize Craftsman Jace and all his assets. Also, make sure that everything is discreet.\"</p>\n<p>As the representative rushed away, Karmin contemplated on what transpired.</p>\n<p>'Moris Jace! You shouldn't have taken my kindness for granted. Stealing from me will be the last thing you do - I will make sure of it!'</p>\n<p>He then sighed, 'Thank the Sun that I didn't rush in and make a fool of myself. If it wasn't for Guy Larks' warning I would have truly ruined myself...'</p>\n<p>The outcome would have gone one of two ways; Karmin was thankful that it went positively.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/ZXgLcnljdxCVe7uPRbhEd\">Chapter 043 - Practice Makes Perfect</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/cdxRZhRrekexmIyrOm5nY\">Chapter 041 - The Burning Forge</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}