{"pageProps":{"note":{"id":"8zsx6p1thfgitg6e7vyz40e","title":"Chapter 172 - Sects of the Past, Present... and Future?","desc":"","updated":1652678234176,"created":1650194206635,"custom":{},"fname":"volume-3.chapter-172","type":"note","vault":{"fsPath":"vault"},"contentHash":"e169900db44fcb21d80533c6489b4faf","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-172","id":"8zsx6p1thfgitg6e7vyz40e","vaultName":"vault"},"value":"volume-3.chapter-173","position":{"start":{"line":55,"column":3,"offset":11459},"end":{"line":55,"column":27,"offset":11483},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-173"}},{"from":{"fname":"volume-3.chapter-171","id":"9yv9lnjrzckmeiut9zptjeh","vaultName":"vault"},"type":"backlink","position":{"start":{"line":93,"column":3,"offset":11100},"end":{"line":93,"column":27,"offset":11124},"indent":[]},"value":"volume-3.chapter-172"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-172---sects-of-the-past-present-and-future\">Chapter 172 - Sects of the Past, Present... and Future?<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-172---sects-of-the-past-present-and-future\"></a></h1>\n<p>The Cloudstrider Sect started some 5000 years ago - after the Age of Isolation - making it one of the older sects in the scene. To that end, their Archive was chock-full of data crystallising their rich operating history and beyond.</p>\n<p>As Guy added more and more books into the RoK, he entered a fugue state of semi-consciousness. This was a first for him, a usual speed-reading session never took him to such a level of immersion. What he was experiencing at the moment was magical through and through.</p>\n<p>Imagine completing a book and moving on to the next one. At that point, you would expect to have repressed the information accumulated from the first book to the back of your conscious mind as you focused on the current one. However, for Guy, it was as if everything he read before was overlapping with what he was reading at the moment. The effect kept getting stacked as he moved from one book to another. It could be likened to holding down on the sustain pedal while playing the piano. Guy wasn't sure why or how this was possible, but he could confirm that it wasn't a benefit gained from the RoK or the Church.</p>\n<p>Thanks to his current state, he could easily stitch together an intricate story as more content was being added to his repository. It was like each book in the Archive held a puzzle piece that could only be extracted by reading it to its entirety. With each piece obtained, a flourishing tapestry came into view.</p>\n<p>'So sects are a relatively new concept?' Guy exclaimed. 'Wait... 23000 years? That's not new at all!'</p>\n<p>Before sects came into the picture, hierarchical congregations of unaffiliated warriors, mages, mercenaries and their ilk were called Adventurers' Guild. According to a historical text - if it could be called that given the rampant use of speculative and exaggerated language - during the times of yore when the concepts of magic were still mystical and uncategorised, beings with the gift of magic often joined a union of some kind known as an Adventurers' Guild where they worked by practising their magical trade in the form of quests. Each Adventurers' Guild had a Guild Master who was often elected by members of the guild. They could be elected through a contest of strength or other talents such as management, connections or wealth. An Adventurers' Guild operated within a particular region, which was their de facto region of influence. New guilds could be formed under the umbrella of an existing guild or they could sprout off on their own. However, encroaching into the territories of other guilds generally ended in a conflict called a Guild War, at the culmination of which either the losing guild ceased to exist through total annihilation or assimilation into the winner.</p>\n<p>Guy found that these Adventurers' Guilds shared a lot of similarities with the ones he'd read of in a lot of fantasy novels in his past life. Their function and mode of operation were extremely similar. However, Guy noted that there was very little similarity between an Adventurers' Guild and a Sect apart from the fact that they were by definition, a congregation of mages. An Adventurers' Guild had a generally flat hierarchical structure. There was the Guild Master followed by a Vice-Guild Master or an Administrator, and then there were the rest of the members. The hierarchy amongst members was fluid and decided based on strength and fame. In a Sect, there were multiple layers of hierarchy, oftentimes to an exhausting degree. A Guild was not a place for disseminating and teaching magic to others. This was usually performed through Master-Disciple dynamics. However, a Sect was also an institute for learning that cultivated new members. Many such dissimilarities separated the Guilds of yore from the Sects of... yore. So that begged the question, how did these Adventurers' Guilds transform to become Sects?</p>\n<p>The text went further to paint a picture of this transition. Because of the arcane nature of magic, only those with talent, bloodline, physique, or the ability to view the world with a skewed point of view could manifest powers. Those that couldn't manifest magic naturally, could also learn it through a Master-Disiple relationship. The issue, though, was that a Master that learned magic through intuition would find it difficult to explain it to a Disciple. Only those disciples with the intelligence to interpret their \"genius\" Master's nonsense could succeed in this case. </p>\n<p>Over time, as the disciples became masters and cultivated disciples of their own, their structured method of magic became more and more refined, reaching a point where a large group of individuals all shared the same form of magic. In this case, it was illogical for this group to affiliate themselves with a loosely structured guild with a hodge-podge of other characters. They found it prudent to create a \"guild\" of their own that could act as a vehicle to train more mages like themselves.</p>\n<p>In some instances, other groups of similarly trained mages decided to form alliances amongst themselves to form a multi-faceted \"guild\". Once these new \"guilds\" entered the scene, they quickly took the old guilds by storm. For one, the appeal of being able to learn and improve WHILE earning swayed people towards these new \"guilds\" who turned to call themselves sects as it was a more fitting name for their collective. During this transformation, a lot of other changes happened alongside. For example, the dichotomy between mages who applied magic externally (outside the body) and warriors who worked their magics internally (inside their body) was erased altogether. Ultimately, magic was magic no matter how mana was being used.</p>\n<p>'It's not a wholly unbiased recounting, but it is sufficient. Besides, knowing the history of sects, in general, does little to aid my cause.' Guy concluded. 'I get what the guilds' purpose was in the past. They acted as protection against magical threats. But what function do Sects have nowadays?'</p>\n<p>Through further reading, Guy found out that a sect's purpose was also to offer protection against magical threats in its region, but with the government and clans catching up martially they had become somewhat redundant. The Cloudstrider Sect rarely initiated large-scale operations to eradicate hordes of dangerous magical beasts, or congregations of mages from an unorthodox magic practising sect.</p>\n<p>On a side note, sects operating within specific regions often congregated to form an alliance. In modern times, these regions were defined as the political boundaries between nations, and the sects within the boundaries sometimes even collaborated with the government. The alliance officially recognised and \"tolerated\" by the empire was designated as the orthodox sects. The sects that the government opposed vigorously, generally due to horrendous practices, were called unorthodox sects. To elaborate on that point, a bandit camp of regular mortals was just a regular bandit camp. However, if the leader of the camp was a mage with decently advanced cultivation, and if one or more members of the group were also mages, the bandit camp would become an unorthodox sect by definition. </p>\n<p>Nowadays, though, not many large and powerful unorthodox sects proliferated in the Solar Empire. That is because criminals associated with unorthodox sects were subject to heavy policing and scorched earth preventative measures employed by the government, clans and sects. The last true conflict that shook the entire region and motivated the orthodox alliance to make a move was the Plague of Dark Cleansing. The Cloudstrider Sect happened to play a key role in chasing Ziva out of the region. They would have killed him, if not for the intervention from the Blackstar Kingdom in the North. </p>\n<p>Now Ziva Lune operated his own sect in that region, which was incidentally classified as an orthodox sect in that area even though he practised magic involving a tonne of grotesque human experimentation. Although the Cloudstrider Sect couldn't impede into the region controlled by their neighbouring alliance, one of their current tasks revolved around tracking any unwelcome movement and invasions from their neighbours.</p>\n<p>Apart from that, the Cloudstrider Sect's general operation was wholly bland - they didn't even deign to undertake common escort missions and protection missions for merchant caravans and other clients like the less renowned sects. Maybe it was because of its age and heritage, but as Guy progressed through the records, he found that the sect became less and less adventurous in its activities. It had essentially devolved into an endless cycle of recruitment, tournaments and competitions, intermittent exploratory trips to quell the burgeoning population of dangerous beasts.</p>\n<p>However, the Sect had to propagate somehow. To that end, the Sect conducted mass recruitments every ten years, sparser than the less prominent sects in the orthodox alliance. The sects nowadays had three divisions: Outer, Inner and Core. The horde that entered the Sect would become part of the Outer Division, where they would have to compete against each other, to a brutal degree, to gain resources and advance in their cultivations. They wouldn't receive any support apart from perfunctory lectures explaining the base cultivation method. Only a measly 1% could get promoted to the Inner Division, at which point there was an even tougher competition to gain the recognition of a sect elder to become their Disciple. That would qualify them as Core Division members, automatically moving them to a track for an elder position of some kind in the future.</p>\n<p>As Guy finished a record describing the day-to-day occurrences in the Outer Division from the past year, his chest undulated with disgust.</p>\n<p>'They're being treated worse than animals!'</p>\n<p>An Outer Division disciple was basically a slave. They were treated with no dignity by the Inner and Core members. Even amongst themselves, they had no camaraderie since only those with grit and cunning could accumulate enough resources to advance. Those that couldn't advance were infinitely tethered to the Sect, forced to live the rest of their lives as indentured slaves with no prospects. Most of the Outer Division members would die due to the unforgiving environment.</p>\n<p>'They don't even have the decency to commemorate their names?'</p>\n<p>They were all numbers. A footnote on the ledger. Only Guy could see the blood oozing from the ink that dotted the decimal defining the percentage of Outer Division member \"turnover\". It reminded Guy of a horrendous hypothetical experiment he had heard of in his past life. Basically, a pot was filled with a myriad of highly venomous creatures and closed shut. The pot was left as-is for days on end. The critters stuck within were forced to fight amongst each other for survival, surviving against the venomous strikes of their fellow prisoners. After much time passed, the lid would be opened to reveal the single victor of the bloodsport, the critter with venom to surpass all venoms. This was how the Sect's Outer Division was being managed.</p>\n<p>'I cannot run my sect like this... Not in good conscience...' Guy reaffirmed.</p>\n<p>The Archives did not expand on the workings of the Outer Division beyond the basics. However, Guy could fill in the blanks by himself, much to his disgust.</p>\n<p>Coincidentally, another individual was gaining a clearer view of the true treatment of Outer Division sect members first-hand.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/57h3ivh8kbfqgyllt1785yd\">Chapter 173 - Exploring the Sect (Part One)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/9yv9lnjrzckmeiut9zptjeh\">Chapter 171 - Read, Reserve, Rinse, Repeat</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}