{"pageProps":{"note":{"id":"90oqcwgtybsbyrishusdcxp","title":"Chapter 222 - Setting off for the Capital","desc":"","updated":1662923612416,"created":1660325144814,"custom":{},"fname":"volume-3.chapter-222","type":"note","vault":{"fsPath":"vault"},"contentHash":"4f769f01b2639ab0dad133613f468c5f","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-222","id":"90oqcwgtybsbyrishusdcxp","vaultName":"vault"},"value":"volume-4.chapter-223","position":{"start":{"line":109,"column":3,"offset":11344},"end":{"line":109,"column":27,"offset":11368},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-223"}},{"from":{"fname":"volume-3.chapter-221","id":"1zgvr903x78yt73xx0t10o8","vaultName":"vault"},"type":"backlink","position":{"start":{"line":43,"column":3,"offset":11565},"end":{"line":43,"column":27,"offset":11589},"indent":[]},"value":"volume-3.chapter-222"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-222---setting-off-for-the-capital\">Chapter 222 - Setting off for the Capital<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-222---setting-off-for-the-capital\"></a></h1>\n<p>\"Looks magnificent, doesn't it?\" Guy expressed with evident pride as he stood facing the entire campus from the entrance to the True World Sect.</p>\n<p>\"Psht! It's extravagant,\" Grace blurted out instinctively from his side. There was a slight sense of discomfort present on her face as she followed Guy's gaze.</p>\n<p>\"It's necessary,\" Guy responded with a bitter smile. He could understand where her apprehension stemmed from. Even after living comfortably around budding and established mages for two years, she was finding it difficult to get over her ingrained stigma against them.</p>\n<p>Grace flinched to that response and said acquiescingly, \"... I know. It's... good.\"</p>\n<p>\"I like it,\" Markus affirmed, walking over from behind Guy. Kano, Dora and Jean followed, with Josie tagging along. The group were returning after a comfortable soak at the bustling public bath down in the village.</p>\n<p>\"I like the playground in the Community Centre,\" Kano added excitedly.</p>\n<p>This was one-upped by Dora who recited, \"Me too! Me too!\"</p>\n<p>\"I appreciate the upgrades to the garden,\" Jean expressed, though her stoic expression and monotonous voice did not support the emotion present in her statement.</p>\n<p>\"I'd like to share in that appreciation,\" Grace said with a smile while hugging Jean by her arm.</p>\n<p>\"It is adequate. I have seen better,\" Josie stated flatly, breaking the reverie hanging in the air. All heads turned to face the woman, who wore an unperturbed expression matching her mistress.</p>\n<p>\"Josie!\" Jean reprimanded hurriedly, her eyes flitting between her attendant and Guy with a faint hint of worry eking out.</p>\n<p>\"It's alright, Jean. I appreciate the honesty. I'm open to feedback and suggestions, please let me know if there is anything I can do,\" Guy spoke up with a wry chuckle. He would be lying if he admitted that his Sect was perfect. Most of the architecture was built using carved stones, compared to the Cloudstrider Sect which was wholly built of marble with resplendent structures. Of course, the Cloudstrider Sect could be set as the gold standard for sects in the Solar Empire, hence to that end Guy was sufficiently satisfied with how well his newly-formed Sect looked. Then again, Josie had probably seen better through her time serving in the Rasmus Clan.</p>\n<p>Josie cleared her throat, recognising her misspoken words and admitted, \"Young Miss will be a part of this Sect, of course, it will be this slave's responsibility to elevate its quality.\"</p>\n<p>\"What now?\" Markus interjected, trying to shift the stagnant and deflated atmosphere. Guy hummed in contemplation before explaining the next steps of the process.</p>\n<p>\"Well, we will be travelling to the Capital of the Solar Empire for the Solar Sect Alliance Conference to officially register our Sect and recruit a few members. We need at least fifteen members in the Sect including the Sect's Leader and Elders for it to be recognised as functioning. To qualify as an official member, the individual must be older than twelve years of age, so we cannot include Dora and Kano. Grace cannot cultivate, so although she is a part of the Sect she is recognised as an Auxiliary member. This means that including Marie and Mage Nara, there are only five people in our Sect at the moment. Unfortunately for us, there will only be three members joining us from the Village - not all parents want their child to grow up to be a mage which is admittedly a dangerous path to take. This means that we will be short of seven members. Although we can register under the Alliance, our state will be in limbo until we meet this requirement.\"</p>\n<p>After Guy finished, Grace was quick to point out the growing number of checkpoints on the road to set up a Sect. \"So many rules and regulations!\"</p>\n<p>After all, the whole fifteen-member quota was not part of the initial set of prerequisites she was informed of by Guy. To that, Guy sighed sympathetically and said, \"I can understand their point of view on this matter. Without all of these regulations in place, just about anyone can start a Sect. In doing so, it would attract conflict as Sects fight against each other for superiority. It would be a bloodbath. So, although some of the rules may seem excessive and others equally as pretentious, they are necessary... for the time being anyways.\"</p>\n<p>\"What's the travel itinerary, Master?\" Markus inquired.</p>\n<p>Guy scratched his chin while retrieving the plans from his memory. \"You, Jean and I will be travelling along with a Dune Caravan Management convoy to the capital. We will be functioning as the escorts, along with their own retinue and hired hands of course. For the record, treat this mission with utmost importance since there will be a few of Verum Trading Company's products included in the convoy.\"</p>\n<p>To stay faithful to the Sect's true purpose, Guy managed to snag a few escort positions in the monthly convoy that was managed by Dune Caravan Management which moved through key cities and trading points from Radiant City to the Capital. Usually, the company would hire escorts from the Whispering Dusk Sect - another first-rate sect like Cloudstrider in the Solar Empire - for protection. Though this time, following some negotiation between Furion and his father, three escort spots were acquired for the True World Sect which was still unaffiliated with the Solar Sect Alliance. Thanks to this, Guy and his students would have a more hassle-free travel to the Capital.</p>\n<p>At that moment, Dora suddenly leapt in front of Guy and exclaimed. \"I'm coming as well!\"</p>\n<p>\"Dora-\" Grace started to address the little girl before she was interrupted.</p>\n<p>\"Kano went to the city last time. You promised you'd take me there as well, but when the time came Mister Larks didn't fulfil that promise!\" Dora complained with a distressed pout, before adding, \"This time, I am coming along too! Oh, and Kano cannot come!\"</p>\n<p>Guy quirked one of his eyebrows and probed, \"Why can't Kano come?\"</p>\n<p>Dora cleared her throat and spoke with a serious frown, \"Because he already went once. We need to be fair in this matter.\"</p>\n<p>Guy had to physically hold back a chuckle as the girl's figure merged with that of a miniature lawyer. \"We... Let's discuss this with Matron Reva, okay?\"</p>\n<p>\"No! I'm going! I'm going, I'm going, I'm going!\" Dora shot back as she stomped her foot stubbornly. Guy could see that she was unwilling to budge.</p>\n<p>\"Dora!\" Grace intervened with a sharp tone. \"Stop throwing a tantrum. Just as Guy said, we will discuss this first.\"</p>\n<p>\"B-But-\" Pleaded with a shaking voice. The sudden stern voice of Grace had unnerved her.</p>\n<p>\"That's final!\" Grace reaffirmed, cutting the girl midway.</p>\n<p>Dora's eyes started to bubble over with tears. Her lips trembled as she tried to retort, but she ended up unable to form a proper response as her emotions burst forth. She screamed, \"I... I hate you!\" and ran away while rubbing her eyes and crying.</p>\n<p>\"Dora-\" Grace tried to follow the girl, her expression softening, but a hand suddenly reached forth and grabbed her by the shoulder. She turned and face Guy, who pursed his lips and shook his head. \"What? You're thinking of taking her along? This isn't Radiant City, it's the damn Capital! You're taking her into a den of vipers where danger lurks around every corner. You can't just ask me to stand aside?\"</p>\n<p>Guy exhaled loudly and pulled Grace away from the crowd, he didn't want their discussion to be misconstrued as disagreement amongst the kids. He then waited for Grace to calm herself and said, \"She was fair in her statement. If I don't take her with me, it would be considered showing favouritism to Kano.\"</p>\n<p>\"We let Kano go because it was an opportunity for him to grow his skills,\" Grace argued in response.</p>\n<p>\"That would still imply that we view Dora poorly just because she does not have any skills to make her stand out,\" Guy highlighted with a shrug. \"That's not a pleasant feeling. We will drive her further away.\"</p>\n<p>Guy's rational evaluation convinced Grace. She recognised that she was powerless in this issue. In fact, she could put her foot down and forbid Dora from leaving, but that would end up estranging Dora and souring their relationship. Besides, she did not want the girl to think that she valued Kano more than her.</p>\n<p>\"Thanks, by the way,\" Grace stated. \"I didn't miss how you took the so-called 'bad cop' role this time.\"</p>\n<p>\"Raising kids is a two-person job, after all,\" Guy joked with a mischievous grin, only to receive a light elbow to his ribs from Grace.</p>\n<p>\"I'll go find her and tell her that she can travel with you, ONLY if she sticks with you at all times. If she gets into any mischief, lock her up on a carriage or something until she gets back,\" Grace said gruffly as she walked away. But while retreating, a pleasant smile graced her face as she realised the joy of sharing one's burdens. Before Guy, she couldn't indulge the kids with their wants. This wasn't because she didn't want to, but rather she realised how powerless she was in being able to protect them should any danger befall them. But now, she could rely on Guy to handle those risky endeavours.</p>\n<p>'Just like a family,' Grace thought unwittingly. Yet the moment she caught such thoughts fleeting through her mind, an exuberant red hue washed her cheeks. 'What am I thinking!' Grace hurried her steps and started counting herbs mentally to avert her scandalous thoughts.</p>\n<hr>\n<p>Two days passed as the members of the True World Sect hustled to pack up their belongings for travel. The group leaving for the Capital now consisted of Guy, Markus, Jean and Dora. Of course, with Jean coming along, Josie was in tow as they were a package deal. At the crack of dawn on the third day, the quintet assembled at the entrance to the Sect, where a simple carriage awaited them. The cart was driven by Kannan Lane. The man volunteered to transport Guy and his posse to Wayward Town to express his gratitude and borrowed a simple cart from his employer to do so.</p>\n<p>\"Good morning Uncle Lane,\" Dora greeted as she hopped onto the cart with difficulty. The bag hanging over her shoulders inhibited her entry, so the girl removed it, tossed it in, and leapt on with a practised motion.</p>\n<p>\"Where are we going, young lady,\" Kannan said with a reverent tone to jest with Dora. Dora covered her mouth and giggled before responding with a haughty tone, \"To the capital, driver!\"</p>\n<p>As the rest alighted onto the carriage, driven by two horses, Guy turned to bid farewell to Grace, who was trying her hardest to suppress the tears from flowing out of her red eyes.</p>\n<p>\"We'll be back,\" Guy promised. \"Don't worry, I'll keep them safe.\"</p>\n<p>\"Keep yourself safe!\" Grace reminded. \"I want everyone to return in one piece.\"</p>\n<p>\"Bye Mister Larks,\" Kano said with tears on his face. He was a little disappointed that he couldn't travel to the Capital, but he understood that it wouldn't be fair to Dora.</p>\n<p>\"We'll go to the Capital again in the future, Kano. That time, I'll take both you and Dora along,\" Guy said before patting the boy on his shoulders.</p>\n<p>\"Take care, you two,\" Guy said one last time before stepping onto the carriage. He closed the door and gestured for Kannan to proceed.</p>\n<p>The wheels of the carriage jerked into motion, carrying the first members of the True World Sect to their first destination on their journey to the Capital.</p>\n<p>'And so, it begins,' Guy remarked internally. 'Let's see what the future holds!'</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/rmpqve0byab7ei0fayjttrr\">Chapter 223 - Darkness Dwelling in the Light</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/1zgvr903x78yt73xx0t10o8\">Chapter 221 - State of the True World Sect</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}