{"pageProps":{"note":{"id":"9fyqscdtc0jazuzzbaecmg0","title":"Chapter 355 - The Frivolous Four - The Fire (Part Two)","desc":"","updated":1693396229037,"created":1690539075774,"custom":{},"fname":"volume-5.chapter-355","type":"note","vault":{"fsPath":"vault"},"contentHash":"0f51dfbdd0754a342c99bc5bed019ac3","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-355","id":"9fyqscdtc0jazuzzbaecmg0","vaultName":"vault"},"value":"volume-5.chapter-356","position":{"start":{"line":109,"column":3,"offset":10590},"end":{"line":109,"column":27,"offset":10614},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-356"}},{"from":{"fname":"volume-5.chapter-354","id":"5cj9g2ginzmg94d6hlj6h32","vaultName":"vault"},"type":"backlink","position":{"start":{"line":103,"column":3,"offset":10768},"end":{"line":103,"column":27,"offset":10792},"indent":[]},"value":"volume-5.chapter-355"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-355---the-frivolous-four---the-fire-part-two\">Chapter 355 - The Frivolous Four - The Fire (Part Two)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-355---the-frivolous-four---the-fire-part-two\"></a></h1>\n<p>\"The recovery potions are ready, and Lacey and Casey are on standby,\" Kevan declared, his eyes firmly focused on Revian who was standing between two platforms with one hand holding a measuring cylinder filled with water with a cuboid mana crystal submerged in it, and his other palm covering the heating mana gem on the Caloric Tank.</p>\n<p>Revian nodded in response, \"I'll call out when I run out of mana. After two seconds, I will start drawing the mana from the mana crystal, and start the timer precisely when that happens. Keep your mana senses on me at all times, okay?\"</p>\n<p>After receiving an affirmative hum from Kevan, Revian removed both his hands and produced a spell circle above his head while holding his palms up. From its centre, a massive pillar of fire ejected towards the sky. The pillar lasted for around three seconds before he lowered his hands, panting heavily.</p>\n<p>\"I'm... depleted...\" Revian said while fighting the urge to collapse. \"It is... as we predicted... my mana... isn't replenishing... from the environment...\"</p>\n<p>\"Initial temperature: 24 degrees,\" Kevan called out as he wrote down the reading on the Tempera-Core affixed on the tank.</p>\n<p>Revian then placed his palm over the heating gem, and the other palm grasped the cylinder.</p>\n<p>\"Starting... now...\" Revian declared, just as Kevan started the Time-Core, which started to count up the seconds. Kevan honed in his mana senses and noticed the water level in the cylinder dropping slowly, implying that the cube within was being depleted by Revian as he pulled it in, siphoned it through his core and activated the small spell circle on his right hand which projected a transparent-blue flame. The flame in turn was siphoned into the mana gem next to it almost immediately.</p>\n<p>Revian was feeling completely exhausted, the utter depletion of mana from his core was affecting him in a way similar to how a person gets fatigued after exhausting all of their energy post-exercise. However, rather than his body being affected, it was actually his mind. He was feeling extremely sluggish and was constantly fighting to keep his consciousness awake so that he could produce the flame.</p>\n<p>In the meantime, he was also focusing on extracting the mana from the cuboid crystal and tracking its movement through his mana channels, through his core, and finally towards his spellcasting hand. This shouldn't have been so easy for a mere Mana Condensation realm mage, who was still lacking in awareness of the internal workings of their bodies. However, because of the scarcity of mana inside his body, the presence of the thin stream originating from the mana crystal was extremely easy to track and focus on.</p>\n<p>As the mana entered and exited his core, his mental strain diminished slightly, allowing him to think a bit more about what was happening inside him. After all, qualitative data was also key towards validating the experiment. Revian honed in on the movement of mana through his channels and focused especially on the part where the mana was converted into a flame. The spell they were using produced fire purely using mana, without any external fuel. This meant that at the point where his mana reached the spell circle, it split into three. One prong transmuted the mana into methane, the other transmuted it into oxygen gas, and the third (and narrowest prong) generated a light spark to activate the reaction.</p>\n<p>Revian observed how the spell circle intelligently rationed the prongs into the appropriate ratios so that the combustion reaction was complete and self-sustaining.</p>\n<p>At that moment, Revian heard a \"Pause!\" from Kevan, indicating that the mana crystal had been completely depleted and the Time-Core was stopped. This did not mean that Revian had to stop, though, since there was still mana coursing through him. So, Revian continued producing the blue flame, until he was fully depleted once again, at which point Casey and Lacey rushed in and poured a sour liquid down his throat.</p>\n<p>\"Final temperature: 61 degrees,\" Kevan read out. \"How are you feeling?\"</p>\n<p>\"I'm winded. Give me... a minute,\" Revian said between breaths. \"That was not pleasant at all! What's the result?\"</p>\n<p>\"Too early to tell, we need to do a few more trials,\" Kevan reminded. \"Let me know when you are ready and we can repeat the trial with the same volume of mana.\"</p>\n<p>\"Man, this is going to be a hoot,\" Revian groaned as he lay on his back on the soft grass. He waited as his breath finally started to stabilise, stood up, and said, \"Alright, next trial!\"</p>\n<p>And so, the process repeated itself, with Revian expending his mana, and siphoning the mana from the same 125 cubic-centimetre cuboid of mana to fuel a transparent-blue flame which was heating the fluid inside the Caloric Tank. At the end of this experiment, Revian was once again completely expended, on his back, on the soft grass.</p>\n<p>\"Alright, one more trial for the day before we finish,\" Kevan called out.</p>\n<p>Revian collected himself once again and proceeded to go through the gruelling process another time.</p>\n<p>\"Alright, time to pack up,\" Kevan declared.</p>\n<p>\"I think I can go for another round of three with the next volume of mana?\" Revian stated contemplatively.</p>\n<p>\"No can do!\" Casey denied decisively. \"You heard what Mage Nara said. As long as we stick to the letter of our safety procedures, our experiment will not fail. Our procedures state that we will only do three trials a day, so get your ass up and onto my back right now before I physically drag you over to the infirmary!\"</p>\n<p>\"I'm fine, you don't need to carry me,\" Revian mumbled.</p>\n<p>\"Did you not hear what she said?\" Lacey reprimanded. \"We are going to carry you to the infirmary, and that's the last we will hear about this.\"</p>\n<p>Revian cursed his stupid mind for penning down that line in the safety procedures and decided to fake unconsciousness as soon as they entered the Sect grounds to avoid the embarrassment of being seen carried by the girls.</p>\n<hr>\n<p>This exercise repeated itself the next day. The quartet were led to the meadow by Senior Brother Markus (without Dora this time). The day's trial was with an 8 cubic centimetre of mana crystal.</p>\n<p>Revian had made a complete recovery after the previous day's exhaustion and prepared himself for the three trials. This time, he made it a point to be more aware of what was happening inside his body as the mana flowed from the crystal to his core to the spell. He realised that the qualitative data from the previous day was not descriptive enough, which made it tougher to derive meaning from it (if there happened to be any).</p>\n<p>His attention honed in as the solid mana from the crystal turned semi-liquid-semi-gaseous and entered through the openings in his palm. It flowed through his channels in a somewhat liquid state, based on the fact that there was no indication of significant compression which was characteristic of a gas. The purpose of timing the depletion of mana from the water-filled cylinder was to determine the flow rate of mana as it moved through the system.</p>\n<p>The experiment was basically as follows. The group would measure the rate at which mana was being depleted, which would translate into the flow rate or consumption rate of mana. They would then compare the consumption against the added energy which raises the temperature of the fluid inside the Caloric Tank. They would conduct three sets of three trials, with three different volumes of mana crystals (8, 125, 512 cubic centimetres). Graphing the consumption against energy change should indicate how much mana it takes to keep the spell running. They would then repeat the three sets of three but with a pulsing process. That is, the spell would be activated and deactivated in regular intervals, and the energy change with this method would be compared against the previous experiment to see if continuous activation has a different consumption pattern (constant or compounding).</p>\n<p>This experiment would then be repeated with two more people, to see if there is a difference in the results and conclusions.</p>\n<p>If everything was successful, then in the future, the consumption of mana would be standardised by using this simple fire-starter spell as a baseline. But that was still ways away from being achieved, as it relied on the experiment running smoothly.</p>\n<p>In fact, Revian started to notice something weird in his mana senses by the time it came to the eighth trial (the second trial of the third set).</p>\n<p>\"Umm, guys...?\" Revian mumbled. Something flashed in his mana senses as it encompassed the depleting mana crystal in the cylinder, which caused his concentration to destabilise. Suddenly, the mana that he was circulating from one hand to the other through his core turned turbulent and shifted direction towards his eyes. For a split second, Revian saw a set of numbers pop up above the deformed cube before he lost consciousness.</p>\n<hr>\n<p>By the time he woke up, he realised that he was no longer in the meadow and was now in the infirmary. The smell of medicinal plants was strong here, and so was the kick from the stench of disinfectant. His attention was then drawn to the muffled argument occurring outside the room.</p>\n<p>\"I told you guys to follow the procedures!\" It was Senior Brother Markus' voice. \"What went wrong?\"</p>\n<p>\"We don't know,\" Kevan mumbled with a confused tone. \"It was all going well when he just lost consciousness.\"</p>\n<p>\"There has- Wait!\" The door slid open and a concerned Markus stepped in.</p>\n<p>\"It is good that you're awake,\" he evoked. \"How are you feeling?\"</p>\n<p>\"I'm feeling... fine, actually,\" Revian responded. \"Better than fine!\"</p>\n<p>Markus gave him a stern scowl and asked, \"What happened?\"</p>\n<p>\"I don't know,\" Revian responded while scratching his chin in thought. \"I was just observing the mana crystal to jot down qualitative data, when suddenly-\"</p>\n<p>Revian's gaze dipped to his abdomen and he froze mid-sentence.</p>\n<p>\"Suddenly, what?\" Markus asked, following Revian's gaze.</p>\n<p>\"Umm, are you guys seeing this?\" Revian asked as he rubbed his eyes.</p>\n<p>\"Seeing what?\" Kevan probed.</p>\n<p>\"Numbers,\" Revian clarified. \"Woah! When I use my mana senses to observe my abdomen, I see numbers - more like a fraction. It says 136/213\"</p>\n<p>\"I don't see anything...\" Markus muttered while rubbing his forehead in thought.</p>\n<p>\"W-What could this mean?\" Revian asked out loud, exchanging gazes between all those present.</p>\n<p>\"Well,\" Markus commented, breaking the silence, \"It seems that your experiment has caused you to stumble upon something interesting.\"</p>\n<p>He looked back at Kevan, Casey and Lacey, flashed an intrigued smile, and said, \"You may have to take a detour with your experiment.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/0cb7isafzyiy8rvyhhbo6r0\">Chapter 356 - The Frivolous Four - The Roaring Blaze (Part One)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/5cj9g2ginzmg94d6hlj6h32\">Chapter 354 - The Frivolous Four - The Fire (Part One)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}