{"pageProps":{"note":{"id":"9s1t5atn6dpj7xcy0oo3jxg","title":"Chapter 400 - Ms. Understood","desc":"","updated":1705471413334,"created":1700676333990,"custom":{},"fname":"volume-5.chapter-400","type":"note","vault":{"fsPath":"vault"},"contentHash":"284e4426c3c4939b0c265c3bce65f881","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-400","id":"9s1t5atn6dpj7xcy0oo3jxg","vaultName":"vault"},"value":"volume-5.chapter-401","position":{"start":{"line":137,"column":3,"offset":11830},"end":{"line":137,"column":27,"offset":11854},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-401"}},{"from":{"fname":"volume-5.chapter-399","id":"h1gr3sptcuk4hzu7ntu31vb","vaultName":"vault"},"type":"backlink","position":{"start":{"line":117,"column":3,"offset":10681},"end":{"line":117,"column":27,"offset":10705},"indent":[]},"value":"volume-5.chapter-400"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-400---ms-understood\">Chapter 400 - Ms. Understood<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-400---ms-understood\"></a></h1>\n<p>A sombre gathering formed in a meeting room inside the Sect's clinic building. All the core members of the Sect when it was first established - the Sect Leader, Elder Nara, Markus, Marie, Jean and Matron Reva - were present.</p>\n<p>\"Marie! In the middle, now!\" The Sect Leader growled, causing the targetted girl to flinch in surprise. She had never heard the Sect Leader speak with such an incensed voice. There was a silent anger in there that unnerved her usual cool demeanour. She slowly got up and walked towards the chair in the middle of the U-shaped table. She shifted uncomfortably as the Sect Leader drilled into her.</p>\n<p>\"Did you know about Shuri's condition?\"</p>\n<p>\"Wha-\"</p>\n<p>\"DID YOU KNOW?\" The Sect Leader cut Marie while slapping the wooden table audibly.</p>\n<p>\"I-I did,\" Marie answered hastily.</p>\n<p>\"And you opted not to tell me, why?\" He responded icily.</p>\n<p>\"W-Well I foresaw that it would work itself out-\"</p>\n<p>\"Work itself out in what way?!\" The Sect Leader cut in again. \"Tell me everything you know, and leave out no detail. I don't want any more surprises, got it?\"</p>\n<p>Marie swallowed a dry gulp of air and started speaking with a slow and steady voice, \"She was supposed to die, but I orchestrated the event so that Markus would end up saving her and would rope her into the Sect.\"</p>\n<p>\"Why?\"</p>\n<p>\"Why, what? Why did I save her? Or why did I want to rope her into our Sect?\" Marie probed, though it was met with only silence from the Sect Leader. \"I saved her because I wanted her in the Sect. Shuri is special, I'm sure you've already seen that. Her skills and her past place her in a very unique position which I think will be extremely beneficial for the Sect.\"</p>\n<p>\"Look, Marie,\" the Sect Leader said with a tired sigh as his stern expression loosened slightly. \"The problem isn't in saving Shuri, but what comes after. I'm sure that when you chose to save her, you also saw her past and glimpsed into her future. So if anyone knew Shuri better than herself when she joined the Sect, it would have to be you. I just don't understand why you didn't think it necessary to share the fact that she was going through such a difficult situation psychologically. If I had known earlier, I could have taken steps to stop what just happened from occurring. Do you even know what she is going through?\"</p>\n<p>\"I didn't see this,\" Marie admitted. \"I sort of skipped a bit ahead, and things looked quite green there.\"</p>\n<p>The Sect Leader looked past Marie and gazed at her Master, who was also wearing a thoughtful frown. \"Could you explain to your Disciple what Shuri is experiencing right now?\"</p>\n<p>Elder Nara hummed affirmatively before saying, \"The transition from Foundation Establishment to the Core Formation realm is first initiated by a sudden increase in the density of the mana core. To achieve this, the world shoves a large quantity of mana into the core. It is supposed to be a painful process - extremely so - however, the process of apotheosis circumvents this pain as the physical form is held in a non-solid (immaterial) state while it is being reinvented and rebuilt. By the time apotheosis finishes, the mana core reaches its critical density, thus completing the transition between realms. However, since Shuri couldn't initiate apotheosis, the mana core's condensation was preempted prematurely, meaning that if ever he uses mana from his core he will experience immeasurable pain.\"</p>\n<p>\"She,\" Sect Leader Larks corrected.</p>\n<p>\"Eh?\" Elder Nara blurted out.</p>\n<p>\"Shuri is a she. You called her a 'he',\" Sect Leader Larks expounded.</p>\n<p>\"But the kid is a boy,\" Elder Nara reasoned with a confused tone. \"Why would I refer to him as a 'she'.\"</p>\n<p>\"It is because she identifies as a girl, a female,\" Sect Leader Larks explained.</p>\n<p>\"So?\" Elder Nara asked with even more confusion. \"Even if he claims to be a girl, he isn't a girl. He's clearly a boy.\"</p>\n<p>There was silence in the room, with only the dull sound of the Sect Leader tapping his fingers together echoing periodically.</p>\n<p>\"If she succeeded in her apotheosis, and solidified her biological sex as a female, would she be a girl?\" Sect Leader Larks asked.</p>\n<p>\"Well, yes.\"</p>\n<p>\"But she didn't succeed even though she really wanted to be identified as a girl,\" the Sect Leader highlighted.</p>\n<p>\"Of course! It's because it is in contrast to her true nature,\" Elder Nara affirmed.</p>\n<p>\"But dragons can take on human form after apotheosis. So can a lot of other magical creatures. How is that possible?\"</p>\n<p>Elder Nara contemplated on that question. After a few seconds, the Sect Leader followed up by saying, \"So a transition between species is acceptable, but not between sexes within the same species?\"</p>\n<p>\"What are you trying to say?\" Elder Nara said while letting out a frustrated breath.</p>\n<p>\"That one's identity is tethered to one's perception of reality, just like their cultivation. Shuri's reality dictates that her sexual identity is female, even though she is biologically male. It isn't just a whimsical thought, like a phase that will pass eventually. It is her fact. We should respect that,\" the Sect Leader stated seriously.</p>\n<p>\"I don't get it... So the boy is a girl and I should refer to him as one?\" Elder Nara said with a scoff.</p>\n<p>\"If you can call a dragon transformed into a human as a human, then you can call a boy who hasn't yet transitioned into a girl but wishes to do so, as a girl as well,\" Sect Leader Larks declared.</p>\n<p>\"I don't see the relation,\" Elder Nara mumbled, but the gathering ignored his words and moved on.</p>\n<p>\"Look, if you know that someone is suffering from an illness, be it physical or psychological, it is your duty to bring it up with those that can help them through it,\" the Sect Leader pointed out.</p>\n<p>\"But this wasn't my secret to share,\" Marie argued. \"I couldn't reveal it if Shuri didn't want it to be known.\"</p>\n<p>\"It doesn't apply to cases when someone is going to potentially cause harm to themselves or others,\" Sect Leader Larks corrected. \"Look at what happened to Shuri. Because we couldn't address her mental blocks earlier, she now has to suffer with excruciating pain while teetering part ways between Foundation Establishment and Core Formation realm, until she can finally complete her advancement.\"</p>\n<p>Marie looked down guiltily. \"So what do we do?\"</p>\n<p>\"Shuri needs to come to terms with his gender,\" Elder Nara commented. \"Once he can get the confusion out of his head that he is a girl, then it should work out.\"</p>\n<p>\"Why does she need to do that?\" Marie challenged. \"What's so wrong in being a girl?\"</p>\n<p>\"There's nothing wrong in being a girl. But the fact of the matter is that Shuri isn't! Why is this so hard to understand?\" Elder Nara grumbled in exhaustion. \"He is just confused after living such a clandestine life for so long since his birth.\"</p>\n<p>\"That's not fair,\" Marie responded with a mildly hurt expression on her face. \"Just because someone doesn't conform to what is normal, doesn't mean that they are confused.\"</p>\n<p>\"What IS normal anyway?\" Sect Leader Larks said while chiming in. \"If by normal, you are referring to what is average, then sure, we can say that what Shuri is experiencing is not normal. It doesn't make it wrong, right? Is the fact that she finds herself relating more with the female sex causing harm to anyone else?\"</p>\n<p>\"Why is everyone making a mountain out of a molehill here?\" Elder Nara stated. \"By normal, I mean what is the usual and socially acceptable. It isn't about what is average and what isn't. You guys, I'm just making a factual statement.\"</p>\n<p>\"But these factual statements are steeped in contradictions,\" Sect Leader Larks pointed out. \"Someone born with a special physique or bloodline is considered not normal, but they are viewed in a positive light. Why is this case any different?\"</p>\n<p>\"Because a special physique or bloodline benefits the holder, what Shuri is experiencing is only harming him,\" Elder Nara refuted.</p>\n<p>\"Having a special physique or bloodline puts people at greater risk. Furthermore, certain physiques or bloodlines force limitations on people in return for benefits. What of that then?\" Marie argued.</p>\n<p>\"Why are you arguing with me here when I'm trying to help you out?\" Elder Nara responded weakly.</p>\n<p>\"It's because by your definition, Marie would also be abnormal,\" Matron Reva said finally. \"She is not attracted to men, rather she finds herself attracted to women.\"</p>\n<p>\"What of it? I already knew about it before I took her in as my Disciple,\" Elder Nara said dismissively.</p>\n<p>\"So it isn't a line that you draw that separates what you think is socially acceptable and what isn't, it is actually a circle - a circle around anyone who strongly believes that they were born the wrong sex and wish to change their assigned sex,\" Marie concluded. \"What Shuri is feeling isn't a mental illness. She is perfectly sane and able to make sane decisions just like you and I. The only difference is that her mind doesn't agree with her body. Is that so wrong?\"</p>\n<p>Elder Nara gazed deeply into Marie's eyes which oozed with pain and empathy. Although he didn't understand the situation, he realised that his support meant a lot to his Disciple.</p>\n<p>\"Well, this is out of my wheelhouse then. I've made clear what Shuri is going through and what needs to be done to get... her... out of it. But since the pathway I've suggested isn't feasible, we need to come up with an alternative.\"</p>\n<p>Elder Nara didn't miss the hopeful smile that flashed past his Disciple's face as he made this claim.</p>\n<p>\"As Elder Nara has pointed out, the key is to get Shuri to become comfortable with herself first,\" Sect Larks reiterated. \"To achieve that, I think we need to put her through a procedure to change her sex.\"</p>\n<p>As he said this he turned to face Jean who bumbled around in confusion, \"Why are you looking at me? I don't know anything about this.\"</p>\n<p>\"Well, you are our foremost expert in anything medical. I can only rely on you to come up with an idea for this,\" Sect Leader Larks admitted with a bitter smile.</p>\n<p>\"I'm not even sure if pursuing this topic will be possible for me. You know the oath I have taken to \"first do no harm\". What certainty is there that whatever I will put Shuri through won't harm her?\" Jean challenged.</p>\n<p>\"It's all about managing the hormone levels, and organ transplantation,\" Sect Leader Larks summarised roughly.</p>\n<p>\"You want me to mess with the hormonal balance of a person?\" Jean blurted out in a burst of anger. \"You're asking someone who has lived a majority of her life never experiencing the dopamine high of eating chocolate, to mess with someone else's hormone levels?!\"</p>\n<p>\"Look, calm down. Don't rush to judgements quickly before doing your research. We aren't doing anything life-altering. We just need to provide Shuri with the impetus to take her advancement over the current hump. After that, she can handle the rest,\" Sect Leader Larks said assuagingly.</p>\n<p>\"I'll see what I can do,\" Jean said apprehensively. \"But for the record, I am not comfortable with this at all.\"</p>\n<p>\"You've been silent through all of this, what do you have to say, Senior Brother Markus?\" Jean nudged the stoic boy beside her.</p>\n<p>Markus shook his head and let out a long exhale through his nose. \"Now that I know the whole story about her past, it kind of gives you perspective on the way she behaves. She always came across as distrustful and paranoid to me. But she didn't have the ambition that usually came along with those traits. She was risk-averse and selfish, choosing to put herself above others. Even in Chess, she would go for heavily sacrificial plays that put her in a better position in the long run.\"</p>\n<p>A sombre silence prevailed in the room as Markus explained his thoughts.</p>\n<p>\"And while she was struggling so much on the outside, she was also fighting with her own sense of self on the inside...\" Markus wiped his eyes preemptively as a thin layer of water started to form along his lids. \"I wish I had known earlier...\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/uwrio68hcmz572rk46qlg4i\">Chapter 401 - Crumbling Reality</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/h1gr3sptcuk4hzu7ntu31vb\">Chapter 399 - What are You?</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}