{"pageProps":{"note":{"id":"9yv9lnjrzckmeiut9zptjeh","title":"Chapter 171 - Read, Reserve, Rinse, Repeat","desc":"","updated":1652032486965,"created":1650194200375,"custom":{},"fname":"volume-3.chapter-171","type":"note","vault":{"fsPath":"vault"},"contentHash":"820dde7715f454d22a33e2c040e63785","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-171","id":"9yv9lnjrzckmeiut9zptjeh","vaultName":"vault"},"value":"volume-3.chapter-172","position":{"start":{"line":93,"column":3,"offset":11100},"end":{"line":93,"column":27,"offset":11124},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-172"}},{"from":{"fname":"volume-3.chapter-170","id":"grk850cf2fjrhws2v0jbfwe","vaultName":"vault"},"type":"backlink","position":{"start":{"line":113,"column":3,"offset":10665},"end":{"line":113,"column":27,"offset":10689},"indent":[]},"value":"volume-3.chapter-171"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-171---read-reserve-rinse-repeat\">Chapter 171 - Read, Reserve, Rinse, Repeat<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-171---read-reserve-rinse-repeat\"></a></h1>\n<p>Guy and Markus followed the bald figure leading them through the alleys within the sect as it weaved through the carved out floating mountain. However, rather than observing the intricate architecture and beautiful structures around them, the Master and Disciple were wholly enraptured by the reflective, semi-spherical surface bobbing up and down in front of them.</p>\n<p>\"He's definitely in the Core Formation realm. I can't gauge his cultivation,\" Guy explained in a low whisper.</p>\n<p>\"But then why is he bald?\" Markus retorted in disbelief in an equally hushed tone.</p>\n<p>\"I don't know, why don't you ask him?\"</p>\n<p>\"Me? W-Why?\"</p>\n<p>\"You were the one who pointed it out,\" Guy scoffed back. \"I didn't care one bit about it. But now that it's been brought to my attention I just CAN'T ignore it.\"</p>\n<p>\"I can hear you, you know...\" An exasperated voice spoke up as the man leading them came to a sudden halt. He then turned abruptly and faced the gossiping duo with a deathly glare.</p>\n<p>\"We don't mean any offence,\" Guy acted immediately. He regretted entertaining his Disciple in this jest. After living in a comfortable setting, the boy had clearly lost his instinct toward danger and had landed both of them in a treacherous situation.</p>\n<p>\"We are just curious. After advancing into the Core Formation realm, I believe you have the opportunity to reforge your body to your liking. Was it a conscious decision to go with a...\" Guy lightly waved his finger in the direction of the man's exposed head.</p>\n<p>\"Mas- I mean Mage Larks,\" Markus chimed in hurriedly. \"It is probably in pursuit of optimisation. Hair just gets everywhere, it blocks your vision, hampers your speed, and is also prone to get tugged during a fight. Going clean-shaven is obviously a tactical choice.\"</p>\n<p>Markus flashed an impressed thumbs-up at the bald mage, who was trembling visibly at this point due to either embarrassment or fury.</p>\n<p>\"Of course!\" Guy volleyed with a dazzled expression. \"Hair is just a hindrance. You were moulding your body to match the optimal human form, which is of course hairless.\"</p>\n<p>\"Why is it that everyone has a problem with my baldness when no one even questions why Elder Glista and Teacher Jeeves choose to not regress their age and assume an older form?\" The man said with a defeated exhale.</p>\n<p>With a raised volume, he continued, \"The men of my family suffer from early-onset baldness. By the time I reached sixteen years of age, I had already lost all of my hair..\"</p>\n<p>Guy and Markus leaned forward as the man paused in suspense. He glared at the two one last time before speaking with a hushed tone in embarrassment, \"When it came time to reforge my body at the stepping off point into Core Formation, I... I couldn't even imagine what I would look like with my hair. My father didn't have any hair, and neither did my grandfathers on both my mother's and father's side... Every image that formed in my mind looked just so... awkward. I couldn't revert to my fifteen-year-old form... I had no other option...\"</p>\n<p>\"I... apologise for making you recollect those unpleasant memories,\" Guy consoled the slouching man.</p>\n<p>\"We were being inconsiderate,\" Markus added.</p>\n<p>The man's dreary eyes gained some colour upon hearing the duo's apology. Actually, this wasn't his first time receiving criticism about his unusually barren scalp. After all, it was highly unusual to see a mage in the Core Formation realm \"opting\" to go with such an... unflattering stylistic choice when it was completely possible to become the best version of themselves. But the thing was, he could never imagine himself with hair. Maybe it was a curse that plagued his family for generations upon generations that had even seeped into his mentality and warped his image of self. Since a young age, he had been egged and bullied by his peers for his affliction, which was further worsened when his physical reforging of the self left his already sparkling scalp a lot more lustrous.</p>\n<p>After a while, he had become numb. However, when the two guests following him pointed out his only weakness, his suppressed frustrations started to boil over. They were weaker than him, how dare they make fun of him? He was on the verge of breaking out and teaching them a lesson they wouldn't forget, even if they were guests of Elder Glista.</p>\n<p>But, they apologised. It wasn't half-hearted - seething with disdain coated with a facade of sincerity. No, it was pure and from the heart. They didn't intend to offend him and they meant it.</p>\n<p>The man coughed lightly and scratched his smooth head, \"It's fine. I've gotten used to it.\"</p>\n<p>\"Anyways, we have arrived at the Archives.\"</p>\n<p>The man turned around and pointed at the door before him. They were currently well inside the mountain, probably someplace close to its core. The Archive wasn't a building, it was an excavated quarter, with a single entrance which was the large ingress in front of the group. The man approached the doors and placed a token from inside his cloak into a circular slot. The token lit up with a faint blue glow, which started to extend outwards extending into an intricate geometric pattern all across the large stone doors. With a booming growl, the doors slid inwards revealing a set of steps leading further into the mountain.</p>\n<p>\"Only one of you can enter,\" the man emphasised. \"Gaining access to the Archives is a privilege, not one that is offered to outsiders such as yourselves. Even within the Sect, only those with years of service and achievements in their belts and with recognition from the Elders have access to these Archives. Even though the Archives do not hold any sensitive grimoires or manuals, they hold intimate information about the history of our Sect. Therefore, you only have six hours to peruse whatever you like in there. When the time is elapsed, you will be immediately ejected from the Archives by the formations within.\"</p>\n<p>\"I will be entering,\" Guy said. \"While I am in there, can Student Reva here observe the rest of the Sect?\"</p>\n<p>\"The tokens given to you by Elder Glista give you full access to most locations in the Sect,\" the man replied with a nod. \"The token with respond negatively if a location is off-limits. Do not fight against it. Even Elder Glista cannot save you if you get into trouble.\"</p>\n<p>And with that established, the Master and Disciple split into their assigned tasks.</p>\n<hr>\n<p>\"Six hours should be more than enough,\" Guy said out loud with palpable excitement. Although his mental faculties had risen after his advancement, they weren't exceedingly beyond human limits. He could memorise more content verbatim than before, but the increase was somewhere between 200% to 300% of his initial capacity. His processing speed also rose by a similar amount, however all that should not be enough for him to internalise the mountain of books stored inside the Archive.</p>\n<p>Clearly, the Sect had a very rich history since there were rows upon rows of shelves each stacked full of similarly bound books. Although there was a sizeable amount in total, there weren't as many as the number of books available in the accessible section of the library at the Radiant Academy.</p>\n<p>However, Guy had an advantage that others in his position lacked. 'Maybe except Jo Way...'</p>\n<p>That's right, the RoK!</p>\n<p>Guy's growing smile faltered as he recollected the sudden lack of a certain entity in that arcane compartment of his soul.</p>\n<p>'It's fine. The RoK works exactly as it used to, with or without him...'</p>\n<p>After cleansing his mind of all distracting thoughts, Guy got down to scanning through the books once again. Compared to his time in the Academy's library, there was a tighter time crunch that inhibited him from properly absorbing the content he was reading. Instead, Guy applied his speed-reading techniques to go through the book.</p>\n<p>Speed-reading was a skill Guy was thoroughly intimated with from his past life. He hadn't applied it much in this iteration since it wasn't necessary. And Guy was not fond of using that skill since it greatly detracted from the enjoyment of completing a book at a leisurely pace.</p>\n<p>There were many elements involved in becoming an effective speed-reader. The first was achieving a steady reading pace. Oftentimes, the thing that slowed people down the most is when they lost track of where they were on a page, especially when reaching a line break. Following text simply with the eye wasn't always tractable, it was also easy to get distracted when doing this. Guy tackled this problem by following the text with his index finger, just like how he taught Kano. The finger moved at a swift yet steady pace across the page like a typewriter.</p>\n<p>Another folly committed by novice readers was in repeating the content being read in their minds using their \"inner voice\". It is a common habit that, while allowing the reader to create a vibrant tapestry of voices and characters in their mind space, significantly hampers the reading rate. This took some time for Guy to suppress, but through repeated practice Guy learned how to shut down the voice orating the read content in his head.</p>\n<p>In addition to this, Guy learned that reading can be optimised if time isn't being wasted in moving the pupils sideways to track the read text. Usually, when humans read a text of any kind, their pupils jerk between the ends of the sentence which is not efficient. Instead, by training the peripheral vision to absorb text at the start and end of a line while keeping the gaze affixed to the centre of the line, one can increase their reading speed.</p>\n<p>Through repeated practice, Guy optimised his speed reading skills. Some minor techniques he developed through this process include reading phrases as opposed to words, phasing out his retention when reading articles ('a', 'an', 'it', etc.) and unimportant parts of speech, and only grasping at keywords and using intuition to fill in the blanks. All in all, Guy had trained himself into a speed reading demon.</p>\n<p>After arriving in this world, Guy did give it a try and was pleasantly surprised to find that the process had become a lot easier. Thanks to the mana sense, he could now see EVERYTHING on a page without having to move his eyes. Thanks to his improved mental faculties and physique, he could scan through the text and flip pages at inhuman speeds. Although he wasn't internalising the content as well as if he were reading it thoroughly, it was sufficient to replicate the book inside the RoK.</p>\n<p>Within a minute, Guy had already picked up and put back a book which was at least an inch thick. Through a rough calculation, he was reading at around 160000 words per minute, which was at least double the world record for speed reading back on Earth!</p>\n<p>Guy's eyes roamed over the shelves once again as his brain ran a few more arithmetic operations. \"I should be able to complete 93% of the books in here. I should prioritise records on Sect operation, events and expenditures. I should leave the miscellaneous records till the end if I have time.\"</p>\n<p>He then cracked his knuckles and stiff neck before approaching the next book on the row of his current bookshelf and resumed his exercise in tedium.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/8zsx6p1thfgitg6e7vyz40e\">Chapter 172 - Sects of the Past, Present... and Future?</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/grk850cf2fjrhws2v0jbfwe\">Chapter 170 - No Questions Asked</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}