{"pageProps":{"note":{"id":"aG2TZ00SzcR9vkxupvSkf","title":"Chapter 122 - Moving On","desc":"","updated":1643657610741,"created":1643655616554,"custom":{},"fname":"volume-2.chapter-122","type":"note","vault":{"fsPath":"vault"},"contentHash":"21d73f8d47287ba2c894a4e0e19db5ef","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-122","id":"aG2TZ00SzcR9vkxupvSkf","vaultName":"vault"},"value":"volume-2.chapter-123","position":{"start":{"line":137,"column":3,"offset":13247},"end":{"line":137,"column":27,"offset":13271},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-123"}},{"from":{"fname":"volume-2.chapter-121","id":"Y1GTg6xDHoU4TtGRNFqba","vaultName":"vault"},"type":"backlink","position":{"start":{"line":117,"column":3,"offset":10185},"end":{"line":117,"column":27,"offset":10209},"indent":[]},"value":"volume-2.chapter-122"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-122---moving-on\">Chapter 122 - Moving On<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-122---moving-on\"></a></h1>\n<p>\"I've been meaning to ask, it's about Jean,\" Guy asked Goran.</p>\n<p>\"Is it about her... demeanour? I apologise on her behalf, Teacher Larks,\" Goran immediately proclaimed his remorse without hesitation.</p>\n<p>\"Why are you apologising?\"</p>\n<p>\"I'm mostly at fault for why she is like this,\" Goran said, drooping his head in dejection.</p>\n<p>Guy could feel the weight in Goran's voice, so he immediately led him into his room and shut the door.</p>\n<p>\"Take a seat please,\" Guy said casually. Of course, there weren't any \"seats\" available in his room. But Goran understood nonetheless and presumed a seated position next to the low table at the centre, right in front of Guy's folded sleeping mattress. Guy followed Goran and sat opposite him.</p>\n<p>\"If you don't mind, I would like to hear the full story,\" Guy enunciated in a calm and low tone.</p>\n<p>Goran wore a stiff expression, as he pondered over how to begin. It wasn't that he was unwilling to reveal his daughter's condition or his past. After all, Teacher Larks WAS her daughter's sole instructor. He literally held her future in his hands, and it would be inadvisable to not be forthright with the man, lest it results in some unwanted consequences down the line.</p>\n<p>\"My wife died when Jean was five years old,\" Goran started. \"She died in front of her. And it wasn't a pleasant sight, Teacher Larks- No! Far from it!\"</p>\n<p>Goran pulled back his outburst of emotions and said, \"She was just a little girl back then - Jean. It really affected her...\"</p>\n<p>\"Would you please elaborate?\"</p>\n<p>\"I don't know what it was, but her emotions just went haywire. One minute she would be fine, but the next she would devolve into a destructive spiral. She was a danger to herself and the people around her. Cursing, flailing, flinging items, breaking things, banging her head against the wall, crying...\" as Goran kept on listing Jean's past behaviours, his face started to contort in distress. \"The first time a nanny tried to stop her, she bit down on her hand. Ever since then, it was either myself or Josie who would tend to her when she entered such a state.\"</p>\n<p>\"Can you explain how she would get triggered?\"</p>\n<p>\"I didn't know it back then. I always thought that her fragile psyche had truly perished and turned her mad. It was this misplaced assumption of mine that led me to proceed with the treatment that left her like this - an emotionless shell,\" Goran skirted the question with a self-blaming tirade. \"I should have taken the time to hear her out. If only I had done that, instead of listening to others...\"</p>\n<p>\"What was it that triggered her?\" Guy asked again with a little force in his voice.</p>\n<p>\"It was herself! She blamed herself for Nyla's death. I don't know what gave her that idea? Both Nyla and I kept telling her that her mother's occupation was one fraught with peril...\" Goran answered.</p>\n<p>\"Why would she blame herself?\"</p>\n<p>\"Apparently, Nyla got caught up in trying to isolate Jean which resulted in her getting contaminated with the plague instead.\"</p>\n<p>Guy hummed in contemplation before asking, \"Do YOU blame Jean for your wife's death?\"</p>\n<p>\"I-\" Goran wanted to say \"don't\" but something stopped him from vocalising it.</p>\n<p>\"Do I blame her?\" he muttered out loud.</p>\n<p>\"Do you blame yourself, then?\" Guy followed.</p>\n<p>\"Maybe... I don't know. Well, I don't blame Jean... No, I don't...\" Goran kept repeating in a trance.</p>\n<p>\"Why does it have to be anyone's fault?\" Guy probed. \"If anything, it was your wife's fault.\"</p>\n<p>Right as those words left Guy's lips, the pressure in the room rose exponentially. It originated from Goran whose face was red with boundless rage. Before the pressure could reach levels unbearable for Guy, he quickly added, \"If she knew that the place was so perilous, why did she take Jean with her anyways?\"</p>\n<p>\"That-\" Goran didn't have an answer to that. Now that he thought about it, the question was reasonably founded.</p>\n<p>\"I refuse to believe that a mage who was as strong as she was-\" Guy paused to see if Goran agreed with that statement, noticing that he did Guy continued, \"-would not be aware that a little girl was following her, or sneaking around her.\"</p>\n<p>\"It was arrogance!\" Guy declared. \"Arrogance, that led to negligence, that led to her own death. Please correct me if I'm wrong!\"</p>\n<p>\"No,\" Goran said meekly. \"It does sound like her...\"</p>\n<p>Guy exhaled a long breath to calm his growing anger. He didn't need further explanation to realise just what had happened to Jean to leave her in such an unaffected state. She had been chemically lobotomised, or the magical equivalent of it, just because the professionals treating her didn't realise that the girl was going through bipolar episodes. It was absolutely deplorable!</p>\n<p>\"She would have been fine - Jean. All she needed was a little patience, and someone to talk to and explain to her that she wasn't the one to be blamed,\" Guy said in a tranquil tone that masked his inner turmoil. \"However, there is no point in dwelling over it. What's done is done. Although I can't guarantee that I can cure her, I will do everything within my power to assist her.\"</p>\n<p>\"S-Should she stop taking her medicinal potions?\" Goran asked apprehensively. He could feel the temper fuming within Guy.</p>\n<p>\"She isn't taking them anymore. Marie has been observing her for the past few weeks.\"</p>\n<p>\"Then her sleep?\"</p>\n<p>\"It's been better. She used to wake up all sweating and shaken. But nowadays, she's become much calmer. She even slept in a few days back,\" Guy answered, and received a relieved sigh from Goran.</p>\n<p>Their conversation entered an awkward pause at that point. Goran's face had dropped markedly, as he stared into the ground with a blank gaze. Guy spent the time trying to suppress his ire. He knew that he couldn't blame the father for his mishandling of a manageable mental illness. After all, it wasn't ill-intentioned - Goran just didn't know any better. But as a teacher from a modern world, nothing irked Guy more than when someone treated kids with mental illnesses poorly because they misunderstood them as \"mad\" or \"weird\". It was a common occurrence in the villages and rural places Guy used to visit and teach in, and it was something he actively combated in his past life.</p>\n<p>After Guy centred his emotions he noticed Goran's checked-out expression. \"What's the matter?\"</p>\n<p>\"Oh? Nothing really. I was just going through my memories about my wife. Now that you pointed it out, there were many times she had let her arrogance get the better of her,\" Goran said while chuckling. \"But I kind of liked that about her, if I'm being honest. It was cute. She would be so confident at times, so sure that she would succeed, only to fail miserably and would return with her head hung low and a sheepish apology on her lips.\"</p>\n<p>Guy furrowed his brows slightly as he noticed the emptiness in Goran's eyes. Through his experiences in his previous life, Guy had lost a lot of trust in adults. He'd seen children suffer unimaginable tragedies solely because of the, knowingly or unknowingly, ill-advised actions of adults. Take Jean's current state for instance. It was the outcome of the mistakes of her mother and her father. No matter how well-meaning their actions were, it had inevitably affected the poor girl drastically.</p>\n<p>But now, as he heard Goran reminisce about his wife, Guy realised that the man before him was also suffering. Being an adult doesn't absolve someone from heartache. Sometimes, it hurts them even more.</p>\n<p>\"Tell me about her - Jean's mother, I mean,\" Guy inquired.</p>\n<p>Goran revealed a faint smile and started, \"She was different. Our first encounter was completely coincidental. She had erroneously confronted an Abyssal Dragon in search of some herb and ended up nearly dying to its attack. If I hadn't stumbled upon her with my comrades, she would have perished then and there. She truly was an arrogant one - I sort of realised it back then - but she was also quick to admit her mistakes, which was unique for someone like that. She learned and improved after every mistake, except for curbing her hot-headedness of course.\"</p>\n<p>Goran laughed out loud and said, \"She could never sit still. There was always something new. A new adventure, a discovery, some new research. But what I liked most about her was her selflessness. Everything she did was for the benefit of someone else. She once said that the only selfish thing she ever did her entire life was pursuing me. And boy oh boy was it a whirlwind of a pursuit. Everywhere I turned, she was there. She would be there when I woke up, and she would wish me good night as I went to bed. I didn't dislike her; the more I got to know her, the deeper I fell for her.\"</p>\n<p>\"They say that love is the death of a mage. It never made sense to me back then. But now that I've lost Nyla, I can understand what it meant. We expunge love from our hearts because if we do succumb to it, and lose that beloved entity, our entire life becomes nothing more than a slow crawl towards death. And since we mages live for what can sometimes be perceived as an eternity... It becomes a literal living hell!\" Goran admitted.</p>\n<p>\"How long have you been married?\" Guy probed.</p>\n<p>\"Exactly 49 years,\" Goran answered. \"Just one short of 50.\"</p>\n<p>\"You had Jean really late then, huh?\"</p>\n<p>\"It was a conscious decision. I didn't want to have a child at first.\"</p>\n<p>\"Why is that?\"</p>\n<p>\"I guess it was my own poor experience with my father.\"</p>\n<p>\"Let's talk about that,\" Guy urged.</p>\n<p>\"Well... I don't have much attachment to my father. Although the men are allowed to have multiple concubines in an official capacity, he never adhered to that option. Instead, while my mother was still pregnant with me, he was having multiple affairs with women, unofficially. To him, it was all about the taboo nature. He could have just as easily brought his many flings in as concubines, but he never did that! By the time I was born, he had made two other women pregnant, and then they were forced to become his concubines, to save the clan's face. He never held much affection for his wards except for one, and that was only because of the woman who birthed him. That vixen knew exactly what to say to entice my father and grab his attention.</p>\n<p>So I think it was my idea of familial love that dissuaded me at first. I believed that because of my father, my understanding of it wasn't right. That is also why I swore that I would only marry one person in my entire life. Thankfully, I found Nyla. </p>\n<p>I never had the support or love from my father, and I worried that if I had a child of my own, I wouldn't be able to raise it properly. Nyla understood that, and she was fine with taking her time. But after a point, I got this feeling that something was missing in our lives. After some thought, I realised that the remaining hollowness I was feeling, this emptiness, was the conflict resulting from my fear of having a child and a faint hope of becoming a father. So I decided to take the bold next step, and we had Jean. She was the product of our love and now she's all that I have left.\" </p>\n<p>Goran snorted in self-deprecation and said, \"It's funny, you know? I've ever always had only one source of happiness at a time. I guess it's a curse of mine...\"</p>\n<p>\"What do you mean by that?\"</p>\n<p>\"Well... When I was born, I had my mother. But then she passed away. Then I had Nyla, and then she left as well. Now Jean... I can't lose her, Teacher Larks! I admit that I made a huge mistake, but you must understand, it was the only thing I felt I could do!\"</p>\n<p>\"That's the thing, isn't it. Life isn't always in our control. One moment, you're living a healthy and happy life, the next you're confined to a bed suffering from a myriad of illnesses,\" Guy quickly interjected.</p>\n<p>\"I don't understand?\" Goran evoked in defeat.</p>\n<p>\"First off, Nyla is gone, Mister Rasmus. You must learn to let her go and focus on what you have right now. Second, you realised the errors you have committed with Jean, so now you need to now work towards doing right by her. If you keep putting your wife on a pedestal as such and lamenting over her passing, you will never move forward. Commemorate your wife's life as it should be, but move on because I am sure that is what she would have liked for you to do as well,\" Guy expounded. \"On top of that, it is your preoccupation with the self-perceived fact that you are alone that is hurting you. You need to realise that there are people around you that care for you. Take Teacher Jeeves for instance, I don't believe that your friendship with him is only in passing?\"</p>\n<p>\"... You're right...\" Goran uttered.</p>\n<p>\"So I know that it may sound callous of me, but I believe that it is time for you to take steps to move on. If not for yourself, then at least for Jean. And if you are struggling, please don't hesitate to reach out to people around you - such as myself for instance,\" Guy offered.</p>\n<hr>\n<p>Teacher Larks' advice rang in Goran's head. He reached forward, lifted the portrait, and called out for assistance, \"You there!\"</p>\n<p>\"You called, Master?\" An attendant outside the room quickly walked in with his head lowered.</p>\n<p>\"I want you to hang this up over there, on the wall behind the bed. Oh! And move in all the previous decorations and furniture on that side of the room from my study and my bedroom,\" Goran instructed. \"I will be sleeping here from now on.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/vlfbRPCPYMVdb9Z5S8wkH\">Chapter 123 - Explaining Compartmentalisation</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/Y1GTg6xDHoU4TtGRNFqba\">Chapter 121 - Hidden Behind a Bookshelf</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}