{"pageProps":{"note":{"id":"aoc3q1fycs4s6c353wx31x5","title":"Chapter 176 - Defense","desc":"","updated":1652987801400,"created":1651340901008,"custom":{},"fname":"volume-3.chapter-176","type":"note","vault":{"fsPath":"vault"},"contentHash":"0fbd9637f95003e2fb11e14d182dc004","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-176","id":"aoc3q1fycs4s6c353wx31x5","vaultName":"vault"},"value":"volume-3.chapter-177","position":{"start":{"line":55,"column":3,"offset":10750},"end":{"line":55,"column":27,"offset":10774},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-177"}},{"from":{"fname":"volume-3.chapter-175","id":"2328j23bmndslm5cocw7t5h","vaultName":"vault"},"type":"backlink","position":{"start":{"line":129,"column":3,"offset":9994},"end":{"line":129,"column":27,"offset":10018},"indent":[]},"value":"volume-3.chapter-176"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-176---defense\">Chapter 176 - Defense<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-176---defense\"></a></h1>\n<p>\"Is that the best you've got?!\"</p>\n<p>\"Not by a long shot! Try defending this!\"</p>\n<p>Markus observed the fight on stage with an unwavering gaze. The two combatants collided once again, one sword against another, causing a small shockwave to spread out. Both of them appeared to be on the verge of collapse, one with a fractured arm and another with multiple shattered ribs, both of which could easily be fixed with a small sip of a regenerative potion.</p>\n<p>In his time as a mage, Markus had only ever participated in a handful of combat scenarios. Of those cases, only one truly pushed him to apply his strengths to their fullest and that was against Gaige. So, it wasn't a stretch to admit that Markus was inexperienced in combat, and this conclusion did not sit well with him. Even though his Master emphasised the art of dialogue in resolving conflicts, what of Markus' goals in walking the mage's path? What guarantee was there that every conflict could be solved by a civilised discussion? At the end of the day, when spells start flying and weapons start swinging, even the most well-crafted of words cannot stop heads from rolling. </p>\n<p>'I don't think martial arts are the way to go, though,' Markus wondered. Although back in the Academy, he was put through a basic course of martial arts and combat training, it wasn't anything special that resonated with him. It was a generic set of combat arts, which wasn't even thoroughly explained. His cohort was provided with an instruction manual and was assigned a set time period during each day to practice the sequences defined in it. There would be an instructor only in name, as they never intervened in any way. One must know that the starting cohort in most Academies, like in sects, was sizeable and there were a lot of heads to go around. The expectation during these early stages was to filter out the weaker \"investments\". During the martial training sessions, peers would compete against each other through spars, some in good faith and others with malicious intentions. Markus was unfortunately subjected to the latter since his proficiency wasn't in combat and was thus generally slower in grasping the movements.</p>\n<p>Gaige had his own unique martial art that meshed with his cultivation. Markus wasn't disappointed or envious of that because his path did not require him to hold a cold weapon or propel his arms and legs against his opponents. His weapon was the humble forearm-length piece of wood that his Master had crafted for him, and his mind.</p>\n<p>His Master would often jokingly say that \"a mage must always be prepared.\"</p>\n<p>No matter the situation, a mage MUST have a solution handy. An unprepared mage is a dead mage. It was due to this mantra that Markus perpetually carried a handsfree belt-satchel, and the Grimoire crafted by Teacher Jeeves on his person. In the satchel, he would store phials and containers of useful resources that could aid him during spellcasting or allow him to escape. The Grimoire contained all the information he would ever need.</p>\n<p>With this said, why was Markus so engrossed in the fight? Markus' primary goal here wasn't to learn to fight from the combatants, but to formulate possible countermeasures should he have to confront the two in the future. Markus' mind constantly ran simulations that pitted himself against the opponents and recreated every move, spell and attack. If he couldn't determine a countermeasure within the time the attack took to hit him, he would note it down mentally so that he could address it at a later time.</p>\n<p>The combatant with the fractured hand leapt back to separate himself and immediately spun around while slashing his sword. As he did so, the metal started to glow a dangerous turquoise shade and a wave of wind swept forward. The other combatant wasn't prepared for that - he expected his opponent to continue an exchange of sword attacks at close range. The separation agitated his rib injury, causing a momentary lapse in concentration. The gush of sharp air hit him on his shattered ribs, tearing his already tattered clothes and shoving him backwards forcefully. With a pain-filled scream, the teen rolled off the stage and collapsed unconscious.</p>\n<p>While a few attendants immediately rushed towards the injured combatants and administered first-aid, Markus pondered over the last attack. It may look simple on the surface, but he could see that the wind blade that was projected forward was a highly complex spell when observed at a closer level. The complexity came from the fact that there were multiple minor wind blades formed by small eddies within the projected gust which added shredding action to the attack WITHOUT breaking up the gust as a whole.</p>\n<p>The question was, could he have defended against that attack? The answer was yes, he could have defended that attack because it originated from a mage in the Mana Condensation realm. The amount of mana behind the attack was low, and the mage's mana domain was abysmal. Markus could easily overpower that gust before it even left the sword. However, Markus took the inquiry to the next level by amplifying the attack to match that of a Foundation Establishment realm mage. Could he have defended against one like that?</p>\n<p>There are many ways to protect and defend oneself against attacks, both physical and magical. However, we can categorise these methods into two large buckets: Passive and Active defence. Passive defence involves the use of enchanted gears, defensive rituals, innate bloodline and physique advantages, and so on. These are protective measures that persist in the background and do not require the mage to divert their attention in maintaining it. Active defence involves the use of physical or magical defence measures that the mage must consciously maintain for it to remain effective.</p>\n<p>When it comes to defending with magic, the answer can fall somewhere between two ends of a spectrum. You can have a sweeping defence that covers all bases, or you can have a specialised defence that is perfect for the attack you intend to block. The easiest way to define the two is by using physical defence mechanisms as a basis for comparison. Two warriors with a sword and shield each enter combat. The first warrior swings their sword with a sidewards slash. The attack is telegraphed and the defender is faced with two options, they could either raise their shield to block the attack or they could use their own sword to parry the attack and follow it up with a shield bash to gain the advantage.</p>\n<p>Immediately, the difference is evident. The shield block is a sweeping defence. Although it is effective, it is wasteful. The blocker has to take the shock from the attack, and they do not gain any advantage from the defensive manoeuvre as the initiative is still in the attacker's hands. However, there is a higher guarantee of success. On the other hand, a party is more efficient, but sacrifices the guarantee and is also heavily reliant on the blocker's skill. Yet, upon a successful parry, the initiative is turned over to the defender.</p>\n<p>A mage has a blocking spell in their arsenal known as |Ward|. There are variations of the spell such as |Lesser Ward|, |Greater Ward|, |Ward Wall|, and so on that build upon the spell. Essentially, the mage puts up a multi-layered mana shield to physically block the attacks. Sometimes, the shield can be infused with special elemental capabilities to counter specific elemental attacks - |Hydrous Ward| for fire-based attacks and so on|. The greater the proficiency with the spell, the greater the number of layers and the stronger the defence. It was simple and fit the purpose. However, the downside here was that a |Ward| spell consumed mana when active, and was proportional to the damage it sustained. Furthermore, just like shield-blocking, it is extremely difficult for the defender to gain the initiative in combat through this method.</p>\n<p>Moving towards the other end of the spectrum, the defensive maneuvres get increasingly more intricate and specialised while becoming more efficient in their mana usage and in their capacity to gain the initiative. Take the |Fireball| as an example: a simple |Lesser Ward| can effectively handle the attack. However, a more specialised solution would be to create a vacuum region along the path of the projectile to dissipate the ball of burning gas. Moving further, it is also possible to manipulate the surrounding air to redirect the attack to another trajectory. At the furthest end of the spectrum, one can create a piercing gust of wind that rotates counter to the |Fireball| which uses the energy of the attack to ignite itself, essentially turning the incoming |Fireball| into an outgoing |Flame Lance|. As evident, the amount of mana and resource required to initiate the defence maneuvres decreases while the skill requirement increases.</p>\n<p>The goal of a skilful mage is to find the perfect balance in the spectrum. Even if one manoeuvre is highly efficient, it requires the application of a lot of mental processing power. Is the investment sensible in the long run? Sometimes, a less efficient defensive manoeuvre is preferable if it can protect against multiple attack patterns.</p>\n<p>These were the kinds of questions Markus was cycling through in his mind at that moment. This exercise was a practice to hone his instincts and make him a superior mage.</p>\n<p>The reason why martial arts were created was that there is an upper limit to the base instincts of humans. A beast in the same cultivation realm as a human is a lot stronger because their instincts are superior. To bridge this gap, humans created martial arts to artificially hone their innate instincts and train their bodies to react to specific scenarios.</p>\n<p>For a mage that uses their mind for combat, the procedure to hone their instincts involves constant mental conditioning through reasoning and debate. The goal is to train the mind to arrive at the correct conclusion in a highly stressful scenario, just like breathing and blinking.</p>\n<p>Right as Markus devised an optimal defence against the wind attack, the stage was cleared. Then, from the viewing stand embedded into the mountainside, a figure leapt out and descended. The figure glided through the air gracefully, like a leaf floating in the wind, and landed casually on the stage.</p>\n<p>Markus' eyes glanced at the figure's face and widened in horror.</p>\n<p>The reaction was an instinct ingrained into his soul. The girl's expression, her aura and bearing, and her classical beauty, all of these features combined caused multiple alarms to blare in his mind.</p>\n<p>'I have to leave!' Without hesitation, Markus lowered his head and started to scoot out from his spot. Unfortunately, his exit was blocked by the agitated youths around him.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/hvwsdc0higpewnoowj5v0jh\">Chapter 177 - Bait, Funnel, and Trap</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/2328j23bmndslm5cocw7t5h\">Chapter 175 - Power Struggles</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}