{"pageProps":{"note":{"id":"bd5ryzylcy7ce4vxwflj2s3","title":"Chapter 347 - (Un)Realistic Deadlines","desc":"","updated":1691438585969,"created":1688835961475,"custom":{},"fname":"volume-5.chapter-347","type":"note","vault":{"fsPath":"vault"},"contentHash":"088cc4d3a7a036bb268bd11274c4d33c","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-347","id":"bd5ryzylcy7ce4vxwflj2s3","vaultName":"vault"},"value":"volume-5.chapter-348","position":{"start":{"line":149,"column":3,"offset":12665},"end":{"line":149,"column":27,"offset":12689},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-348"}},{"from":{"fname":"volume-5.chapter-346","id":"01htcxxiny3be8ukncmsa9y","vaultName":"vault"},"type":"backlink","position":{"start":{"line":89,"column":3,"offset":10222},"end":{"line":89,"column":27,"offset":10246},"indent":[]},"value":"volume-5.chapter-347"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-347---unrealistic-deadlines\">Chapter 347 - (Un)Realistic Deadlines<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-347---unrealistic-deadlines\"></a></h1>\n<p>\"I can't say that I'm not a little bit jealous,\" Markus said as he walked alongside Shuri to the Sect Leader's office. \"But my pride seems to overshadow that. I guess this is how it feels when a student surpasses the teacher?\"</p>\n<p>Shuri snorted mockingly and said, \"That's just you, Senior Brother Reva.\"</p>\n<p>Then after a pause, she added, \"Maybe others in this Sect as well. You won't find such benevolence in educators outside the Sect. I've seen Teacher's sabotaging their Students for petty reasons.\"</p>\n<p>\"That's just... disgusting!\" Markus responded with a displeased look. \"How can an educator betray the trust of their student like that?\"</p>\n<p>\"Well, for the sake of discussion, I'm going to limit myself to cultivation and magic only. For a Teacher, the performance of a Student is a sign of competence not just for the Student, but for the Teacher themselves. The better a Student is in their journey through magic, the better it reflects on the Teacher's portfolio. However-\"</p>\n<p>Shuri raised a finger and wore a morose frown. \"There is a line. A line that when crossed turns all the positive social credits a Teacher earns thanks to their overachieving Student into poison. And you will know when that line is crossed when the comments you hear all around after a rather shining performance by the Student no longer praise the Teacher but start questioning whether the Teacher is required in the first place?\"</p>\n<p>\"If the Teacher's ego is so fragile, they shouldn't be taking on the responsibility in the first place!\" Markus responded with a sickened frown.</p>\n<p>\"You don't become a Teacher because you can teach,\" Shuri commented with a bitter chuckle. \"You become a Teacher because you know more than the other person in the room - not a conducive personality trait you want in an educator.\"</p>\n<p>\"No kidding...\" Markus affirmed.</p>\n<p>\"Besides, I don't consider you my teacher,\" Shuri shot back, causing Markus to turn around with a raised brow. \"We're collaborators, you just had a head start.\"</p>\n<p>Markus let out an uproarious laugh and patted Shuri on the back good-naturedly, \"That's for sure, partner!\"</p>\n<p>\"What are you two doing here?\" A familiar voice interrupted the duo just as they turned the corner and reached the Sect Leader's office door.</p>\n<p>\"That wasn't a question I expected to hear from you, Marie,\" Markus responded with a sarcastic snigger.</p>\n<p>\"Funny,\" Marie responded with an equal level of sarcasm oozing in her voice. \"Master's been riding my ass extra hard nowadays; I'm not allowed to use the Heavenly Eye for a while.\"</p>\n<p>This elicited another bellowing laugh from Markus, oozing with schadenfreude, which Shuri also partook in but with a more suppressed giggle matching her high-class upbringing. The laughter went on for some time though, it seemed as though Markus was remembering all the time Marie had fronted him with her powers and was rubbing it on her face.</p>\n<p>Shuri could see a vein throbbing in Marie's forehead, increasing in intensity with each passing breath. \"You know, I don't need the Heavenly Eye to drill you a new one. I don't even need magic - I've been contesting against men twice my age and size since before you even left this village.\"</p>\n<p>This threat curtailed Markus mid-laugh, causing him to choke on his own spittle. \"Your threats have no power over me, Sister!\"</p>\n<p>Marie returned a venomous gaze before taking two forceful steps forward in Markus' direction, causing the boy to instinctively take four steps back.</p>\n<p>\"Yeah... That's what I thought,\" Marie scoffed.</p>\n<p>\"How do you intend to get married if you're going to intimidate any man who approaches you?\" Markus stuttered back.</p>\n<p>\"Ha! If a person's ego is so fragile that a person standing up for and protecting themselves is going to hurt it, then I don't think I'll even be attracted to that person in the first place,\" Marie snapped back. \"No matter if it is a man-\"</p>\n<p>Her gaze wandered to the side and landed over Shuri. After a second of pause, Marie finished her sentence, \"-or woman.\"</p>\n<p>At that moment, the door behind Marie slid open and the Sect Leader's head popped out. \"If you all are just having a casual conversation, you could have just had it inside.\"</p>\n<p>\"S-Sorry Master!\" Markus sputtered with a deep bow. \"We didn't mean to disturb you.\"</p>\n<p>The Sect Leader simply waved his hand dismissively and gestured for them to enter.</p>\n<p>\"To answer Marie's question, I invited you three here today because thanks to Shuri's informative report, I've managed to derive a few conclusions,\" the Sect Leader commented as he assumed a seat on a cushion on the ground.</p>\n<p>\"It seems that our Teaching here hasn't been wholly proactive as we assumed it to be,\" he declared.</p>\n<p>\"But Master,\" Markus chimed in with a confused pout. \"We've not just been focusing on theoretical studies, but also mixing in a lot of projects and practical work too. Is that not being proactive?\"</p>\n<p>\"In a way, it is. It helps the students understand the concepts and assimilate knowledge more seamlessly, but that's the limit,\" Sect Leader Larks emphasised. \"We haven't noticed nary a stimulation of their cultivations till this point. It seems that while our methods are effective in teaching, they are constrained to knowledge and don't reach the cultivation.\"</p>\n<p>\"But I managed to achieve perfected resonance with the same methods, right?\" Markus argued contemplatively.</p>\n<p>\"Did you, though?\" Was the Sect Leader's immediate retort - with a voice dripping with mystery.</p>\n<p>\"I don't know if it's a disease that spawns when you gain the Master title,\" Marie mumbled with an exhausted sigh. \"Can we please skip the suspense, Mister Larks?\"</p>\n<p>\"You're one to talk,\" Shuri muttered under her breath. A poor option since all mages in the room heard it.</p>\n<p>\"Ouch,\" Marie said with an exaggerated hurt expression.</p>\n<p>\"Well,\" the Sect Leader jumped in, redirecting the conversation. \"Think about the circumstances of your respective breakthroughs. They were all stimulated by the initiative. Markus, your breakthrough was borne of you succeeding to cement your understanding of gravity and developing an original spell. Marie, you broke through after developing a new way to channel the Heavenly Eye. Let us skip Jean since her circumstance is a little different. And as for Shuri, we all know how that happened.\"</p>\n<p>\"What do they all have in common?\" Sect Leader Larks placed openly, letting all present stew in the conclusion.</p>\n<p>\"How do we go about it, then?\" Marie probed.</p>\n<p>\"It was an interesting assignment,\" the Sect Leader commented as he picked three bound books and distributed them amongst the teens. \"Instead of just teaching, we want to encourage independent thought and exploration, and exercise knowledge more freely and innovate. The Maker-Space is not enough, nor are the labs and innovation opportunities offered by the Verum Trading Company. It is too passive, and none of the students are feeling motivated to take on those challenges due to fear of failure. Even Shuri wouldn't have volunteered if Marie hadn't poked her nose into Shuri's business.\"</p>\n<p>An accusatory gaze was exchanged between Shuri and Marie at that.</p>\n<p>\"Nonetheless, what you have before you is a new teaching manual that I want you guys to implement into your lessons,\" the Sect Leader said.</p>\n<p>\"Socratic Seminar?\" Markus read out loud. \"What is that?\"</p>\n<p>\"Just read the damn text, genius!\" Marie chided. \"By the way, who's Socrates?\"</p>\n<p>A sly smile flashed past Markus' face as he mocked. \"Just read the damn-\"</p>\n<p>\"It's not written in here, genius!\" Marie interjected and slapped the back of his head.</p>\n<p>The Sect Leader ignored the bickering duo and expounded, \"Socrates was a famous scholar who developed a method of teaching that promotes critical thinking, active listening and discussion amongst peers. In a Socratic seminar, participants engage in a structured dialogue about a specific text, topic, or question. The seminar typically takes the form of a roundtable discussion, with participants seated in a circle. The main purpose is to explore complex ideas, encourage thoughtful analysis, and foster respectful exchange of ideas.\"</p>\n<p>\"In fact, Shuri stumbled upon this by herself because the side of her Automagy Group is so small,\" he then added while giving Shuri a congratulatory nod.</p>\n<p>Shuri started to read through the document and noticed that the Socratic seminar had six main points.</p>\n<p>In the preparation stage, participants are given a reading or a set of materials to review before the seminar. They are encouraged to take notes, highlight key points, and formulate questions or thoughts about the material.</p>\n<p>The seminar then begins with the opening question or statement posed by the facilitator of the seminar. This question serves as the starting point for discussion and encourages participants to think critically about the topic.</p>\n<p>During the seminar, participants take turns sharing their thoughts, interpretations, and responses to the question. The focus is on active listening and respectful conversation. Participants are encouraged to refer to the text or materials to support their arguments and engage with one another's ideas.</p>\n<p>The facilitator's role is to guide the discussion, ensure equal participation, and promote critical thinking. They may ask follow-up questions, encourage deeper analysis, or redirect the conversation if needed. The facilitator does not provide answers but helps the participants explore the topic further.</p>\n<p>Socratic seminars often have ground rules to ensure a productive and respectful discussion. These rules may include listening attentively, building on others' ideas, providing evidence from the text, and avoiding personal attacks.</p>\n<p>The seminar concludes with a reflection on the discussion and the main insights gained. Participants may summarize their key takeaways or pose further questions for continued exploration.</p>\n<p>The booklet went to great lengths expanding on the different stages, expectations, rules and regulations of a Socratic seminar, offering examples and practice prompts.</p>\n<p>\"Can this method be applied to all subjects?\" Markus probed. \"How can I apply this to the natural sciences or even maths?\"</p>\n<p>\"Initiate discussions with application cases or ask them to talk about publications. Access the restricted section if you need to,\" the Sect Leader instructed. \"I've posted examples in this booklet for you to try out.\"</p>\n<p>\"Okay!\" The Sect Leader drew everyone's attention with a resounding clap. \"I want us to double up our weekly meetings - once is just not enough. I want to see reports on student feedback and student performance evaluations once every two weeks.\"</p>\n<p>Those weren't difficult asks. Excessive, sure, but Shuri understood the need.</p>\n<p>\"Oh!\" The Sect Leader said in the end with a resolute edge in his voice and an unwavering glint in his eyes. \"Within six months, I want to see five more perfected resonances in this cohort.\"</p>\n<p>\"What?!\" Markus blurted out with a high-pitched screech.</p>\n<p>\"Are you kidding?\" Marie snapped instinctively.</p>\n<p>\"Sect Leader-\" Shuri tried to plead reason, but the man raised his hand decisively halting any discussion.</p>\n<p>\"I know it is asking for a lot. But if we, as a Sect, cannot deliver measurable results, it will reflect poorly on our competence,\" the Sect Leader said. \"There is already one thing that I promised which has stalled, we cannot afford another.\"</p>\n<p>Everyone present knew about the Sect Leader's dilemma to help the single blind student in the Sect, and how the guilt of his failure was bearing down on him.</p>\n<p>\"But no Sect can promise such a statistic, Sect Leader. Even the best of sects have at best a 2% perfected resonance rate with any incoming cohort, and that is because an incoming horde is at least 100 people,\" Shuri reasoned. \"Your requirement is almost 20%. That's ten times that!\"</p>\n<p>\"Those sects play a game of quantity,\" Sect Leader Larks responded. \"I am confident that the quality of our cohort and our teaching staff is superior.\"</p>\n<p>There was confidence and a shining charisma in that declaration that made Shuri and all others present forget about the downright unrealistic demand. Everyone left the room in a daze, with uncertainty and stress brewing in their minds.</p>\n<p>Markus turned to his elder sister, hoping for some words of consolation from the seer, \"Umm, Marie-\"</p>\n<p>\"Don't even bother,\" Marie shut him down while shaking her head. \"I did not spend a lot of time inspecting our immediate future.\"</p>\n<p>\"Will we be able to do it, though?\" Shuri said, voicing her doubt.</p>\n<p>\"There's something to be said about optimism in the face of uncertainty,\" Marie advised. \"We should try our best and hope for the best. That's all I can say, really.\"</p>\n<p>Again... Hope... Shuri didn't know if she had any more of that left in her.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/ygwlpee3vw412qev3r10nto\">Chapter 348 - Identifying Needs</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/01htcxxiny3be8ukncmsa9y\">Chapter 346 - Take Two</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}