{"pageProps":{"note":{"id":"bfd79j7lw7nza2be2s6dg0g","title":"Chapter 049 - (Interlude) Shady Dealings","desc":"","updated":1648145049569,"created":1648145049569,"custom":{},"fname":"volume-1.chapter-049","type":"note","vault":{"fsPath":"vault"},"contentHash":"b28f521c240518f7588802fe9c1f5d34","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-049","id":"bfd79j7lw7nza2be2s6dg0g","vaultName":"vault"},"value":"volume-1.chapter-050","position":{"start":{"line":131,"column":3,"offset":11660},"end":{"line":131,"column":27,"offset":11684},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-050"}},{"from":{"fname":"volume-1.chapter-048","id":"nmUVsokSqNTRu9pPUD0Bj","vaultName":"vault"},"type":"backlink","position":{"start":{"line":93,"column":3,"offset":10546},"end":{"line":93,"column":27,"offset":10570},"indent":[]},"value":"volume-1.chapter-049"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-049---interlude-shady-dealings\">Chapter 049 - (Interlude) Shady Dealings<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-049---interlude-shady-dealings\"></a></h1>\n<p>A series of flat and uniform knocks interrupted the tranquil atmosphere in Goro Lynn's office. He had hoped that today would be a special day for him, free of work. Nonetheless, as the Guild Manager of Radiant City's Smithing and Enchanting Guild he could never truly escape from his responsibilities. </p>\n<p>\"Come in,\" Goro declared with a hint of lamentation in his voice.</p>\n<p>The door opened slowly and a familiar man stepped in. Goro had intended to contact Karmin after he heard of the recent trouble the man's company was facing. Even though the two weren't close acquaintances, Goro remembered that Karmin was one of the oldest members registered to the Radiant City's guild office. Furthermore, he was also a 2-starred Smith so Goro was obligated to treat Karmin as his equal.</p>\n<p>Goro stood up from his seat and gestured at the chair opposite his desk, \"Please take a seat, Smith Zola.\"</p>\n<p>Karmin nodded and obliged.</p>\n<p>\"I was planning to contact you, however, I couldn't separate myself from my work. How is your business? I heard that you're facing some troubles. Is there anything I can do to help?\" Goro asked respectfully. While it wasn't the guild's business to interfere in the free market. Goro wanted to do anything within his power to retain Karmin amongst this branch's ranks.</p>\n<p>Karmin gently shook his head and picked up a wrapped item he brought in with him, \"I just need you to inspect this weapon for me, Enchanter Lynn.\"</p>\n<p>Goro affirmed with a hum and cleared up his desk. Karmin carefully placed the item in front of Goro and untied the string that held the cloth wrapping together. He then slowly peeled off the wrapping to reveal an impeccably crafted shortsword.</p>\n<p>Goro smiled and commented, \"I can recognise your craftsmanship! Did you reforge a Dwarven weapon? Congratulations on your success!\"</p>\n<p>Karmin interrupted Goro's gushing, \"Please inspect the weapon and its composition.\"</p>\n<p>Goro's lips twitched as he was forced to stop midway. It was an involuntary force of habit of his as a guild manager to praise his VIPs. Most enchanters and smiths of a higher rank would melt under Goro's barrage of ego-boosting drivel, but Goro forgot that Karmin wasn't one of them. The man was extremely resilient and centred!</p>\n<p>Goro coughed to clear his throat and dispel the awkward atmosphere, then he began his inspection. He didn't need to use an inspection artefact as he was sufficiently advanced in his cultivation as a mage. After all, to qualify for a 2-star license in enchanting, being in the External stage of Foundation Establishment was a minimum requirement.</p>\n<p>On that note, Foundation Establishment is divided into three stages; Base, Internal and External stage. During each of these stages, the mages develop their mortal containers - their bodies - through cultivation, to lay the foundations for their future advancements. The vast majority of mages in the world are in this realm, in fact, those in the Mana Condensation realm aren't technically considered mages in the grand scheme of things - they're still mortals.</p>\n<p>As Goro drew the |Inspect| cantrip into the sword, he grew increasingly satisfied and impressed by the work. There wasn't a single crack or problem point that would later manifest into a catastrophic failure through use.</p>\n<p>\"You're been extremely lucky this time, huh? No faults as far as I can see. The metal's quality is also perfect - no degradation due to reforging!\" Goro exclaimed.</p>\n<p>Karmin nodded and pulled out his own Dwarven dagger and slid it across the table, \"I want you to compare it with this dagger.\"</p>\n<p>Goro raised the dagger and commented, \"Dwarven craftsmanship, unenchanted. I'm familiar with this one.\"</p>\n<p>He then proceeded with the inspection on the dagger, intermittently casting the cantrip on the shortsword whenever he noticed any discrepancies.</p>\n<p>After he finished he placed the dagger back on his desk and listed his impressions, \"They're both similar, by my inspection there is a 96% closeness in terms of the metal composition. As far as craftsmanship is concerned, the dagger is clearly the work of a Dwarven smith, while I recognise that the shortsword is your handiwork.\"</p>\n<p>He then probed Karmin, \"Is this all? You could have just applied for an inspection from the guild's inspectors.\"</p>\n<p>Karmin exhaled deeply and produced a stack of documents from his satchel, \"Actually, I'm here for two reasons. First I want to apply for sponsoring a member for the Practitioner's Licence, AND to apply for the guild's patent on an alloy I and this member have developed.\"</p>\n<p>Goro affirmed involuntarily, but then he quickly shook his head and exclaimed, \"What?\"</p>\n<p>He pulled the document closer and read through the sponsorship application, \"Guy Larks? Where have I heard that name before?\"</p>\n<p>Right as he wracked his brains to dig out the source of the familiar-sounding name, Karmin provided the answer, \"He's backed by Teacher Jeeves.\"</p>\n<p>Goro slapped his thighs audibly, \"Him? Which alloy did you guys develop?\"</p>\n<p>In excitement, Goro proceeded to flip through the pages to get to the patenting applications. However, his hands paused almost immediately, \"No way! You didn't!\"</p>\n<p>His eyes darted to the shortsword in his desk, \"You managed to create Dwarven metal?\"</p>\n<p>\"We're calling it steel. Since we don't know if it's made through the same process by the Dwarves, we felt it was best to use an alternate moniker,\" Karmin then chuckled, \"Until it is clarified by the Dwarves, of course.\"</p>\n<p>Goro shook his head in disbelief and retorted, \"How did you guys do it? No, wait! Don't tell me just yet.\"</p>\n<p>\"I wasn't planning on telling you anyways,\" Karmin responded.</p>\n<p>\"Really?\" Goro asked sheepishly, \"If you do, you might get a lot of merits from the guild. It might even be enough to put you in a favourable position for the 3-star license?\"</p>\n<p>Karmin denied once again, \"I am not planning on that. I want you to verify that this metal is a close match to Dwarven metal. My business is planning to sell steel weapons and armours soon, and I don't want people throwing around accusations of false advertising.\"</p>\n<p>Goro nodded in understanding. He already knew the shady occurrences in the markets and the rumours being tossed around regarding The Burning Forge's problems. He was required to write in a warning as a reprimand to Karmin in response to those accusations after all. But Goro also knew that Karmin wasn't one to employ subterfuge in his business dealings. He had always been above board and preached customer satisfaction. Amongst the many smiths and enchanters Goro was acquainted with, Karmin was the most personable.</p>\n<p>\"Are you planning to sell steel?\"</p>\n<p>\"Yes, I've indicated an estimate for the sale price on the application.\"</p>\n<p>Goro inspected the section and his eyes nearly popped out of their sockets, \"That is cheap! Are you sure? It's just a little higher than the price of iron!\"</p>\n<p>Karmin smiled in response, \"We've optimised its production. And besides, it was a business decision. We plan to raise its price at a later date.\"</p>\n<p>Goro understood the meaning. Right now, what Karmin needed was a stabilising factor. If this 'steel' managed to gain a foothold in the market, it would greatly improve The Burning Forge's position. And Goro was confident in this steel metal. His inspection indicated that the metal was uncannily similar to Dwarven metal.</p>\n<p>But Goro was also worried, \"Are you sure you can handle this? Your competitors will throw a fit and pull underhanded stunts to get their hands on the alloy...\"</p>\n<p>\"And that is why I have a favour to ask of you. Don't worry, my proposition will be beneficial for both the guild and my business. I can sell steel to the guild for a highly subsidised fee, given that the guild supplies the resources for manufacturing it. In return I want the guild to regulate the market. If any other party apart from those affiliated to me and my partner venture in the steelmaking and selling market using our method, I want the guild to intervene.\"</p>\n<p>Goro showed a strained expression, \"I can't promise that. The guild doesn't interfere in the way members handle their businesses unless it conflicts with our bylaws, and you know that.\"</p>\n<p>\"Yes, however it is clearly stated in the bylaws that should a member request exclusivity of one of their intellectual properties, they are entitled to it.\"</p>\n<p>\"I get that, but -\"</p>\n<p>\"But the guild has never bothered to enforce it like the other bylaws. Why is that?\" Karmin asked pointedly.</p>\n<p>\"If an unsupported member manages to make a discovery they are never safe because they are automatically targetted by the powers above them. Without a large tree to offer them a shadow of solace, no one survives in this industry, and I empathise with that sentiment,\" Karmin continued.</p>\n<p>\"However the guild specifically indicated that the members are authorised to sole ownership rights. If that is the case then aren't you obligated to enforce it?\"</p>\n<p>Karmin sighed and spoke incisively, \"And it was only after a little bit of research, that I realised why.\"</p>\n<p>He pulled out the third stack of documents from his satchel and spread it on Goro's desk.</p>\n<p>\"A hundred years ago, a 1-star smith developed a novel alloy of Kaminite and Orichalcum that was perfect for channelling lightning-aligned mana. They applied for a sole ownership right, and the guild approved it. However, a month after, the smith was found dead in his forge. Many thought the alloy would die with the smith, but three weeks after the incident, the guild started to sell this new alloy.\"</p>\n<p>Karmin dragged another file and added, \"73 years ago, a 2-star smith developed an improved method of producing the standard Adamantium metal. Yadda yadda, the smith was found dead in a brothel and a month after that, the guild implemented this new system into their production lines.\"</p>\n<p>\"The guild wasn't involved in those events!\" Goro denied vehemently.</p>\n<p>Karmin hummed in condescension and pulled out specific pages from eight different folders, \"Once or twice, is a coincidence. But if the pattern persists for 8 different cases? I know, nothing is tying the guild to these incidences on paper, but I've done my investigation. I suggest you take a closer look.\"</p>\n<p>Karmin waited for Goro to peruse through the information as he slid deeper into his seat confidently.</p>\n<p>Goro was sweating through his clothes at this point. Putting on a facade of confidence he asked, \"Are you threatening the guild?\"</p>\n<p>Karmin nodded innocently, \"Yes. I thought I was clear.\"</p>\n<p>\"What do you want me to do?\" Goro asked through clenched teeth.</p>\n<p>\"I don't want YOU to do anything. I want to meet the ones above you.\" Karmin declared as he stood up to leave.</p>\n<p>\"Oh and if people somehow find my or my partner's dead body in the coming weeks, know that I will make sure this information reaches the ears of all the guild members in Gaea! I will take the guild down with me. Of course, you wouldn't mess with Guy Larks, unless you're planning to cross Al Jeeves too. This isn't my first rodeo, Goro.\"</p>\n<p>Goro sighed, \"Since when have you known?\"</p>\n<p>\"Please! I knew it since the day I got my practitioner's license,\" Karmin said nonchalantly as he strode out of the office.</p>\n<p>Goro dabbed his forehead with his sleeves and calmed himself. He reached into his breast pocket and pulled out a communication artefact. He had activated the artefact the moment Karmin brought forward the sole ownership request. In fact, that sentence was like an activation phrase for the guild managers, 'If anyone asks for sole ownership, activate the communication artefact to your branch handler in HQ!'</p>\n<p>\"What do I do?\" he asked.</p>\n<p>The artefact strobed slightly, and a sharp and feminine voice responded, \"Let me think about it...\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/ijKtQUCIPNAOBbcTAXb9A\">Chapter 050 - To Do or Not To Do</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/nmUVsokSqNTRu9pPUD0Bj\">Chapter 048 - Coincidental Source of Income</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}