{"pageProps":{"note":{"id":"bmet3j0bmeewd3ucshhm7kb","title":"Chapter 284 - Universal Panacea Physique","desc":"","updated":1677039434532,"created":1674535751497,"custom":{},"fname":"volume-4.chapter-284","type":"note","vault":{"fsPath":"vault"},"contentHash":"7e953ec29e054e31b6842fee8a986f41","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-284","id":"bmet3j0bmeewd3ucshhm7kb","vaultName":"vault"},"value":"volume-4.chapter-285","position":{"start":{"line":101,"column":3,"offset":10547},"end":{"line":101,"column":27,"offset":10571},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-285"}},{"from":{"fname":"volume-4.chapter-283","id":"cslspz2cvd5cpaiwdl5svma","vaultName":"vault"},"type":"backlink","position":{"start":{"line":115,"column":3,"offset":9288},"end":{"line":115,"column":27,"offset":9312},"indent":[]},"value":"volume-4.chapter-284"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-284---universal-panacea-physique\">Chapter 284 - Universal Panacea Physique<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-284---universal-panacea-physique\"></a></h1>\n<p>Jean was well-read in magic. Because she couldn't learn or practice it in her early teens, all she could do was brush up on theories to fill up the void in her heart. She knew a lot of concepts and topics ranging from trivial to the arcane. However, she could not retrieve any information regarding the so-called \"Universal Panacea Physique\" and why Josie called it a two-faced gift.</p>\n<p>\"Now that the slave has thought it over, it is reasonable that the Young Miss isn't informed of this physique. As this slave has already stated, it is extremely rare and isn't hereditary - it can pop up in anyone regardless of lineage or birth conditions. Furthermore, knowledge about it is highly regulated by groups specialising in medicine and alchemy. This slave only knows bits and pieces from what the Mistress shared with her,\" Josie elaborated.</p>\n<p>\"What benefits does the physique offer?\" Jean followed up.</p>\n<p>\"Benefits?\" Josie half-scoffed. \"This slave wouldn't call it as such.\"</p>\n<p>The words left her mouth instinctively, but just as she was about to expound she noticed Kili perk her ears in anticipation. Josie coughed audibly and hinted at Jean to do something about the girl.</p>\n<p>\"It's okay,\" Jean responded with a shake of her head. \"It is her body, after all. She deserved to remain in the loop.\"</p>\n<p>Josie sighed and shrugged before continuing.</p>\n<p>\"Any person's bodily functions can be classified as either voluntary or involuntary. The former case pertains to processes that can be controlled actively, while the latter governs the passive functions. Interestingly, while a mage gains greater control over their bodies through advancement, their passive functions are still limited in their scope of control. You CAN force your heart to beat slower, but that requires you to assign a part of your mental capacity to achieve the result.\"</p>\n<p>Josie paused so that the premise solidified in Jean's mind. She tried to keep it simple enough so that even the little girl could understand, though she could see from Kili's expression that some of it had flown over her head. Once Josie received a nod of comprehension from Jean, she continued.</p>\n<p>\"The Universal Panacea Physique removes this limiter and makes it so that the passive processes become just as, if not more, controllable as the active ones. In fact, the whole business becomes second nature - you don't even need to think or focus on it before the body starts behaving the way you want it to,\" Josie highlighted.</p>\n<p>\"The little girl unwaveringly believed that the 'potion' would turn her tongue green, and her body's passive physiology adapted to that belief. If I told her that the vinegar was sugar syrup, and the girl was convinced of that fact, then she would taste sugar syrup,\" Josie added.</p>\n<p>\"That's amazing! Is that why her immune system neutralised the virus? She didn't get sick because she believed that she wasn't sick? That makes no sense!\" Jean evoked her incredulity. \"This is completely unscientific!\"</p>\n<p>\"Special physiques and bloodlines seldom follow common sense,\" Josie supported. \"Though the Universal Panacea Physique is admittedly one that makes the least sense. You can already guess the potential in this girl's body. As long as she believes she is impervious to anything that requires a passive response from the body, she can never be affected by it. She is immune to nearly all poisons, extreme temperatures, and diseases and her healing faculties are dialled beyond a hundred - and this is all just to name a few.\"</p>\n<p>\"How come I've never heard about anyone with a Universal Panacea Physique before? Given their potential, there should at least be one mage standing amongst the unparalleled experts with a similar physique. And, how come it is activated for this girl? As I recollect, it takes advancing into the Foundation Establishment realm to do that.\"</p>\n<p>\"The plague must have triggered something inside her prematurely. Physiques and bloodlines have been known to activate when the bearer experiences life-threatening situations or states of heightened emotions,\" Josie surmised.</p>\n<p>She then revealed a pained expression as she glanced at Kili one last time.</p>\n<p>\"There is a reason why the physique is called the Universal Panacea,\" Josie hinted. Unfortunately, Jean wasn't quick enough on the uptake and wore a blank expression awaiting further explanation.</p>\n<p>With a sigh, Josie elaborated, \"A special physique is ingrained into the 'essence' of a person - their life force or vitality if you will. Certain high-level, and forbidden, branches of alchemy practise techniques that can extract this 'essence' of a person. They can then use this 'essence' as a catalyst or ingredient in a brew.\"</p>\n<p>\"You don't mean-\"</p>\n<p>\"The Universal Panacea, as its name suggests, is a universal ingredient. It can be used in place of anything, or in conjunction with anything to achieve extraordinary potions with unimaginable or downright impossible effects since the property of the extracted 'essence' is mouldable to fit the Alchemist's exact requirements,\" Josie confirmed with a grave expression. \"The Young Miss hasn't heard of or seen anyone with a Universal Panacea Physique because none live long enough to see the end of the tunnel. In nine out of ten cases, they undergo a gruesome essence extraction procedure for a bottlenecked mage to break through.\"</p>\n<p>Once again, Jean found herself appalled and unable to digest revelations of such magnitude and consequence.</p>\n<p>\"They just kill them with no regard for life,\" Jean spat out, taking offence even at the thought of it.</p>\n<p>\"Though, Young Miss,\" Josie interrupted Jean's unaffected rage. \"We may have to resort to something of that sort to tackle the problem here.\"</p>\n<p>\"Why would I even consider something like that?\" Jean berated.</p>\n<p>\"What this girl holds inside her is the solution that will cure the epidemic. We don't have to perform the complete essence extraction. We can work with half a litre of her blood and extract the essence that combats the virus from it,\" Josie explained nonchalantly.</p>\n<p>\"That's inhumane,\" Jean shot back reflexively. \"We-\" she caught herself mid-scream and repeated with a lowered tone, \"We will essentially be using her as a resource, draining her like a well. How many times would we have to keep doing it? The girl will be anaemic. There has to be another option!\"</p>\n<p>\"There is, but it will be riskier,\" Josie suggested.</p>\n<p>\"Riskier than bloodletting?\" Jean mimicked a scoff.</p>\n<p>\"Riskier because it would expose her existence to the wider world,\" Josie elaborated.</p>\n<p>\"How would that be any riskier?\"</p>\n<p>\"Because when the world learns of her existence, and not IF because word WILL get out, then every powerhouse teetering on the cusp of a breakthrough will swarm to acquire her. Forbidden magic is only forbidden when not performed by the ones that enforce the laws. Even the Emperor in all his glory will not hesitate to extract this girl's 'essence'. Heck! If the rumours circulating in the back alleys of the Capital are to be believed, he has all the more reason now given his recent 'battle scar',\" Josie warned.</p>\n<p>\"That's a problem for the future. What's the point if Kili can't even make it past the present?\" Jean reasoned. \"What is this other method?\"</p>\n<p>\"Alchemy. Deconstruct the cure to synthesise more. The level of the cure should be low enough to allow that. Although it would require an industrial-level setup for which the Young Miss will have to tap into the clan's resources. In doing so, it would expose the child's existence to the world,\" Josie warned.</p>\n<p>Alchemy is more than just brewing potions - it is only the case when approaching the subject at a lower level. Deconstruction is a branch of alchemy that, as its name suggests, looks at separating a substance into nothing and understanding its makeup. Synthesis is the process of recreating a substance through the use of its base components learned through deconstruction. These are high-level applications of magic in the alchemical field as they require a lot of mana in operation.</p>\n<p>Only recently did Jean realise that the reason for such a high mana requirement was probably due to the inefficient application of magic. If one were to apply the concepts and theories of chemistry, the process' expenditure could most likely be alleviated.</p>\n<p>Jean contemplated her options and realised that, unfortunately, Josie had a point.</p>\n<p>\"Ultimately, this isn't a choice that's up to me to make, after all,\" Jean pointed out while nudging her head towards Kili who, at this point, was dumbfounded by the sheer quantity of information she had to process.</p>\n<p>\"Umm,\" the girl vocalised her confusion.</p>\n<p>\"Would you like me to explain it again?\" Jean asked with a more personable tone. The girl nodded her head in response.</p>\n<p>\"Before we begin, I hope we can draw blood from you. It can help treat the man who showed symptoms- who vomited blood all over you just now,\" Jean inquired expectantly. Fortunately, the girl didn't hold a grudge about being drenched by that man and allowed Jean to take her blood to synthesise a stop-gap treatment.</p>\n<p>\"Josie, can you please take me through the method to extract the 'essence' from her blood?\" Jean delegated, and Josie obliged readily.</p>\n<p>\"I have a question?\" Kili asked meekly while Josie tapped the girl's skin to detect a suitable vein.</p>\n<p>\"If... If I fed my mother some of my blood, would she have survived?\" There was a tinge of pain and hope in the girl's voice that pained Jean.</p>\n<p>\"It's not that simple, Kili,\" Jean responded with a shake of her head and saw the girl's face alternate between relief and despair.</p>\n<p>It hurt to know that she couldn't save her mother, but it also made her feel relieved that something so simple as cutting her palms and placing them above her mother's mouth wasn't the solution. Though it must be disappointing to know that the power to heal was within her, but couldn't be tapped by her or her mother.</p>\n<p>\"Success is expected, failure should only be a result of ineptitude, not negligence,\" Jean repeated her Sect Leader's words subconsciously, causing the girl to look at her with a bewildered expression.</p>\n<p>\"What happened wasn't your fault,\" Jean emphasised while ruffling the girl's hair. \"You wouldn't have known you had this power within you if we hadn't met. If anything, it's my fault. If I had arrived sooner, your mother might have survived.\"</p>\n<p>The girl bit her lips and murmured, \"Thank you, big sister.\" Her voice was low, barely audible. But Jean's enhanced hearing picked it up nonetheless, and the corners of her lips twitched subconsciously and arched upwards slightly.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/ycsa4k2fmo74ek3ylxovj5a\">Chapter 285 - Selfish Decisions</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/cslspz2cvd5cpaiwdl5svma\">Chapter 283 - \"Magical\" Immunity</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}