{"pageProps":{"note":{"id":"bpztef9wuuyswa83s4dfiio","title":"Chapter 323 - (Interlude) Undercurrents (Part One)","desc":"","updated":1686572099947,"created":1684094041335,"custom":{},"fname":"volume-5.chapter-323","type":"note","vault":{"fsPath":"vault"},"contentHash":"29b7bb954abd8bffdcfadcdc07390cd0","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-323","id":"bpztef9wuuyswa83s4dfiio","vaultName":"vault"},"value":"volume-5.chapter-324","position":{"start":{"line":99,"column":3,"offset":12022},"end":{"line":99,"column":27,"offset":12046},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-324"}},{"from":{"fname":"volume-5.chapter-322","id":"wo1xmesc0vxcx6eyb6avtdf","vaultName":"vault"},"type":"backlink","position":{"start":{"line":75,"column":3,"offset":10210},"end":{"line":75,"column":27,"offset":10234},"indent":[]},"value":"volume-5.chapter-323"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-323---interlude-undercurrents-part-one\">Chapter 323 - (Interlude) Undercurrents (Part One)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-323---interlude-undercurrents-part-one\"></a></h1>\n<p>Something strange was brewing in the Maika Duchy. Although that sector of the Solar Empire was known to be an economic powerhouse, the recent numbers regarding tax accumulations and overall economic health (in terms of money circulating within the system) had placed it at a much higher-than-expected standing.</p>\n<p>The Minister of Finance, Jing Lorath, should be elated to see this improvement, but his expression was dour and listless. His mind was preoccupied with the fact that the court would be in session tomorrow, and it could very well be his last day. Things had been faring, for the lack of a better word, poorly in court. Actually, there was a better word—it was shit, plain and simple. It all started from the day the attack transpired in the Inner Court. Ever since then, things started to devolve with each passing day. Jing didn't even know what had happened back there as within days of the attack, a thorough cleanse swept through the Palace during which many heads had rolled, and the grounds were drenched in red.</p>\n<p>It was a brutal event that still lingered in Jing's memories. The metallic smell mixed in with the stench of shit and piss was etched into his nostrils, so much so that he couldn't even swallow his food properly anymore. The man had practically lost a quarter of his body weight within months. This was something Jing expected to hear from the Kingdom in the North, not the mighty Solar Empire—the Dynasty destined to stand the test of time.</p>\n<p>Alas, Jing was certain that the Dynasty would fall within this generation itself, as the man whose shoulder it rode on was slowly becoming unpredictable, unhinged, deranged, and temperamental. Whatever occurred in the aftermath of the attack had clearly taken a toll on the Emperor. And unfortunately, when the master suffers, it is the slaves that are the first on the chopping block.</p>\n<p>Court had grown emptier nowadays. The Emperor's volatility had worsened to a point that all it took was a look that lingered for a fraction of a second too long to set him off. And the retaliation for such \"transgressions\" was no longer a simple firing or demotion, but a thorough extermination of one's bloodline root and stem. Just last week, the Minister of War was released from his post and his life for having an almost imperceptible wrinkle on his coat.</p>\n<p>At this point, only a handful remained. Interestingly, those that remain did not have any concubines or mistresses. Jing wasn't sure if that held any meaning, but it certainly added fuel to a certain flame that has been quietly burning in the capital—that the Emperor's seed had been burnt to a crisp. Was it the truth? Jing didn't know and didn't care. In fact, he didn't even want the thought to occupy any real estate in his mind.</p>\n<p>Even the work atmosphere in the Palace had grown fatal. He'd heard that yesterday, an entire division of the Infrastructure Development team had been exterminated after His Majesty heard them talking about him. The worst part was that the Emperor simply overheard the conversation through his mana senses while he was still in Court. The level of paranoia that the Emperor was drowning in was growing more and more severe.</p>\n<p>Jing did not want to be on the receiving end of His Majesty's wrath for something that didn't warrant such explosive action, which is why he had shifted to working from home. This practice had now spread amongst the remaining ministries as well, which had effectively turned the Outer Court into a ghost town. No one knew what happened in the Inner Court, and no one was willing to take the risk to know and propagate any rumours. For a moment, Jing sympathised with the Consorts and Concubines practically imprisoned in the Inner Palace.</p>\n<p>At that instant, a series of knocks interrupted his blank contemplation.</p>\n<p>\"Father,\" a familiar voice still fresh with the spring of youth greeted through the door.</p>\n<p>\"Come in,\" Jing responded as he subconsciously started to clean up the litter of paper scattered across his table.</p>\n<p>The door slid open, to reveal an eighteen-year-old, lean youth. His appearance matched Jing's own in many ways: the curly brunette hair tied into a neat bun, the brown pupil that carried the same listlessness, and the hooked nose. The only difference was that the youth was far thinner compared to his old man, though Jing was nearing the same physique given his poor diet in the past few months.</p>\n<p>\"Ghon, son,\" Jing greeted with a faint smile, \"What brings you here?\"</p>\n<p>Ghon released a long sigh and approached the chair opposite his father's desk, \"I just returned from the Parched Wanderer.\"</p>\n<p>That was the premier watering hole within the Capital, that was often frequented by the next generation of elites.</p>\n<p>\"The Twelfth Prince requested a meeting with you, once again,\" Ghon said with a dour frown.</p>\n<p>Jing slapped the table in fury and bellowed, \"This boy will be the death of me, I tell you! I get that now, more than ever, is the perfect time for the princes to move for a power grab and seize the throne before more damage can be done, but must they include me in this mess?!\"</p>\n<p>\"Well, the support of the ministers does make things easier when it comes to the selection of the Crown Prince and by extension the next Emperor,\" Ghon highlighted. \"However, just like yourself, none of the other ministers are willing to throw in their hat in favour of any of the princes.\"</p>\n<p>\"Then why is this Twelfth brat so stubborn and thick-faced?\" Jing groaned. \"Can he not take the hint?\"</p>\n<p>\"He can, and he does,\" Ghon explained. \"But he knows that he doesn't stand a chance otherwise. He is born to a commoner concubine, without any clan, organization, or sect to back him. The other princes have already started to scheme with the family on their mothers' side, but the Twelfth Prince has nothing. All he has to put on the line is his face, and his life, both of which he is risking to gain an opportunity.\"</p>\n<p>\"Did anyone see you converse with that brat?\" Jing remembered as he snapped his fingers.</p>\n<p>\"He sure tried to make it a public deal,\" Ghon responded with a faint smirk. \"But don't worry father, I was extra thorough. Wouldn't want to get caught up in the undercurrents of Palace politics, especially now.\"</p>\n<p>\"Good lad,\" Jing commended. As he looked at his son, he felt pride swelling up inside. But as the feeling reached its peak, it suddenly deflated and turned into an overwhelming torrent of regret and sorrow.</p>\n<p>\"What's wrong, father?\"</p>\n<p>Jing smiled bitterly and said, \"You know, I worked so hard my entire life, just so that my children would have a better future. I struggled, schemed, and sacrificed much to get to this position. When I was first appointed as the Minister of Finance, I was elated, not because of my achievement but because it meant that my family line would now have a head start and could invest their focus on things that I had to compromise on. As we already have political power and influence, it leaves you with more time to shore up your cultivation and accrues true power. But now, with the way things are going, I fear that I may have driven our family into the maws of a mercurial beast. I'm sorry, son.\"</p>\n<p>Ghon's eyes widened, and he immediately shook his hands and head in denial, \"Please don't apologize, Father. This isn't something anyone could have predicted. Now that it has come this far, all we can do is salvage the situation and ensure our future.\"</p>\n<p>Jing hummed in thought until his son's words struck a chord in his mind, \"It seems that you have something in mind?\"</p>\n<p>A sly smile cracked Ghon's nonchalant face in half. \"Well, it all started a few months before the situation that transpired in the Palace. I happened to catch Little Sister reading one of those serial pulp romance novels that the book peddlers in the lower districts vend. I immediately confiscated them in fear that they would corrupt her innocent mind. But I found something interesting.\"</p>\n<p>Ghon reached into his jacket and brought out three different books with similar typography in their titles. He opened them up to a random page and placed them in front of Jin.</p>\n<p>\"These texts seem familiar,\" Jin murmured. He then snapped his fingers in surprise, \"Wait a minute!\"</p>\n<p>Diving once again into his hastily sorted pile of papers, he retrieved a scroll and unfurled it.</p>\n<p>\"This! The text and typography, it all matched!\"</p>\n<p>\"I found it intriguing that such low-budget literature had such an immaculate script. After some investigation, I was even more intrigued that this feature was common across a large spread of literature on the peddler's stock, AND his stocks were beyond my expectations. After digging even more, I found similar scripts in different books circulating in the middling districts. Now who was this mysterious scribe capable of outputting so much work with such efficiency and consistency? Turns out, it wasn't a human writing the text, but a machine,\" Ghon revealed.</p>\n<p>\"A machine?\"</p>\n<p>\"It is known as the Gutenberg's Press - essentially a printing device capable of pressing ink-coated block typeset and arranged onto a sheet of paper. The machine allows for quick and consistent print and can output a lot of pages in a short time frame,\" Ghon elaborated. \"And so, I purchased the machine through where I work, the Ministry of Rites, since it would allow for a more streamlined communication process. You would no longer need a squadron of scribes to work for multiple days just to write the Court's edicts and decisions to be sent all across the Empire.\"</p>\n<p>\"Amazing!\" Jin congratulated. \"But son, I don't understand where you're going with this.\"</p>\n<p>\"I was just coming to that. You see, I purchased this machine from Charta Industries,\" Ghon revealed.</p>\n<p>\"I've never heard of that, do I know the owner?\"</p>\n<p>\"You probably haven't, since it's relatively new. And as for the owner, well,\" Ghon retrieved a metal plate from his pocket with values engraved into it. \"You're talking to a part-owner of the company. I am technically a 10% owner of Charta Industries.\"</p>\n<p>\"What in the world does that even mean?\" Jin scowled. \"Did you end up getting scammed? How can you own part of a business?\"</p>\n<p>\"The business' overall market capital, which is its worth, is split into shares. I own a per cent of those shares available to be traded. With this, I get a proportional say in the business's future and am entitled to a proportionate share of profits that do not go into moving the business forward,\" Ghon elaborated. \"In fact, I originally owned 25% of the business. I sold the shares to interested parties over time and in the process, accumulated a sizable amount.\"</p>\n<p>\"That is an interesting system. It's somewhat similar to the risk-reward distribution strategy employed by sea-faring merchant coalitions to split the burden on overseas trade ventures,\" Jin noted. \"But I still don't see how this connects to our current predicament.\"</p>\n<p>Ghon chuckled, \"Patience, father. The current Emperor has been growing increasingly paranoid, and it's evident that he distrusts his ministers. With the printing press, I can create a network of communication that bypasses the need for intermediaries. We can disseminate information and rally support from various factions across the Empire without arousing suspicion.\"</p>\n<p>\"A secret network,\" Jin mused. \"But this is risky. If we're caught...\"</p>\n<p>Ghon leaned in, his voice lowering to a whisper, \"That's why we must be careful, discreet, and strategic. We won't be the first to make a move, but when the time is right, we'll have allies ready to support us. It's time to gather like-minded individuals who wish to see stability and prosperity in the Empire. We will be the force that guides the future of the Solar Dynasty.\"</p>\n<p>Jin stared at his son, his heart swelling with pride once more. Despite the dire circumstances, there was a glimmer of hope, a plan that could bring change and preserve their family's legacy. He took a deep breath and nodded firmly.</p>\n<p>\"Very well, Ghon. We shall begin our preparations. This may be the opportunity we've been waiting for.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/rv4wwarc576ln7cgzlip92e\">Chapter 324 - (Interlude) Undercurrents (Part Two)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/wo1xmesc0vxcx6eyb6avtdf\">Chapter 322 - Shifting Interpretations</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}