{"pageProps":{"note":{"id":"cbg3rge1pc7sz2xu8ivnk9c","title":"Chapter 325 - (Interlude) Undercurrents (Part Three)","desc":"","updated":1687539734951,"created":1684410950646,"custom":{},"fname":"volume-5.chapter-325","type":"note","vault":{"fsPath":"vault"},"contentHash":"aaeb287376c7f73530eb9b8e6df4fac1","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-325","id":"cbg3rge1pc7sz2xu8ivnk9c","vaultName":"vault"},"value":"volume-5.chapter-326","position":{"start":{"line":161,"column":3,"offset":12825},"end":{"line":161,"column":27,"offset":12849},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-326"}},{"from":{"fname":"volume-5.chapter-324","id":"rv4wwarc576ln7cgzlip92e","vaultName":"vault"},"type":"backlink","position":{"start":{"line":101,"column":3,"offset":11256},"end":{"line":101,"column":27,"offset":11280},"indent":[]},"value":"volume-5.chapter-325"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-325---interlude-undercurrents-part-three\">Chapter 325 - (Interlude) Undercurrents (Part Three)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-325---interlude-undercurrents-part-three\"></a></h1>\n<p>Furion didn't expect a stopover at the capital on his way to the Draul Duchy down Southeast would result in forming an acquaintance with the Minister of Finance for the entire Empire.</p>\n<p>What surprised him, though, was that he was already connected to the Minister through a degree of separation, namely through his son, whom Furion had met once before in a shareholders' meeting. Ghon was a pleasant lad to talk with - they conversed for hours on end, discussing the myriad ideas Furion wished to pursue in his business career, as well as his and Sect Leader Larks' vision for the future. Ghon exited the conversation that day with an excited smile on his face, and Furion was happy that he'd made a new friend. Only now did he realize that his new friend knew people in very high places.</p>\n<p>\"This tea is exquisite,\" Furion commended while taking a sip of the saffron-infused, steaming liquid. He released a relishing moan as it trickled down his throat.</p>\n<p>\"We're glad that you like it,\" the Minister of Finance, Jing Lorath, responded with an ingratiating smile. This was something Furion couldn't understand. Shouldn't it be the other way around? Wasn't it Furion's prerogative to gain the favour and support of the Minister of Finance? But why did it feel like Minister Jing was the one trying to get into his good graces?</p>\n<p>Furion lowered the cup and scooted to the edge of his seat. \"I want to start off by apologizing for my curtness going forward. I am uninitiated by the subtleties of conversation. As a businessman, I am often forced to get straight to the point and make my thoughts, needs, and wants to be known immediately.\"</p>\n<p>Looking up, Furion was greeted by a strange sight. The father and son exchanged knowing glances before turning to him simultaneously and winking.</p>\n<p>'What in the world?'</p>\n<p>\"Well, I'm sure Mister Ghon will have revealed a lot of details about the Verum Trading Company's business model and affiliates,\" Furion started. \"We follow a novel type of ownership model that provides limited liability to all owners of the business. By essentially listing the business as a separate entity, the owners can isolate themselves from anything they could be charged with when the business does something bad.\"</p>\n<p>\"I am aware of this, yes,\" Jing said with a hum.</p>\n<p>\"Then you must also be aware of the nature of how ownership can be obtained and traded?\"</p>\n<p>Furion received a nod from Jing.</p>\n<p>\"Well, here is where I wish to apologize profusely. You see, I may have led Mister Ghon to believe that I am here to pitch you, Minister Jing, an investment opportunity.\"</p>\n<p>Minister Jing cocked his eyebrows and asked, \"You aren't?\"</p>\n<p>\"No. It wouldn't be fair or moral to strain my connection with your son to extract favours from you. Especially since the power you hold is bestowed upon you to improve the position of the Empire as a whole, not just a select few of its citizens. You see, I'm actually here to propose a possible future for the Empire's economy. A free economy,\" Furion declared with a distant look in his eyes.</p>\n<p>\"That is an interesting term. Did you coin it?\" Ghon pointed out with an appreciative nod.</p>\n<p>\"Oh no! I cannot take credit for that. It is the vision of the Leader of the True World Sect, Mister Guy Larks,\" Furion denied with a frantic shake of his hands.</p>\n<p>When the name was dropped, Furion once again noticed the father-son duo share the same knowing look. They tried to keep it subtle, but it was as clear as day to Furion's now enhanced senses.</p>\n<p>'Something's weird here,' he noted mentally. Although he was excited, he wasn't oblivious. He was a businessman at heart, after all.</p>\n<p>\"What is the future you intend to pioneer?\" Minister Jing inquired.</p>\n<p>\"I will admit that it is a rather heavy ask, and possibly idealistic and naïve. But I am going to convince you today that finding a middle ground with the free market I will talk to you about today will do wonders for the economic health of the nation as a whole,\" Furion started.</p>\n<p>\"The market is a system where buyers and sellers come together to exchange goods and services. From ages past, this sacred stage has defined one of the fundamentals of the human living experience. Humans, unlike animals, can do many things. But this diversity makes it so that someone can't be the best at everything, or have access to everything. In that instance, they can look towards others with the expertise or item they need or want. At this point, we can define the pillar the free market economy is built on. The law of supply and demand,\" Furion raised a finger to pause, reached into his pocket and retrieved a writing utensil.</p>\n<p>Extending it towards Ghon, he asked, \"Would you buy this quill?\"</p>\n<p>\"No,\" Ghon answered casually.</p>\n<p>\"Why is that?\"</p>\n<p>\"I don't want it. I have no use for it right now,\" Ghon followed up.</p>\n<p>\"Now imagine that you are at an impromptu conference. You are listening to lectures from experts but forgot to bring writing utensils and parchment to take notes. If I were to sell this quill to you then, would you buy it?\" Furion inquired.</p>\n<p>\"Sure.\"</p>\n<p>\"Would you buy it for a silver coin?\"</p>\n<p>\"What?\"</p>\n<p>Furion chuckled and said, \"You have no option. If you instruct your servant to make haste and purchase one from far away, it would already be too late, and you would have missed the lecture. The markup you just paid is the price of convenience. In this battlefield, I as the seller get to set the price because I hold the leverage. Furthermore, since my supplies are limited, the cost can be raised even higher since the demand is equally dire as you can't be the only one without stationery.\"</p>\n<p>\"The laws of supply and demand are absolute,\" Furion declared. \"It defines the delicate balance maintained between the supplier and buyer as they reach a consensus on the price of goods sold, holding all other external factors equal.\"</p>\n<p>\"The current economy heavily favours the top 1%: the clans, sects, and businesses that have survived for more than a century. They get to set the market trend and behaviour because their power is absolute. Because of that, however, the ones at the bottom suffer. The price of inert mana cores has quintupled just within the last 2 years, for no good reason. It isn't even that scarce of a resource to warrant such price gouging. As for its uses, it has fewer applications compared to mana gems and is a lot harder to work with.\"</p>\n<p>Minister Jing sighed and said, \"It is because the Emperor and the storied clans do not want another Yoruz Clan in their midst.\"</p>\n<p>\"Yoruz Clan?\"</p>\n<p>\"It is before your time. They were renowned for their prowess in Automagy, a now endangered branch of magic. As you rightfully deciphered, the pricing of inert mana cores is purely selfish in purpose,\" Minister Jing admitted.</p>\n<p>\"If the economy sways to the whims of the few and powerful, then the nation will remain stagnant. Though I will concede that a purely free-market economy may not be the solution either, as a supply and demand-led market will sacrifice the unsung yet important sectors of the market (that are loss-making) in favour of profitable alternatives. To that, I'm talking about safety and security, healthcare, transportation, and so on.\"</p>\n<p>After a pause, he continued orating about the idea, providing valid positives and negatives, as well as listing out possible rollout strategies that the Minister could consider.</p>\n<p>As Furion exited his impassioned speech, once again, he noticed his audience exchanging glances and shooting each other an agitated smile.</p>\n<p>At this point, Furion was affected. He looked at the two of them and said, \"I feel like I'm missing something here. Is there something wrong with what I said? If so, I'll apologize.\"</p>\n<p>\"\"No, no!\"\" Both Minister Jing and Ghon exclaimed. \"We just felt that your insights were quite deep on this matter. Did you say that it was Sect Leader Larks' idea?\"</p>\n<p>\"Not all of it, no,\" Furion corrected. \"Most of those are the Sect Leader's.\"</p>\n<p>\"He must be a knowledgeable man. We would love to make his acquaintance sometime,\" Minister Jing said with a voice that carried a hidden meaning.</p>\n<p>\"Both of you are free to visit, anytime. Our Sect is located near the base of Mount Tai, the huUU- <em>cough</em> largest mountain in the Serrated-Peaks range,\" Furion cringed visibly at his second slip of the tongue today. \"Sorry about that, you see, I had a minor cultivation deviation-\"</p>\n<p>\"I don't believe there is such a thing as a minor deviation,\" Minister Jing said with a chuckle. It was clear that the man thought Furion was joking. Unfortunately, it was the complete truth.</p>\n<p>\"I happened to read a book that had a suspiciously business management-related name. However, the author did not have any conviction in the words they themselves wrote. I assimilated it without doubt as I thought it would be just like any other book I'd read.</p>\n<p>However, the reality was a whole other story. And now, as you can see, I am suffering from the consequences of my rogue curiosity and hubris.\"</p>\n<p>\"So the orange skin and blonde hair?\" Ghon followed up.</p>\n<p>\"Well, it's a mixture of different factors coming into play together. But don't worry, it should return to normal once I advance to the Core Formation realm.\"</p>\n<p>Just as Ghon was about to retort, the servant by the door announced, \"Master, the Young Mistress is here to greet the guest.\"</p>\n<p>\"Why?\" Minister Jing shot back, annoyed by the interruption. The servant shrunk slightly under his master's reprimanding gaze and said, \"This servant failed to ask!\"</p>\n<p>\"I apologize for this spectacle, I have failed to train the help and raise my daughter well.\"</p>\n<p>\"Kids will be kids. Please do not—\" Furion could not finish his words as the door swung open, and through it, a slender girl, a year younger than him, walked through. Her face was drawn on with minimal makeup, but that only accentuated the inherent allure radiating from her face. Her figure was toned and lean, with her natural musculature peeking through the muslin fabric of her clothes.</p>\n<p>\"Furion?\" The girl yelped in surprise, with her impeccable face twitching with unbridled rage. \"I knew it was you from your voice!\"</p>\n<p>\"Milanya?\" Furion responded with equal surprise. \"W-What are you doing here?\"</p>\n<p>\"Me? What are YOU doing HERE at MY house?\" She responded with a growl. \"Did you come here to torment me? And why the heck are you orange?\"</p>\n<p>Furion scratched his head in shame and said, \"I know it's late. But sorry about my behaviour back at the Academy. I was immature and churlish. I know it's hard for you to forgive me, but please know that I am sincerely sorry about everything.\"</p>\n<p>\"You're forgiven,\" the girl responded nonchalantly.</p>\n<p>\"Just like that?\"</p>\n<p>\"Just like that.\"</p>\n<p>\"But... why?\"</p>\n<p>Milanya chuckled and said, \"It was thanks to you and your friends'... 'unorthodox' method of bullying that I was able to secure a decently high score.\"</p>\n<p>\"But my behaviour... I shouldn't have spanked you,\" Furion mumbled.</p>\n<p>\"You did what to my daughter?!\" Minister Jing bellowed.</p>\n<p>\"Father, stop overreacting,\" Milanya said with a click of her tongue as she sat between her father and brother. \"It's just children being children. Besides, look at how apologetic he is. Just forgive him.\"</p>\n<p>\"So what's going on with you?\" She asked Furion. \"And please tell me that there is a good reason for your stupid skin.\"</p>\n<p>\"It's a long story...\"</p>\n<p>\"Time is all I have right now. Since Teacher Snowe's on a trip with her Disciples, I'm left with nothing to do but slow and boring cultivation. Let's go have dinner!\" Milanya suggested before dragging Furion away by his hand.</p>\n<p>\"Little Sister, the meal is being prepared as we speak,\" Ghon offered with a worried frown.</p>\n<p>\"Nuh-uh!\" Milanya vocalized. \"I heard what you guys were talking about from outside. It's so boring! Nope, dinners are already boring with just you two. If Furion is added to the mix, then I'm definitely going to kill myself.\"</p>\n<p>Without waiting for a yes or no, the girl pulled Furion out and disappeared, leaving the father and son alone.</p>\n<hr>\n<p>\"That was unexpected,\" Ghon broke the silence.</p>\n<p>\"But the result was far more favourable than we could've hoped for,\" Jing hummed.</p>\n<p>Noticing his son's inquisitive gaze, Jing chuckled and said, \"We may have to take a leaf out of the Emperor's book. After all, marriage IS proven to be an effective way to forge alliances.\"</p>\n<p>Ghon nodded solemnly and said, \"Would Milanya agree?\"</p>\n<p>\"I won't force her,\" Jing admitted. \"But that doesn't preclude me from orchestrating situations that may result in a closer relationship being formed between those two.\"</p>\n<p>Ghon revealed a satisfied smile. But seconds later, he added, \"That orange skin is really bothersome. I'm trying to overlook it, but it just keeps rattling around in my head. Do you think their kids will have orange skin?\"</p>\n<p>Jing shuddered at the thought of blonde, orange babies running around the house, \"I hope that isn't the case.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/fplrx0mh8qaran0x3vvmw7n\">Chapter 326 - Journey(wo)man</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/rv4wwarc576ln7cgzlip92e\">Chapter 324 - (Interlude) Undercurrents (Part Two)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}