{"pageProps":{"note":{"id":"ect9bi0z4i4zcwfwdpbxlmg","title":"Chapter 268 - Promise Made, Promise Kept","desc":"","updated":1674294140540,"created":1670783758845,"custom":{},"fname":"volume-4.chapter-268","type":"note","vault":{"fsPath":"vault"},"contentHash":"a3a6cea77b479e006751675a36852d63","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-268","id":"ect9bi0z4i4zcwfwdpbxlmg","vaultName":"vault"},"value":"volume-4.chapter-269","position":{"start":{"line":133,"column":3,"offset":10726},"end":{"line":133,"column":27,"offset":10750},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-269"}},{"from":{"fname":"volume-4.chapter-267","id":"49byrfm84ao7lcq9llxrzti","vaultName":"vault"},"type":"backlink","position":{"start":{"line":91,"column":3,"offset":10392},"end":{"line":91,"column":27,"offset":10416},"indent":[]},"value":"volume-4.chapter-268"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-268---promise-made-promise-kept\">Chapter 268 - Promise Made, Promise Kept<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-268---promise-made-promise-kept\"></a></h1>\n<p>Guy immediately centred himself and guided the two children to a nearby restaurant. He found a relatively secluded corner table for three and settled them there. He then ordered some food, a decent assortment of it, seeing the malnourished state of the kids. All the while, the two twelve-year-olds sat in a state of fear, unable to shift even a muscle in front of a mage whose mercy they were in.</p>\n<p>The food arrived within minutes and the kids held themselves like statues. Unfortunately, their stomachs couldn't acquiesce to their brains' demands, as once the pleasant aroma infiltrated their noses, their digestive system revved into action in preparation for the heavenly eats presented before them.</p>\n<p>Guy revealed a warm smile and nudged the bowls forward. \"Eat,\" he said. \"Eat before it gets cold. Don't worry. I just have a few questions. We'll get to it after you've eaten.\"</p>\n<p>The boys showed some apprehension. But their hunger got the better of them. The rate at which they devoured the items worried Guy a bit. He was tempted to break in and warn the kids of the problem of choking on their food but thought against it as he didn't want his behaviour to be misconstrued. He noticed that the boys held deep fear in their hearts for him - that is to say they feared mages. They trembled at his every move, and never looked directly at him - finding ways to avert their gaze without being dismissive.</p>\n<p>\"How did you like this food?\" Guy asked as the blinded boy finished his meal.</p>\n<p>\"I-It was delicious. Thank you so much, Master Mage,\" the boy with sight answered.</p>\n<p>\"Master Mage... sounds so rigid. Call me Guy. Can you tell me your names?\"</p>\n<p>\"H-How dare we, Master Mage-\"</p>\n<p>\"Guy,\" Guy interrupted. \"Call me Guy,\" he repeated with a chuckle.</p>\n<p>Surprisingly, it was the blind boy who took the initiative. \"My name is Yohn.\"</p>\n<p>\"My name is Kevan,\" the second one volunteered.</p>\n<p>\"Yohn and Kevan. Hmm... I remember seeing you two outside the walls. How are your parents doing?\" Guy inquired sincerely.</p>\n<p>This caused Kevan's eyes to widen in surprise. \"Our parents... are doing fine.\"</p>\n<p>The way he elongated that sentence and refused to elaborate held a lot of hidden meaning to it. The responses were curt, it was clear that they did not want to continue this conversation beyond what was necessary. To break through this barrier, Guy would need time. Time to build rapport and trust, time to break down barriers, time to get the kids to open up about themselves, and time to make them feel safe and valued. Unfortunately, time wasn't something in ample supply at the moment.</p>\n<p>\"Well, you see, I'm actually the Sect Leader of the True World Sect. You must not have heard of it, it's quite new. As we've just started, we are looking to recruit new members. Are you two interested in joining us?\" Guy offered while showing the Sect's seal and the official documentation certified by the Alliance.</p>\n<p>Their reactions were well within Guy's calculations. A random person sneaks into your life and presents you with an offer of a lifetime for nothing in return. Suspicion regarding the person's purpose would be totally warranted.</p>\n<p>\"Let me explain,\" Guy halted while raising his hands to stop the kids from denying him outright. \"Let's say that you received an opportunity to learn magic - to walk a mage's path. What would you use this power for?\"</p>\n<p>\"I'd...\" Kevan mumbled. But once again, it was Yohn who spoke first, \"I would use it to protect my family. I would also make it so that we never have to run away in fear ever again.\"</p>\n<p>As though in agreement, Kevan nodded along.</p>\n<p>\"It is an admirable goal. Something I respect. That is why I am willing to offer you this opportunity. I can promise you that you will be able to reach a point where that goal can be satisfied. Beyond that, I will leave it to your imagination. As long as you follow the precepts of our Sect, nothing is impossible.\"</p>\n<p>\"But why?\" The blind boy spat out. The fear and apprehension had left, and what remained was anger. \"Is this some sick game to you?!\"</p>\n<p>\"Yohn-\"</p>\n<p>\"No, Kevan!\" The blind boy swatted away the hand the other boy placed on his shoulder to calm him down. He turned his head in the general direction of Guy and demanded, \"Answer me, why? There are others better than us, with proper dreams and goals, and with the ability to achieve more with magic in their hands. So why us?\"</p>\n<p>Guy hummed audibly as he formed his response, and said, \"It's because I don't like what magic means to them. They intend to use it as a tool of destruction. For you, though, it is a tool for preservation. Those are the kind of people I want in my Sect.\"</p>\n<p>\"We can't,\" Kevan interjected.</p>\n<p>\"If this is because of your affiliation with the Beggar's Sect, then you shouldn't worry about it.\"</p>\n<p>The spoken words fell like bombs in the boys' ears. They flinched visibly, and their eyes darted all around frantically.</p>\n<p>\"Since they aren't aligned with the Sect Alliance, you are only a part of that organisation in name. We, however, are aligned with the Alliance and your membership with us has a layer of legal binding that secures your position.\" </p>\n<p>Noticing the unchanged scepticism on their faces, Guy sighed and added, \"I know that you still can't trust me. So let me give you some more practical assurances: until our Sect passes the preliminary audit, we cannot undertake any underhanded or grey tactics that could violate the Alliance's or the Empire's laws.\"</p>\n<p>This did turn the kids' opinions slightly. To them, the legally binding nature of the relationship mattered a lot. If their existence was above board and insured, they wouldn't have to put up with all the dirty business the Beggars' Sect puts them up for.</p>\n<p>\"What of our families? We cannot just leave them here,\" Kevan pointed out. At least he was considering it.</p>\n<p>\"They will have to relocate to the location of the Sect,\" Guy responded. \"The Sect offers a relocation package and sufficient help to set them up at the destination. But beyond that point, we expect them to be self-sufficient.\"</p>\n<p>The kids appeared dazed at the extent of the offer.</p>\n<p>\"Oh! I remember there were a few more of you. The offer extends to them as well. Tell them exactly as I've told you. Meet me here same time tomorrow. Those that are interested can register with me.\"</p>\n<p>Guy looked over the boys' shoulders and called for the waitress, \"Can you pack up another round of the same?\" He turned to the boys and said, \"Share it with the others.\"</p>\n<p>The boy's received the gift of food and prepared to leave.</p>\n<p>\"Where did they do this to you?\" Guy asked Yohn while trying to keep the steeliness in his voice from eking out.</p>\n<p>Yohn froze. He turned his body to follow Guy's sound. \"Three blocks down, there is an alleyway. It is guarded. They will flee at the first sight of danger.\"</p>\n<p>Guy nodded before adding. \"Your goals. They are admirable. But incomplete. You did not tell me the third.\"</p>\n<p>Yohn's expression hardened.</p>\n<p>\"The path you intend to walk is of vengeance. What they deserve to receive is justice.\"</p>\n<p>\"If the world was fair, justice would have been dealt many, many years ago. But they still continue to do what they've always been doing!\" Yohn spat back.</p>\n<p>\"You have lost much,\" Guy empathised. \"But if you continue to walk down this road, you will only lose more. You stand at a crucial crossroads in your life. To achieve your revenge, you will need to sacrifice parts of yourself until nothing remains but a husk of your former self. No amount of retribution can fill in that void.\"</p>\n<p>\"Are you asking me to forgive them?\" Yohn voiced his hurt.</p>\n<p>\"Never forgive them,\" Guy responded decisively. \"But do not let them decide your life for you. They will receive what they deserve.\"</p>\n<p>\"And how exactly will that be?\" Yohn challenged. \"Will you do it?\"</p>\n<p>At that moment, Guy's expression turned solemn. His lips parted, and a voice escaped that sounded a lot like him but carried an imperious and detached tone.</p>\n<p>\"If I must,\" the voice promised. And just as it came, it disappeared. Guy's eyes narrowed in confusion. That was not what he wanted to say. But those words were enough to satisfy the boy filled with rage. He grasped Kevan's oversized sleeves and followed along as the still-seeing boy guided him out of the restaurant.</p>\n<p>Guy did not waste any more time and left the establishment. He followed Yohn's instructions and walked down the road. Three blocks down, he stood in front of the dark alleyway.</p>\n<p>Guy hesitated. In his past life, he'd confronted many organisations that performed heinous crimes against children. Trafficking, mutilation, and conscription, to name a few. However, he was never alone in opposing them. He had the backing of legal authorities and the media. The organisation he was about to face was ancient and deeply rooted.</p>\n<p>\"What do I do?\" Guy muttered out loud.</p>\n<p>What was his purpose here? He promised justice to that boy, but how was he to go about and achieve it? He didn't know the Beggar's Sect; his knowledge was solely through secondary sources and rumours. How strong were they? How deeply entrenched with the government were they?</p>\n<p>While Guy was waddling through the mire of indecisiveness, within the RoK in his soul, a pair of ethereal hands extended out of the dark crack beneath the table where the mask lay. The hands grabbed the edges of the crack and pulled it apart widening it.</p>\n<p>At that instant, Guy blacked out.</p>\n<p>A blink, and suddenly an overwhelming amount of data assaulted his senses.</p>\n<p>The smell of shit and rot. The sound of people, crying, moaning, shrieking, yelling...</p>\n<p>Guy grabbed his head to stabilise the discomfort.</p>\n<p>\"Where am I?\" Guy muttered. \"This place...\"</p>\n<p>He was in an alleyway. But it was not the same one he was standing in front of earlier... before he blacked out. The buildings were tight and dilapidated. The rot had set into the wood, and it was all being held together rather precariously. The ground was unstable with wet mud, and a debilitating dankness hung in the surrounding air. Behind him, there was a sturdy metal door, of a quality that did not match the general ambience.</p>\n<p>His hands pushed against the door, nudging it open.</p>\n<p>He took a step into the darkness beyond, and his feet collided with something soft. Guy used his mana sense and noticed that it was a person- No-</p>\n<p>It was a corpse...</p>\n<p>Its face was warped with agony, but its eye sockets were empty. The orbs that were supposed to be housed in those empty sockets were grasped safely in both of the corpse's hands, blood dripping out of them.</p>\n<p>Guy extended his senses further out, and he was greeted with the sight of a brutal gathering of corpses. All with their faces warped in agony and fear. All with their sockets devoid of eyes. All with their eyes grasped firmly in their palms.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/hksiw6gxb4q6npbct7vkj0e\">Chapter 269 - The Abyss Stares Back</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/49byrfm84ao7lcq9llxrzti\">Chapter 267 - Getting Around an Embargo</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}