{"pageProps":{"note":{"id":"eMXrUHKStPvPB9NexHCXZ","title":"Chapter 112 - See Men on My Skin","desc":"","updated":1643657387445,"created":1643655183229,"custom":{},"fname":"volume-2.chapter-112","type":"note","vault":{"fsPath":"vault"},"contentHash":"7c3581da88806baf384f142affedd6fb","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-112","id":"eMXrUHKStPvPB9NexHCXZ","vaultName":"vault"},"value":"volume-2.chapter-113","position":{"start":{"line":129,"column":3,"offset":12134},"end":{"line":129,"column":27,"offset":12158},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-113"}},{"from":{"fname":"volume-2.chapter-111","id":"tHEVjUxWvDGZEdBhkuCBz","vaultName":"vault"},"type":"backlink","position":{"start":{"line":129,"column":3,"offset":11086},"end":{"line":129,"column":27,"offset":11110},"indent":[]},"value":"volume-2.chapter-112"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-112---see-men-on-my-skin\">Chapter 112 - See Men on My Skin<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-112---see-men-on-my-skin\"></a></h1>\n<p>Nonetheless, the near-perfect visual offered tonnes of opportunities for the two students to gain a plethora of varied insights that they would have missed through the usual investigative methods. For instance, after removing some of the flaking skin cells from the surface, the two were able to closely observe the process of Mitosis in skin cells.</p>\n<p>\"As you can see, the old skin cells underneath create a copy of themselves through Mitosis and push themselves higher until they reach the surface. With skin, it usually takes about a day for this process - so this representation is obviously accelerated to make it easier for you guys to understand,\" Guy elaborated.</p>\n<p>\"This process is similar with other organs and body parts as well. The old cells replicate themselves and fall off, and new cells take their place.\"</p>\n<p>Markus raised his hands and asked, \"Master. If that is the case... Does that mean that once all the cells of the body are replaced following a single Mitosis cycle... We become a completely new person?\"</p>\n<p>\"That is an interesting question, Markus. There is actually a parable that discusses this line of reasoning. The thought experiment goes as follows: Let's say that you own a ship. It's been passed down through the ages from ancestor to ancestor, and it has finally fallen into your hands. Every generation, a part of the ship fails due to age. The ancestor that owned the ship at that time fixed or replaced the part to bring the ship back into working condition. This pattern continues until it reaches you, by which time the ship has been technically remodelled completely. Now the question remains: Is the ship in your possession, the same ship that's been in your family's possession since the start?\"</p>\n<p>\"It has to be!\" Jean answered.</p>\n<p>\"And why is that?\"</p>\n<p>\"Because once a new part is added to the ship, it essentially becomes a part of the ship itself. Besides, the ship's identity isn't tied to its external appearance, it's what is within that matters,\" She continued.</p>\n<p>\"Can we extend this to sentient beings? Can I replace every single part and organ in my body, and still be considered Guy Larks?\"</p>\n<p>\"That...\"</p>\n<p>\"That would be impossible,\" Markus interjected. \"There are some organs that you just can't replace without losing your identity.\"</p>\n<p>\"Such as?\"</p>\n<p>\"The brain, for one!\"</p>\n<p>\"But the brain DOES naturally replace itself, cell by cell. What about then?\"</p>\n<p>This time, Jean chimed in, \"Technically, it creates a copy of itself. So it isn't being replaced.\"</p>\n<p>\"By that logic, if I can grow a copy of my brain outside my body, and then switch my existing brain with that one, I will still remain the same person?\"</p>\n<p>That question elicited an extended pause from his students.</p>\n<p>\"It's fine to not know the answer to some questions. Sometimes, these incisive questions and thought experiments are simply there to make you think and consider your actions more carefully. By scientific reasoning, it is possible to test the theory by literally growing a copy of someone's brain and performing a transplant. Given the nigh unlimited possibilities provided by magic, I believe it is well within our limits to do so. But is it the right thing to do?\"</p>\n<p>Guy paused to let the thesis sink in before elaborating, \"Science is driven by reason and objectivity. Every question has an answer given sufficient depth of study. Magic makes it infinitely easier to do so. BUT! In our pursuit of the objective truth, if we lose track of our humanity, what inhibits society from degenerating into chaos? That is where we must evaluate the morality and ethicality of our works. I know that this explanation is a huge tangent from our lesson's focus, but it warrants consideration especially since you guys are starting off in the path of magic where lines can get blurry.\"</p>\n<p>At that point, Jean hurriedly raised her hand and inquired, \"It is known that as you advance through your cultivation, the body is enriched as well as the core. In that process, how does it affect cell division? Would it elongate the duration?\"</p>\n<p>\"That is an interesting hypothesis, Jean. I haven't looked into it. If you are interested in it, I encourage you to pursue this line of questioning. If you can share your findings with all of us, that would be even better!\" Guy answered.</p>\n<p>Right as he finished the sentence, he noticed Jean entering some form of an excited stupor. Although her face didn't show it, Guy could feel the perturbations inside her.</p>\n<p>All of a sudden, right as her aura started to settle, Guy felt a slight rush of mana circulating within him. It only lasted for a brief moment, but it was enough for Guy to understand the underlying effect.</p>\n<p>'It's like... I'm cultivating?!' He exclaimed to himself.</p>\n<p>It was almost the same kind of feeling Guy - the one before the transmigration - used to feel when he cultivated his Way of the Burning Fist, barring a few differences in the mana circulation. Furthermore, as Guy wracked his mind, he realised he had experienced the same feeling when he was under the \"other guy's\" influence in trying to elucidate Markus. At that time, his mind wasn't focused on that feeling. He sort of just let it flow through him naturally that time.</p>\n<p>'It's feedback! My cultivation is based on the feedback I get when my students grasp insights through my |Soul Imprint|!' Guy hypothesised. Along those lines, Guy also noticed that the feedback he received in enlightening Jean was far inferior to his session with Markus. This could be indicative of two factors. First, the insights transmitted and grasped through the use of the mask and the \"other guy\" were superior to his current method. Second, the breadth of advancement could affect the amount of feedback Guy would receive through the |Soul Imprint|.</p>\n<p>To the latter, it could be that advancing between realms would offer greater feedback than minor insight absorption. Furthermore, the difference between Guy and the student could also affect the amount. For instance, at that time Markus and Guy were in the same realm. When Guy performed his |Soul Imprint| and helped Markus achieve a breakthrough to perfect resonance, the feedback was amplified. But now, since Jean was barely within Early stage Mana Condensation realm, and Guy was already in the Base stage Foundation Establishment realm, the separation was too vast.</p>\n<p>Of course, all of this was just speculation on Guy's part for the time being. He was looking forward to testing his hypothesis further to figure out the kinks of his self-made \"system\".</p>\n<p>After a short pause, Guy spoke up, \"Let's move to the second location. Everyone, back to the school bus!\"</p>\n<hr>\n<p>The next stop took the group to a place inside the body. The ambience was markedly darker, and the only source of light that illuminated the area were the unusually bright headlights of the school bus. The walls of the area would undulate, expand and contract, and had a pinkish-red and sticky coating.</p>\n<p>\"How much longer, Master?\" Markus asked. They had been here for quite some time now, and the two were feeling a little antsy and claustrophobic.</p>\n<p>For a minute, Guy didn't answer. His face contorted with an embarrassed expression, before settling with a wry smile. He would have loved to take the students out of the bus, but this part of the trip had been recreated not from experience, rather from recollection. The environment wouldn't be as realistic as before and it would seriously detract from their learning experience. Furthermore, the scenario Guy had envisioned to recreate was a bit...</p>\n<p>All of a sudden, the entire area started to jerk back and forth.</p>\n<p>\"\"WOAH!\"\" The students exclaimed. \"Wear your seatbelts and hold on tight you two!\" Guy reminded. Thankfully, the school bus was somehow thoroughly fastened to the walls of the chamber.</p>\n<p>The back and forth jerking motion didn't subside, in fact, it started to grow increasingly vigorous.</p>\n<p>\"M-Master, what is happening?\"</p>\n<p>Then, with a large, forceful crash, the jerking motion stopped. As it did, the group suddenly saw a milky-white viscous fluid flooding into the room. Upon closer inspection, the students observed a horde of strange-looking tadpole-like creatures swimming through. They had an oval, translucent head and a lean, rapidly serpentining tail. </p>\n<p>Jean was the first to notice a few similarities between those tadpoles and the skin cells she'd seen earlier.</p>\n<p>\"Are those cells too?\" She asked Guy, to which he nodded. \"What kind of cells are those?\" She evoked in a low volume.</p>\n<p>Guy didn't answer and just called the school bus into action to follow the swimming horde. At the end of the chamber, the swimming group split in two. Through a strange intuition, Guy chose to follow the group that split to the right and moved with them through a narrow tunnel.</p>\n<p>After a short ride, the bus turned around a bend and came face to face with a massive cell. It was many times larger than the swimming cells and the skin cells the group had seen before.</p>\n<p>\"What is this cell?\" Jean vocalised. </p>\n<p>The bus had overtaken the swimmers while moving through the tunnel. Just a few seconds later, the horde lagging behind them burst around the bend and rushed towards the massive cell.</p>\n<p>\"What are the-\" Before Jean could finish, the swimmers dove headfirst through the membrane of the cell. \"They're eating it!\"</p>\n<p>\"W-We need to save it!\" Jean exclaimed, forgetting that everything around her was just an illusion.</p>\n<p>Within seconds, one of the leading swimmers managed to eat its way towards the nucleus of the larger cell and merged with it. As it did so, the membrane of the larger cell started to turn visible tighter, disallowing any other interlopers from breaching through. The ones that did manage to gain entry apart from the one that merged slowly died away and were ejected.</p>\n<p>\"\"What just happened?\"\" Markus and Jean asked.</p>\n<p>\"I was hoping to show Meiosis, but...\" Guy finally answered with heavy dread and embarrassment in his voice.</p>\n<p>His two students looked at him with a confused expression. To them, the event that transpired was just like if a bucket of chum was dropped into a lake filled with fish. It was a legitimate feeding frenzy!</p>\n<p>\"Let's follow this one,\" Guy added and turned the bus to shadow the floating large cell as it traversed back through the tunnel. Along the way, they noticed a few \"corpses\" of the dead swimmers.</p>\n<p>The large cell floated through the tunnel and finally attached itself to the wall of the larger chamber they were in before.</p>\n<p>Little by little, the cell started to divide and multiply.</p>\n<p>\"They don't seem to be dying as quickly,\" Jean commented. \"What exactly are these cells.\"</p>\n<p>\"It's a zygote. Do you remember what a zygote is?\" Guy inquired.</p>\n<p>Jean narrowed her eyes slightly as she worked her memory. Suddenly, the information flooded her mind.</p>\n<p>\"A zygote? T-then what happened before....\" Jean's face started to turn a sharp shade of crimson as the realisation struck her like a rogue carriage.</p>\n<p>\"What about what happened before?\" Markus inquired. \"Jean! Your face! It's turning red again! Are you sick?\" Markus instinctively reached forward and placed the back of his palm on the girl's forehead.</p>\n<p>Jean quickly ducked and dodged the approaching hand and scooted further into the seat, towards the window, and turned her head away in embarrassment.</p>\n<p>\"What's wrong?\" Markus muttered. But then his eyes looked out and he gazed at the rapidly growing cell cluster. It started as a shapeless blob, and then quickly started to gain some clarity. First, the cluster turned into a bean-like shape, with one arc growing larger and larger. From the lower arc, noodle-like extensions started to grow out. These extensions started to become more defined and looked like appendages over time. Right as the upper arc formed a distinct face, Markus' mouth opened wide in surprise.</p>\n<p>\"It's a baby? Aaaaaa... Wait! So then what happened before...\" It was now Markus' turn to colour himself crimson, as he receded into his jacket.</p>\n<p>While this was happening, Guy started receiving a small amount of feedback in the form of cultivation. However, he couldn't enjoy it, as he shoved his face into his hands in embarrassment.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/gQirAFmzmRyjRi3kciHWt\">Chapter 113 - Embarrassing Aftermath</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/tHEVjUxWvDGZEdBhkuCBz\">Chapter 111 - Mini Field Trip</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}