{"pageProps":{"note":{"id":"f04aWQHLrWcwjp353sJQD","title":"Chapter 011 - Wei Zao the 1-star Alchemist","desc":"","updated":1643571878941,"created":1643481836333,"custom":{},"fname":"volume-1.chapter-011","type":"note","vault":{"fsPath":"vault"},"contentHash":"2aa24de06a9e2f37860d439e2e52c5c1","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-011","id":"f04aWQHLrWcwjp353sJQD","vaultName":"vault"},"value":"volume-1.chapter-012","position":{"start":{"line":131,"column":3,"offset":11208},"end":{"line":131,"column":27,"offset":11232},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-012"}},{"from":{"fname":"volume-1.chapter-010","id":"vI3z3g6HxX5pgldIPPEpL","vaultName":"vault"},"type":"backlink","position":{"start":{"line":111,"column":3,"offset":10484},"end":{"line":111,"column":27,"offset":10508},"indent":[]},"value":"volume-1.chapter-011"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-011---wei-zao-the-1-star-alchemist\">Chapter 011 - Wei Zao the 1-star Alchemist<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-011---wei-zao-the-1-star-alchemist\"></a></h1>\n<p>To partially awaken the Abyssal Wyrm’s bloodline within Gaige. The most optimal strategy would be to brew a Bloodline Partial-Awakening potion with an Abyssal Wyrm’s vitality base. These vitality bases could be in any form as long as they held the bloodline's fragment.</p>\n<p>Initially, Wei Zao was planning to source out an Abyssal Wyrm scale, even a tiny sliver of it. But finding an Abyssal Demon nail shaving caused him to completely change his initial plan.</p>\n<p>In his Omniscient Library, there was a recipe for the Bloodline Partial-Awakening potion listed under Gaige’s information. This recipe was formed once Wei Zao assimilated the books from the academy and the alchemy guild. As soon as he touched the Abyssal Demon nail shavings, the recipe updated and another variation was provided. The only difference was that this new recipe was a little volatile and utilised a lot more ingredients to mould the vitality fragment in the nail shavings to fit the Abyssal Wyrm’s bloodline.</p>\n<p>As he scanned through the list of ingredients, Wei Zao was a little relieved. All of them were readily available in this storage facility. Furthermore, with the highly detailed instructions, Wei Zao was confident that he could brew the potion. The best part was that he wouldn’t even have to shell out any money. This was a double whammy!</p>\n<p>Without wasting any more time. Wei Zao carefully collected all the required ingredients and moved towards the testing hall.</p>\n<p>Beyn and Eida decided to monitor the test as well. Eida was a little resigned at the new developments. She didn’t expect Wei Zao to pull such a stunt. In fact, she too was kind of looking forward to gaining a promising apprentice. But after the recent fuss, she wrote Wei Zao off. The man wasn't worth the trouble.</p>\n<p>Beyn was simply there to watch an interesting spectacle unfold. </p>\n<p>Unexpectedly, he saw the subject in question walk in with a hodgepodge of ingredients. Beyn nearly lost his shit right there! What the hell was the man doing?</p>\n<p>Silently, Beyn prepared his retardant talismans for a possible catastrophe. Alchemist Rao was practically sweating a river at that sight. But he chose to keep quiet as the manager hadn’t said anything yet.</p>\n<p>Once all the candidates were prepared, alchemist Rao signalled the start of the test.</p>\n<p>Beyn had his focus completely on Wei Zao. He wanted to see what the man was going to do and be ready to respond to any dangers at a moments notice. He was not going to have the guild building collapse under his watch!</p>\n<p>The first thing Beyn saw was the young man staring out into space blankly. Beyn was slowly growing impatient. It was almost as if he was watching a ticking time bomb.</p>\n<p>‘Move, damn it!’ Beyn cursed inwardly.</p>\n<p>Almost on queue, Wei Zao slipped out of the trance and started working with a firm expression. First, he lit up the burner under the standard brewing crucible. Most training crucible nowadays had a magic apparatus that read the temperature inside them. Gone were the days of alchemists eyeballing the conditions of their crucibles.</p>\n<p>As the crucible was heating up, Wei Zao filled it up with distilled water based on the amount listed on the recipe.</p>\n<p>Watching the man work, Beyn was a little assuaged.</p>\n<p>‘At least he is being a little methodical and not throwing all the ingredients inside at once.’</p>\n<p>But Beyn couldn’t finish that thought. Because not a second after the water reached boiling point, Wei Zao unceremoniously tossed three-quarters of the ingredients on his side into the crucible.</p>\n<p>Beyn’s words were stuck in his throat. He was prepared to evacuate the testing room. He saw the crucible shake violently, it was a sign of an imminent explosion.</p>\n<p>Bracing for impact Beyn circulated the mana inside his body and reinforced his muscles. He then started chanting an impromptu warding spell to protect Eida and his colleague.</p>\n<p>Right before the crucible reached the point of no return, Wei Zao added the rest of the ingredients barring the Abyssal Demon nail shavings.</p>\n<p>As the newly added ingredients entered the mix, the vibrating crucible stopped shaking, until it reached a standstill.</p>\n<p>It was at that moment that Beyn realised what had happened. He started to recollect the list of ingredients the man brought with him and the entire process. The ingredients were clearly for a Bloodline Partial-Awakening potion as well as a vitality cleansing and reconstructing catalyst. Noticing the Abyssal Demon nail shavings remaining on the table, the complete picture dawned in Beyn’s mind and he involuntarily exclaimed, “He’s forging a Bloodline Partial-Awakening potion for a darkness aligned bloodline!”</p>\n<p>Eida and alchemist Rao turned their heads in surprise.</p>\n<p>“But that’s a peak 1-star potion!” Eida added.</p>\n<p>Alchemist Rao nodded in agreement. He reassessed the blasé young man’s earlier actions.</p>\n<p>“He definitely has a strong foundation. But I think his brewing technique is a little mechanical,” Rao commented.</p>\n<p>“It’s obvious that he hasn’t brewed this potion before. Actually, the way he is handling the crucible and the other equipment indicates that he probably hasn’t brewed many potions either,” Beyn nodded in agreement.</p>\n<p>With a final flourish, Wei Zao added the shavings and doubled the heat. Slowly, the liquid in the crucible started evaporating. After a measured minute and a half, Wei Zao extinguished the burner and allowed the concoction to settle.</p>\n<p>Once the fluid cooled down to a handleable temperature, Wei Zao retrieved four containers with stoppers and carefully poured the potion into them.</p>\n<p>“Such a high yield! Alchemist Rao, once this is finished, I want you to go and take note of the ingredients the young man used. There were a few new combinations I have never seen before. The brewing method was fairly basic, so I guess that those new combinations somehow increased the yield,” Beyn pointed out.</p>\n<p>Wei Zao collapsed onto the seat next to him and started to inspect the potions. The Omniscient Library provided an evaluation on them. Only one out of the four gained a high rating, while the other three were only satisfactory. Wei Zao sighed in relief and carefully closed the stoppers.</p>\n<p>He then approached the examiners.</p>\n<p>He said, “I’ve brewed a Bloodline Partial-Awakening potion for the Abyssal Wyrm bloodline. Please take a look,” and handed the four containers.</p>\n<p>The three alchemists carefully opened each container and inspected the potion inside. Alchemist Rao and Beyn were more knowledgeable than Eida in this matter and were able to immediately discern the quality of the potions following a cursory evaluation. Eida performed a series of tests to determine the efficacy and potency of the potions, and she too was surprised after the fact.</p>\n<p>“Such a wonderful concoction. All of them are of good quality. But this one in particular is perfect. Young man, you could earn a fortune with this one if you auction it!” Alchemist Rao exclaimed.</p>\n<p>“Wonderful! Marvellous! I know this goes against protocol, but congratulations on gaining a 1-star licence, Alchemist Way,” Beyn added.</p>\n<p>“Would you like to sell them through our guild? You will receive 90% of the profits from your sales?” Beyn asked.</p>\n<p>Wei Zao was a little shaken by the fact that he could earn a fortune with the sale of the high-quality potion. He was extremely tempted to do it, but he remembered his original purpose. And so he replied, “Apart from the perfect potion, I would like to sell the rest.”</p>\n<p>Eida sent over a questioning gaze.</p>\n<p>“You see, my original intention to enrol into the Alchemy guild was to get a Bloodline Partial-Awakening potion for my student,” He added.</p>\n<p>The faces of the three alchemists softened when they heard Wei Zao's full explanation and purpose in pursuing an alchemy license.</p>\n<p>“I am envious of your student for having such a diligent and caring teacher,” Beyn commented in admiration.</p>\n<p>Alchemist Rao said, “Yes. Back when I was a student in the Radiant Academy, my teacher never even looked at me. My aptitude in cultivation was quite poor, my strengths lay in alchemy. But he didn't even bother to evaluate my potential properly.”</p>\n<p>Beyn carefully packaged the perfect-quality potion and handed it over to Wei Zao. While doing so, Beyn said, “Come over tomorrow to get your official 1-star certification. Once you have it, you will be recognised in any of the alchemy guild branches across the world. And if you have any problems or queries, make sure to ask my daughter Eida here. She is also a 1-star alchemist who is about to take the 2-star certification test. I saw that you are lacking experience in brewing. Don’t hesitate to ask her for guidance, I have taught her everything personally.”</p>\n<p>Wei Zao turned to Eida and flashed a bright smile and bowed. “Then I will be in your guidance ma’am.”</p>\n<p>Eida blushed and waved her hand.</p>\n<p>Since Wei Zao had accomplished his goal, and that too in a single day, he was in an uplifted mood.</p>\n<p>When he exited the building, he saw that the sun was nearly setting.</p>\n<p>‘I guess Gaige’s probably back at his dorm.’</p>\n<p>He then started to make his way into the student’s quarters.</p>\n<p>Gaige had called it an early day and was in his room trying to cultivate. Even after failing continuously, Gaige was tenacious and refused to give up. </p>\n<p>Teacher Way had said that he would find a way to help him out. In the beginning, Gaige was excited. Wei Zao even said that he had an Abyssal Wyrm’s bloodline. Although he was sceptical, the details Wei Zao went into during the recruitment were too convincing as a lot of the symptoms he described, even some obscure ones that popped up near his genitals, matched up. </p>\n<p>But after asking around, he found that teaching apprentice Jo Way was an infamous figure for messing up a student’s cultivation.</p>\n<p>That key fact caused Gaige to rethink his decisions. He was tempted to drop out of Wei Zao’s tutelage, but he decided to hold out.</p>\n<p>Gaige had a strong sense of righteousness. Ever since a young age, he just couldn’t take it when someone was being wronged. He was holding out to see whether the rumours on Wei Zao were true. If the “help” his teacher provided was crooked in any way, Gaige was prepared to report him to the management and have him fired.</p>\n<p>While Gaige was contemplating on his next plan of action, a series of knocks interrupted his thoughts.</p>\n<p>‘Who could it be at this time?’ Gaige scratched his head.</p>\n<p>As if answering his doubts, Wei Zao’s voice resounded from the other side, “Gaige! It’s me! Teacher Way.”</p>\n<p>Gaige opened the door. He wanted to ask Teacher Way why he was visiting him so late. But he didn’t get an opportunity to voice it out, as the other man quickly shoved two items into Gaige’s empty arms.</p>\n<p>Wei Zao then rattled out a series of instructions, “That right there is a cultivation method aligned to your specific constitution. And this is a Bloodline Partial-Awakening potion for the Abyssal Wyrm bloodline. Drink the potion and practice this cultivation method. Don’t go back to your old one, that will cause irreversibly harm to you. Once you’ve done that, meet me tomorrow at the sparring yard. Alright, so I’m gonna go,” and simply left.</p>\n<p>Gaige remained standing at his doorstep with a blank look on his face.</p>\n<p>‘What the hell just happened?’</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/dEUhtO17djbk4i8FwUutI\">Chapter 012 - Teacher's Vow</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/vI3z3g6HxX5pgldIPPEpL\">Chapter 010 - Wei Zao the Genius</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}