{"pageProps":{"note":{"id":"go97ibet1jf7w7h7awv2a0c","title":"Chapter 293 - Hopeful but Helpless","desc":"","updated":1679549437954,"created":1676868066055,"custom":{},"fname":"volume-4.chapter-293","type":"note","vault":{"fsPath":"vault"},"contentHash":"fc8cbda3e1784613c83d6431ca718cd4","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"tags.It","alias":"#It","position":{"start":{"line":62,"column":1,"offset":7150},"end":{"line":62,"column":4,"offset":7153},"indent":[]},"xvault":false,"to":{"fname":"tags.It"}},{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"tags.Precious","alias":"#Precious","position":{"start":{"line":66,"column":1,"offset":7826},"end":{"line":66,"column":10,"offset":7835},"indent":[]},"xvault":false,"to":{"fname":"tags.Precious"}},{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"tags.If","alias":"#If","position":{"start":{"line":70,"column":1,"offset":7995},"end":{"line":70,"column":4,"offset":7998},"indent":[]},"xvault":false,"to":{"fname":"tags.If"}},{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"tags.Speaking","alias":"#Speaking","position":{"start":{"line":72,"column":68,"offset":8202},"end":{"line":72,"column":77,"offset":8211},"indent":[]},"xvault":false,"to":{"fname":"tags.Speaking"}},{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"tags.What","alias":"#What","position":{"start":{"line":80,"column":1,"offset":8688},"end":{"line":80,"column":6,"offset":8693},"indent":[]},"xvault":false,"to":{"fname":"tags.What"}},{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"tags.H-HOW","alias":"#H-HOW","position":{"start":{"line":86,"column":1,"offset":8899},"end":{"line":86,"column":7,"offset":8905},"indent":[]},"xvault":false,"to":{"fname":"tags.H-HOW"}},{"type":"wiki","from":{"fname":"volume-4.chapter-293","id":"go97ibet1jf7w7h7awv2a0c","vaultName":"vault"},"value":"volume-4.chapter-294","position":{"start":{"line":99,"column":3,"offset":9953},"end":{"line":99,"column":27,"offset":9977},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-294"}},{"from":{"fname":"volume-4.chapter-292","id":"mo9ojkj4mns8v9rleubsc1m","vaultName":"vault"},"type":"backlink","position":{"start":{"line":105,"column":3,"offset":9479},"end":{"line":105,"column":27,"offset":9503},"indent":[]},"value":"volume-4.chapter-293"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-293---hopeful-but-helpless\">Chapter 293 - Hopeful but Helpless<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-293---hopeful-but-helpless\"></a></h1>\n<p>Guy wasn't an expert in magic. His knowledge about the subject and everything it encompassed was severely limited and spanned only what the previous inhabitant of the body knew, as well as what he could gather through his own self-study. He wasn't \"classically trained\" in magic, not to a degree where he could boast about his expertise in the field, at least. Furthermore, the system-slash-golden-finger gifted to him by Mast did little to bolster his knowledge of magic. All in all, Guy was no better than your \"Average Joe\" except possibly with a far superior ability to recollect information. Sure Guy had his ingenuity and otherworldly thought processes, but how much did that really contribute towards his technical competency?</p>\n<p>As he stood facing the convulsing body of his most peace-seeking student and the disease-riddled and near-death body of her attendant, Guy was faced with a troublesome predicament. What was he to do?</p>\n<p>The girl had forcefully absorbed the cultivation of a being far above her weight class with a concept contradicting her own. Guy had enough context to know what stood at the end of the line for Jean. He wasn't so misguided to think that she would somehow snag the near minuscule probability of hitting the jackpot and making successful breakthroughs like in some brain-dead young-adult novel. Just looking at the odds, Jean's demise might as well be written in stone.</p>\n<p>So much for being a Sect Leader, he couldn't even save his Sect's members...</p>\n<p>'There's a battle raging inside her,' the Other Guy's voice reverberated in Guy's head with a thoughtful hum.</p>\n<p>'Is there nothing we can do?' Guy asked in a panic. He was helpless and desperate. He recognised his uselessness, his inadequacy, and his assumed arrogance - he'd let his victories get to his head. At this point, he was willing to rely on even the faintest of hopes to save Jean.</p>\n<p>'Maybe not US, but I sure can,' the Other Guy said with a self-assured snort.</p>\n<p>'This isn't time to play games!' Guy snarled with anger bubbling over.</p>\n<p>'Are you sure you want to go through with it?' the Other Guy probed. 'You may not like the outcome-'</p>\n<p>'If Jean lives and makes it through this ordeal intact, I don't care what happens to me!' Guy declared resolutely. He overlooked the irony of how the tables had turned - just a while back he'd been lobbying for his counterpart to regress and hand over control to him. But Guy was faced with his greatest weakness - children. He was willing to do anything for them!</p>\n<p>'So be it,' the Other Guy declared. 'Brace yourself, but do not resist!'</p>\n<p>Guy barely had a second to register the warning before a torturous pain coursed through every inch of his body. This wasn't physical in nature - even during the milliseconds of clarity he could gather between the cyclic peaks of misery, he couldn't pinpoint the exact location where the pain originated. It was everywhere, yet nowhere.</p>\n<p>Deep within Guy's soul, in the otherworldly compartment known as the Repository of Knowledge, an unimaginable event was taking place. At the centre of the RoK, where the crack had formed, two hands reached out through the tear. The hands grasped each side of the cut firmly and, with a forceful thrust, cleft the space in two. The crack extended outwards and grew wider, and the world folded, warped and split all at once. The concept of dimensionality ceased to make any sense as the curtains between two worlds were torn, allowing the two to intertwine.</p>\n<p>The Church and RoK were becoming one and the surroundings rippled like the surface of a disturbed lake as one change after the next took hold.</p>\n<p>The endless rows of bookshelves extending ad infinitum rotated and moved apart to make way for benches for those of the congregation to pray. The centre of the RoK rose by a few steps into a large circular stage with a void black pillar at its centre. The mellow atmosphere of RoK, conducive to long hours of reading, grew brighter and holier by a tinge. Then, above everything in the seemingly endless ceiling, hung a massive and realistic globe of the Earth - Guy's True World.</p>\n<p>As the world settled, the ethereal figures who were initially seated on the benches of the Church arrived and assumed their places in the benches in the now-dubbed \"Church of the True World\". Of course, Guy was completely unaware of the transformation occurring in his soul space as he was only just gasping for breath after drowning in an ocean of pain.</p>\n<p>Guy gasped as he said, \"What was tha-\"</p>\n<p>But he was suddenly interrupted... by himself. His strained expression hardened and turned pious and arrogant. His body language shifted and oozed confidence.</p>\n<p>\"Quiet!\" Guy said, though the tone lacked Guy's usual light-heartedness. \"I need absolute silence while I guide this child through her inner turmoil.\"</p>\n<p>Guy walked forward with a jerky motion, as though he wasn't fully comfortable with his body. He approached the seizing Jean and gently placed his palm on her abdomen. Closing his eyes, he let himself drift towards his intended destination, the girl's core space.</p>\n<hr>\n<p>Guy's words weren't false. A war was literally taking place inside the girl's body both in the physiological and the psychological realm. In the former, the hastily injected antibodies from Kili's blood were straining themselves to combat the deadly virus running rampant all over the place.</p>\n<p>However, this fight was trivial compared to what was affecting the girl psychologically.</p>\n<p>For the absorption of a core to be successful, the mage must be compatible with the cultivation embodied by the core itself. Needless to say, Jean was wholly incompatible with the virulent content of the man-creature's core. It ran counter to everything Jean believed in.</p>\n<p>Fortunately, or from another perspective, unfortunately, Jean wasn't the only one in her mind.</p>\n<p>The reason why Jean could never cultivate before meeting Teacher Larks was that with every cultivation method, came a series of dogmas that one had to adhere to. In every case, at least one of the two voices occupying real estate in her mind would disagree or downright deny said dogmas. Needless to say that it was impossible to cultivate if one couldn't agree with or resonate with the mantras of a cultivation method.</p>\n<p>Before Jean was alchemically lobotomised and her mind was fractured, and while she still suffered from bipolar disorder, she would erratically alternate between bouts of severe nihilism to extreme optimism - between having the urge to kill herself and everyone around her to being unassailably naive and weak-willed. The Alchemist who treated Jean approached the problem with the same depth of mathematics as Jean did when she grasped the core of the man-creature.</p>\n<p>\"If two personalities are fighting, disagreeing with each other and causing harm, why not just separate them?\"</p>\n<p>Unfortunately, he didn't realise that the two personalities were part of a single troubled mind, and in separating them as such he had removed the girl's ability to feel anything at all.</p>\n<p>After the fracture, the two personalities grew more and more complex - more vivid. They did not gain life, but they gained true individuality.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#It (Private)</a>'s beautiful...# the dark garbed figure of Jean's mother approached the swirling ball of murky black mana before her. Her face cracked with a wicked grin. As she inhaled, the black ball of mana started to siphon into her causing her form to grow larger and darker.</p>\n<p><em>W-What are you doing?</em> The light-garbed figure of Jean's mother, with a face as pure and unblemished as freshly deposited snow, asked fearfully as she beheld her opponent gaining strength. She wished nothing more than to run away, but she couldn't. First off, there was nowhere else to go. She was a prisoner within Jean's psyche. And second, standing huddled behind her was a scared little girl of five.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Precious (Private)</a> opportunities like this are rare,# the dark figure boomed ecstatically. #I'm just making the best use of it.#</p>\n<p><em>You can't do this!</em> The light figure pleaded.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#If (Private)</a> I don't assimilate all of this knowledge, the girl will explode. Would you rather she die, then?# The dark figure teased with a scoff.</p>\n<p>She then tilted her head and voiced out her thoughts dramatically, <a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Speaking (Private)</a> of which, is there even a need for you anymore? You are only holding her back!#</p>\n<p>Without pause, the dark figure coiled her arms into a fist and pummelled her counterpart. A loud boom echoed within Jean's core space. The little girl closed her eyes in fear and expected her death at any moment.</p>\n<p>However, nothing came.</p>\n<p>She slowly opened her eyes and was shocked to see that her light-adorned guardian was single-handedly holding back the fist pushing vigorously against her.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#What (Private)</a>?#</p>\n<p>The light-adorned figure revealed a strained smile and said through gritting teeth, <em>You aren't the only one taking advantage of a precious opportunity!</em></p>\n<p>Then, her figure also started to grow larger.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#H-HOW (Private)</a>?!# The dark figure exclaimed in incredulity as her minuscule opponent grew to match her own height. #The antibodies!#</p>\n<p>This time, it was the darker figure who was on the receiving end of a thought-interrupting sucker punch. Punches and kicks followed as the two descended into a brutal and raw melee. The dark was always on the offensive, sending punches, kicks and even bursts of virulent, viscous gases drowning her defending opponent in filth and death. The lighter figure remained in defence, refusing to enter the offensive (also possibly due to her own incapabilities).</p>\n<p>The little girl started to run away in fear. Her little legs carried her far away, but the sounds of the fight didn't recede. In fact, they grew louder with each passing second.</p>\n<p>There was no running away, and there was nothing to contribute. The girl knew that her life was contingent on the outcome of the fight. But as seconds passed, her expression grew grim and fearful.</p>\n<p>It seemed that the darker figure was incrementally gaining the upper hand.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/h3wyum8dq8kcjyesbvcqxbh\">Chapter 294 - Merging with the Other Self</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/mo9ojkj4mns8v9rleubsc1m\">Chapter 292 - Nightmares Turned Reality</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}