{"pageProps":{"note":{"id":"hvwsdc0higpewnoowj5v0jh","title":"Chapter 177 - Bait, Funnel, and Trap","desc":"","updated":1653295164561,"created":1651340917334,"custom":{},"fname":"volume-3.chapter-177","type":"note","vault":{"fsPath":"vault"},"contentHash":"60efb5136c6b56772b6ece29fd95ea2e","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-177","id":"hvwsdc0higpewnoowj5v0jh","vaultName":"vault"},"value":"volume-3.chapter-178","position":{"start":{"line":121,"column":3,"offset":11170},"end":{"line":121,"column":27,"offset":11194},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-178"}},{"from":{"fname":"volume-3.chapter-176","id":"aoc3q1fycs4s6c353wx31x5","vaultName":"vault"},"type":"backlink","position":{"start":{"line":55,"column":3,"offset":10750},"end":{"line":55,"column":27,"offset":10774},"indent":[]},"value":"volume-3.chapter-177"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-177---bait-funnel-and-trap\">Chapter 177 - Bait, Funnel, and Trap<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-177---bait-funnel-and-trap\"></a></h1>\n<p>\"It's Cleo Loras!\"</p>\n<p>\"That's her? She's so beautiful!\"</p>\n<p>The men whooped in a low tone and slobbered at the appearance of the beauty, while the women revealed a false smile to hide their quivering sneers.</p>\n<p>'I have to leave. NOW!' Markus's mind blared at him earnestly.</p>\n<p>\"And with that, the Outer Division Ranking Tournament comes to a close,\" the girl spoke with a pleasant, sing-song voice. The crowd around Markus turned silent and everyone assumed their seats.</p>\n<p>'Shit! I can't leave now or else I will stand out.' Markus too sat down in his spot. His instincts were telling him to brace for the worst.</p>\n<p>\"The results will be deliberated by the panel of judges and the rankings will be posted soon. Before we end today's event, I would like to offer an opportunity to those present here today. I am opening the floor up to a challenge, anyone here can challenge me to a duel right now. If you are in a lower cultivation realm, I will suppress myself to match you. As an ante, I will put up this-\"</p>\n<p>The girl waved her hand and a few attendants brought in a mound of ore.</p>\n<p>\"- Red Moloch ore. For those that do not know of it, Red Moloch is a highly malleable and silky metal often used for protective apparel worn by spellcasters. It is highly resilient to extreme temperatures, and is capable of dissipating most physical attacks.\"</p>\n<p>The crowd started to murmur and commented on the rarity of the ore. Based on the conversation, it appeared to be an extremely scarce mana metal, found only within the volcanic abode of an ancient Phoenix that resided on an isolated island in the Toroid Ocean to the East.</p>\n<p>\"How generous,\" Markus muttered involuntarily.</p>\n<p>\"Indeed! Miss Loras is the kindest person in the Sect,\" a fawning teen affirmed.</p>\n<p>'Too generous,' Markus repeated. This was a disconcerting sign. When things appeared to be too convenient, coincidental, or generous, there was always something morbid brewing behind the scenes. Someone was up to something. Markus did not believe the praises showered by the surrounding men one bit. 'The girl has an agenda, and I don't want to get involved in it!'</p>\n<p>\"The duel will follow standard rules of engagement,\" the girl continued. \"So, who's interested.\"</p>\n<p>As expected, no one was willing to step up. No matter how tempting the reward may be, even the most hormonally charged boys in the crowd could smell a scheme from a mile away. It was just too good to be true. In addition to that, no one wanted to cross weapons with the daughter of the Sect Leader, no matter how kind and amicable they were.</p>\n<p>\"Well, that's awkward,\" the girl shrugged. \"Since no one here is willing to give me face, even after I've brought out such an amazing reward, I guess I will have to step up myself. Let's see who the lucky one will be.\"</p>\n<p>Silence prevailed in the audience for an uncomfortably long time as the girl waved a finger around the crowd randomly with her eyes closed. At that instant, the roaming hand narrowed and latched on to Markus' hunched figure.</p>\n<p>\"You over there! Yes, I shall fight you!\"</p>\n<p>'Fuck!'</p>\n<p>Markus immediately edged behind the person in front of him to break the line of sight between the girl and himself.</p>\n<p>'She was after me all along! But why? Does this have anything to do with what Teacher Jeeves warned us about?'</p>\n<p>Unfortunately, the teen in front of Markus had the same idea, and moved out of the way, revealing Markus' cowering figure.</p>\n<p>\"I don't think I have seen you here before,\" the girl commented with a confused expression. \"Nonetheless, you shall be my opponent.\"</p>\n<p>Markus stood up awkwardly and said, \"Hello. I am Markus Reva. I am simply a guest to the Sect. I don't think it is fair to the Sect members for me to participate in this duel, especially given the rarity of the reward.\"</p>\n<p>\"Nice to meet you Markus! It is only unfair if you win, are you so sure that I will lose?\" The girl said while smiling coquettishly.</p>\n<p>\"I apologise if my words were offensive, that was not intentional,\" Markus responded while bowing lightly.</p>\n<p>\"Well, there's nothing to it. Come on up!\"</p>\n<p>\"I would like to decline,\" Markus answered.</p>\n<p>The girl frowned and said, \"Unfortunately, that is no longer possible. You see, in the Cloudstrider Sect there is a rule that if a challenger calls out to someone for a duel, they must accept.\"</p>\n<p>Markus looked around and saw a plethora of confused expressions plastered across the audience members' faces. He knew immediately that this was a bogus rule made up to trap him into accepting the fight. So without a second thought, Markus answered, \"In that case, I shall accept and forfeit.\"</p>\n<p>\"The duel does not start until the challenged alights the stage and the match is officially started,\" The girl retorted.</p>\n<p>Markus grit his teeth and tried to escape, however, the instant he tried to take a step backwards, something stopped him from physically doing so. It was like an invisible string holding him in place. So, Markus was left with no other option than to move forward. With each step taken, the string holding him shortened as well, disallowing any form of escape.</p>\n<p>He trudged unwillingly, with heavy steps, towards the vast platform at the base of the amphitheatre. The world around him had turned silent, or maybe it was just his perception. His heart started to palpitate at a fever pace. His memory of his greatest loss on a similarly public stage started to resurface in his mind.</p>\n<p>'The match will begin, and I will surrender,' Markus repeated to himself. 'I cannot fall for her trap.'</p>\n<p>Markus approached the steps leading up to the stage and exhaled to calm himself. 'I will surrender. There is no need to fight.'</p>\n<p>Yet, the moment his feet touched the first steps, a change transpired in his psyche unbeknownst to him, 'Why must I surrender?'</p>\n<p>He took another step, 'Wasn't losing once to that guy enough? Must I put myself down again?'</p>\n<p>With the final step, he was on the platform, 'I will win. I must win. Because I can WIN!'</p>\n<p>Markus' calm gaze was immediately washed over with a burning passion.</p>\n<p>The girl smirked internally as she saw the change transpire before her eyes. The boy who was wearing a stoic and impassive expression of a mature mage warped to match the fiery arrogance of those hotheaded youths. Her play had succeeded! Before descending on stage, Cleo had commanded Korr to initiate the Life-and-Death Formation that tethers a challenger on stage with a challenge within the confines of the amphitheatre. The tether only works if the two are within the same cultivation realm, and makes it so that the challenged is left with no exit apart from entering the stage and waiting for the match to begin. The second formation was one less known amongst the Sect members, and that was the Irrationality Formation.</p>\n<p>A rather peculiar ritual formation that subtly affects the target's mind to lower their sense of preservation and rationality, and causes them to err to the side of imprudence. It doesn't completely turn a target into an instinct and rage-fuelled animal, but it moves those suppressed instincts to the forefront. As evident here, Markus was the target of this formation, without his consent. This was Cleo's ace in the hole. She had an inkling that the boy would turn tail at the first sight of confrontation.</p>\n<p>Ironically, if Markus had simply taken the bait earlier, the formation wouldn't have been activated and he could have easily surrendered a few seconds into the fight. However, because of his hesitance, he was now caught in a net.</p>\n<p>Markus stood at the starting location at his end of the stage, and Cleo assumed her position as well.</p>\n<p>\"Draw your weapons,\" the referee declared.</p>\n<p>Cleo drew out a think one-handed, curved blade which had a sharp and blunt edge. The metal was a translucent cyan colour, with a hilt with golden base and leader handle bindings, and a pommel with three gems embedded in it. Cleo twirled the blade in one hand and held it behind her, with a seemingly lowered guard.</p>\n<p>Markus in turn retrieved his wand hanging to his side and unlatched his Grimoire, which floated open to his side.</p>\n<p>\"Are you sure you want to use a wooden weapon?\" Cleo taunted with an innocent pout. \"You don't have to go easy on me, big brother!\"</p>\n<p>\"We are the same age, Miss Loras, you can call me by my name. And do not worry, I won't go easy on you,\" Markus answered. He cringed internally the moment she used the term 'big brother'. Unlike when Dora called him that, Cleo's tone oozed with subtle toxicity. It was extremely unpleasant to the ears.</p>\n<p>'It is as Korr predicted - a spellcaster. It looks quite... small, but it definitely has the appearance of a magical staff. Although, the gem is at the base, unlike a regular staff where it's at the tip. Regardless, it shouldn't cause me much trouble, since it's only an unattuned gem. The spell that it can cast must be a plain type. The floating book does not appear to have any offensive functionality, but I cannot discount it just yet,' Cleo thought internally. 'What am I worrying about? This duel will be finished before it even starts! I just need to elongate it enough till Elder Glista gets here. Let's hope this one lasts that long.'</p>\n<p>'Although she doesn't use the sword like Gaige, I should be able to adapt to her attack patterns. Unlike him, I predict her speciality should be in speed-based combat. After analysing the pattern of the many previous combatants, it seems that the cultivation in this Sect leans towards either hard-initiation decapitation attacks or hit-and-run attrition attacks. Her stance appears relaxed, which means that she is either confident in her chance of victory, or she has no combat sense. I doubt the latter to be true, seeing as she lured me into this duel. Regardless, I cannot take any chances.'</p>\n<p>The referee raised the flag.</p>\n<p>'Satisfy me, Markus!' Cleo thought to herself, as a savage smile bloomed on her face.</p>\n<p>'I will win!' Markus repeated as he tried to contain his aggression.</p>\n<p>\"BEGIN!\"</p>\n<p>Cleo initiated the first stance in the Translucent-Mist Blade Technique, |Dispersion Step Strike|. She would essentially disperse from her current position, turning into mist, while appearing behind her enemy for a serene strike. This was how the attack would appear to the public, when in fact it was a derivative of the |Flash Step|, a basic weapon combat technique that requires the user to saturate their lower body muscles with mana in short and powerful bursts. The difference between that and the |Dispersion Step Strike| was that this method integrated it into the illusory overtones of the |Cryptic Cloud| cultivation technique.</p>\n<p>If successful, she would inflict high damage on Markus from the get-go, immediately placing him in a disadvantageous position. Cleo was confident this attack would succeed. Her muscles twitched in preparation. But right as her feet were about to leave the ground, her step faltered. It wasn't due to fear or a mistake. Cleo had no idea how it even happened. It was as though she had underestimated her own weight. That should be impossible - how can she make such a mistake? After many hours of practice drilling the motion into her muscles, the mistake should not have happened!</p>\n<p>\"Wha-\"</p>\n<p>BOOM!</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/zj9wbj421c6s4qwfhpcys0l\">Chapter 178 - Exchange of Pointers</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/aoc3q1fycs4s6c353wx31x5\">Chapter 176 - Defense</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}