{"pageProps":{"note":{"id":"hwxbq66zgvy1ybgceq1nmt4","title":"Chapter 398 - First Cries","desc":"","updated":1704791028322,"created":1700247449167,"custom":{},"fname":"volume-5.chapter-398","type":"note","vault":{"fsPath":"vault"},"contentHash":"ff3ea8ca0100af189a3c439c0de85c0c","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-398","id":"hwxbq66zgvy1ybgceq1nmt4","vaultName":"vault"},"value":"volume-5.chapter-398","position":{"start":{"line":101,"column":3,"offset":11704},"end":{"line":101,"column":27,"offset":11728},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-398"}},{"from":{"fname":"volume-5.chapter-397","id":"yp6r9eh5w6u8o7nanjew4j9","vaultName":"vault"},"type":"backlink","position":{"start":{"line":123,"column":3,"offset":12151},"end":{"line":123,"column":27,"offset":12175},"indent":[]},"value":"volume-5.chapter-398"},{"from":{"fname":"volume-5.chapter-398","id":"hwxbq66zgvy1ybgceq1nmt4","vaultName":"vault"},"type":"backlink","position":{"start":{"line":101,"column":3,"offset":11704},"end":{"line":101,"column":27,"offset":11728},"indent":[]},"value":"volume-5.chapter-398"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-398---first-cries\">Chapter 398 - First Cries<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-398---first-cries\"></a></h1>\n<p>\"It's hard to diagnose, I will admit,\" Jean said. \"The cultivation isn't something that can be evaluated and deciphered.\"</p>\n<p>She was methodically running general tests like measuring her heart rate, blood pressure, and so on to identify any discrepancies from the norm. She then started to go through a battery of magically charged tests that evaluated Shuri's internal health. </p>\n<p>\"Then what are you planning to do?\" Shuri questioned.</p>\n<p>\"I would prefer to have you checked by Sect Leader Larks,\" Jean stated. \"And I even asked him about it, but he said that you wouldn't be comfortable with it?\"</p>\n<p>Shuri's brow quirked up at that statement, \"Why would I be uncomfortable?\"</p>\n<p>\"His exact words were, 'Inspecting someone's cultivation closely will give you insight into parts of them that they don't wish to share with others.' He said that you wouldn't be amenable to that.\"</p>\n<p>The words shook Shuri from within. Her hand subconsciously reached for the pendant by her neck and caressed it worriedly.</p>\n<p>\"Nonetheless, I will have to make do with the tools I am provided. And so, I will be observing you for the entire day today,\" Jean declared while taking a seat by a rock nearby.</p>\n<p>Shuri pulled herself out of her worried stupor and walked over to her ritual. All that was left to do today was place the central core that would integrate all the distributed systems, and bring life to her data storage solution... on paper. Shuri had tested each segment thoroughly and found it working to her satisfaction, so technically any catastrophic failures should be out of the question.</p>\n<p>Without wasting time on distracting and pessimistic thoughts, she retrieved the massive core with an unbelievably elaborate program coursing all over it and placed it at the desired nexus point of the ritual. This core was the result of two sleepless nights worth of continuous programming. It called for her complete and undivided attention, as the logic within was so convoluted that even her precise mind could barely keep track of it - distraction wasn't an option. She was fully drained after that endeavour. However, it also revealed to her the root cause of the pain in her abdomen - the dreams. The nights she didn't sleep and thus didn't dream, she enjoyed a day without any pain. But the moment her eyes closed and she entered her dream world, she woke up with abdominal pain. The solution was obvious now that the cause was known - to not sleep. But it wasn't a tractable and sustainable solution. Something had to be done, but there was still time for that.</p>\n<p>The ritual circle was finished around the newly added core and Shuri stepped out of it. She inspected the setup one final time before activating the ritual by placing mana crystals at the pedestals placed at the peripheral nexuses. The drawn circle glowed with an ethereal purple hue before lifting off the ground, carrying the cores and plates with embedded gems with it. The entire circle started to rotate slowly before gaining another dimension as a subsection within disjointed and started to orient itself in a perpendicular axis. Then another disjointed and spun in another axis. One after another the ritual started to open up creating a floating ethereal replication of what an atom is usually drawn to look like, with the smaller cores and plates orbiting the much larger core at its centre.</p>\n<p>\"Wow!\" Jean exclaimed from Shuri's side. \"What is this?\"</p>\n<p>\"It's a brain,\" Shuri answered. \"An artificial one.\"</p>\n<p>Shuri could feel her Senior Sister's disbelieving gaze mixed with a sense of awe. \"It cannot think. It cannot infer. It cannot understand. But it can remember. Boy, oh boy, can it remember!\"</p>\n<p>\"So how does it... remember?\"</p>\n<p>Shuri retrieved a smaller core from her jacket and tossed it over to her Senior Sister. She then picked out a smaller plate which had a mana gem embedded in it and a dent on the opposite side.</p>\n<p>\"I had one of the members of the Automagy Club to make this. It's basically an encoder that converts audio into signals. You place the core on this plate and record audio inside it, which gets stored in the gem on the opposite side,\" Shuri explained. She then took the core back and activated it, \"This is a test recording!\"</p>\n<p>She then tossed the plate towards the active ritual, and the thing seamlessly entered the orbit. They observed as an arc of light sparked off of the plate and travelled from within towards the orbiting periphery, and into one of the many plates with gems in the ritual's orbit. After a second, the plate was ejected and landed on her open palm.</p>\n<p>\"The information has been transferred inside the storage system. You can check the plate and see that the mana gem is truly empty. The plate however will have a value attached to it, which is the address to the location in memory where the entry point to this data is stored. You can replace the core with an empty mana gem and toss it inside-\" Shuri enacted her explanation by retrieving another enchanted gem and then embedding it on the dent on the opposite side of the plate and tossing it inside the orbiting ritual. An arc exited from the only luminescent gem in the orbit and collided with the plate tossed in. Once again, the plate was ejected, but this time, the newly embedded gem was shining - there was information inside it.</p>\n<p>\"This is a test recording!\" Shuri's voice said from the retrieved gem.</p>\n<p>\"You can create as many copies of the data inside the storage system as long as you have the correctly enchanted mana gem to hold it. Of course, if you want to delete the information from storage, you just toss in the same plate you used to record the data (with the memory address) but without anything else on the plate's opposite indentation.\"</p>\n<p>Shuri enacted her explanation and this time, the gem in orbit dimmed, and an arc sparked out and collided against the newly introduced plate, causing the gem on it to light up.</p>\n<p>\"This is a test recording!\"</p>\n<p>\"This is the original. It can be deleted,\" Shuri explained.</p>\n<p>The moment the gem dimmed, an eerie phenomenon started to descend upon them. The duo looked up and noticed dark clouds forming in a violent vortex above them - it was as though a tropical storm was forming in place.</p>\n<p>\"What is that?\" Shuri inquired. She looked to her side and saw Senior Sister Jean's eyes light up with recognition. The girl's jaw dropped in surprise and her gaze locked on to Shuri oozing with awe.</p>\n<p>\"I can't believe it!\" She mumbled. \"T-This is unfathomable. And that too at such a young age?! This- I have to get the others!\"</p>\n<p>Shuri reached out to grab Jean, but suddenly, a tornado of mana crashed into her from the sky. Shuri looked all around her, as the mana started to gain momentum and vigour. But in the disturbance, she noticed an uncharacteristic calm wash over everything. The rampaging surroundings stilled like a stagnant pond and turned clear. In this still clearness, she saw herself - her face looked back at her.</p>\n<p>Moments passed as Shuri looked into her reflection's eyes. She could see the life she lived flashing past her. All of her memories starting from the presents started to play back at a fever pace. In an instant, her reflection rippled. The face changed slowly and gradually until it paused.</p>\n<p>Who was this?</p>\n<p>It was her. The eyes, the lips, and the nose, all resembled Shuri.</p>\n<p>But it also wasn't her. The thick brows, the slightly square face, and the wider forehead were not a part of her appearance.</p>\n<p>It wasn't a 'her'. Her gaze snapped towards the distinct bulge at the neck right below the chin...</p>\n<p>\"No-\" was all that left Shuri's lips before excruciating pain attacked every millimetre of her body. Unable to handle it, Shuri immediately collapsed on the ground and squirmed like a worm doused in salt. No sound left her, she didn't have the energy to activate that part of her brain, because everything was hurting. It was like her body was being ripped apart and put back together, but because of some mistake it was ripped apart again, assembled again, ripped again, and again, and again-</p>\n<p>And that was when darkness took hold, and all the pain just disappeared.</p>\n<hr>\n<p>Pained grunts resonated within the ornate room.</p>\n<p>\"You must push harder, Your Highness, the child's head is visible,\" the midwife coaxed while sporting a calm smile. Her hands moved with familiarity, highlighting the many years of experience she had in this field.</p>\n<p>But her familiarity and calmness did not mean that she was taking the process easy. Childbirth was never simple, and it was rarely safe. No matter how many you take part in, no two instances of childbirth are identical. The midwife had the experience of birthing twenty-nine babies successfully, with no loss, which was an admirable feat considering the women she was catering to were the coven of slender-hipped and fragile consorts and concubines.</p>\n<p>She cursed her luck, actually. Her entire apprenticeship and earlier training occurred in a secluded village a few kilometres West of the Capital. There, she had the privilege of assisting the births of women with actual \"birthing hips\". Her success rate was phenomenal! It just so happened that one day, a dangerously pregnant Imperial Consort passed by the village and entered labour. The midwife's master ran away the moment the whisper of a royal birth started to permeate out of the heavily guarded caravan. She should have done the same, but she was naive back then. She got roped into the birthing against her better judgement and luckily succeeded in getting the child out in one piece.</p>\n<p>That was her first mistake. The Imperial Consort dragged the midwife all the way to the capital. One thing led to another, and she was now the Royal Midwife - one of the most dangerous occupations in the world, with a turnover rate of zero because a mistake most definitely ended with certain death.</p>\n<p>Actually, she learned one key fact during her third birthing in the Palace, which would have taken a catastrophic turn if she hadn't made a difficult choice. The life of the baby mattered more than the life of the mother. There was an overabundance of breeding mares in the Palace, so a loss of one wouldn't matter in the grand scheme of things as long as the Emperor's bloodline was propagated without a problem. So, you could sacrifice the mother as long as the child made it out safely. Of course, there were exceptions, such as if the consort was in the Emperor's favour. But if the child was a male, and the midwife could convincingly spin a yarn that concluded that there was no other way, then there was a certain wiggle room.</p>\n<p>This fact was also why the midwife could afford to be so calm at this juncture. If the childbirth started to deviate, a swift cut and extraction was a simple solution. Of course, she would have to put on a convincing play so that the Eunuch (the eyes and ears of the Emperor himself), the only other person in the room apart from the pregnant mother, couldn't cast doubt at her decision. Thankfully, that wouldn't be necessary.</p>\n<p>\"It's crowning, Your Highness, just another push!\" She encouraged.</p>\n<p>A tense half an hour later, the first cries of a baby entering the world greeted the room and everyone present within.</p>\n<p>\"Congratulations, Your Highness, it's a healthy Prince!\" The midwife congratulated her. Birthing males was always a cause for celebration, primarily because it was always followed by a generous bonus directly into her bank account.</p>\n<p>But amidst her mini-internal celebration, something weird happened.</p>\n<p>Why was her gaze suddenly falling? Where did all this blood come from? More questions started to crowd her mind within seconds. Questions whose answers wouldn't matter because her head wasn't attached to her neck any more.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/hwxbq66zgvy1ybgceq1nmt4\">Chapter 398 - First Cries</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/yp6r9eh5w6u8o7nanjew4j9\">Chapter 397 - Write Once, Read Anytime, Delete Never</a></li>\n<li><a href=\"/TGT/notes/hwxbq66zgvy1ybgceq1nmt4\">Chapter 398 - First Cries</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}