{"pageProps":{"note":{"id":"IEL37n77aoErycDSv64qj","title":"Chapter 004 - (Un)Fair","desc":"","updated":1649348536351,"created":1643481812422,"custom":{},"fname":"volume-1.chapter-004","type":"note","vault":{"fsPath":"vault"},"contentHash":"b9029c4189fa115abd0dd514d60ce966","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-004","id":"IEL37n77aoErycDSv64qj","vaultName":"vault"},"value":"volume-1.chapter-005","position":{"start":{"line":156,"column":3,"offset":14896},"end":{"line":156,"column":27,"offset":14920},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-005"}},{"from":{"fname":"volume-1.chapter-003","id":"qZGIWN9jf8FDRS9Ha97VW","vaultName":"vault"},"type":"backlink","position":{"start":{"line":89,"column":3,"offset":10292},"end":{"line":89,"column":27,"offset":10316},"indent":[]},"value":"volume-1.chapter-004"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-004---unfair\">Chapter 004 - (Un)Fair<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-004---unfair\"></a></h1>\n<p>“Psst… Wanna be my student?”</p>\n<p>“Eww! Get away from me, you creep!”</p>\n<p>“Damn it!” Jo cursed as the teenage girl he was talking to ran away towards her group of girlfriends.</p>\n<p>“I don’t think that was a good way to approach them…” Guy muttered incredulously. Inside, Guy was cursing his old self’s luck for befriending such an idiot.</p>\n<p>“It’s the last day of fresher’s week man! It’s now or never! It’s not like some bloke with heavenly luck is going to drop into our laps. We have to be more proactive!” Jo started to pump himself up.</p>\n<p>“Relax Jo -”</p>\n<p>“It’s Zao.” Jo interrupted.</p>\n<p>“Excuse me?”</p>\n<p>“It’s pronounced Zao, first name Wei last name Zao. It’s uh… oriental name. Yeah, that’s right!” Jo started to rattle out quickly.</p>\n<p>“That’s not how you spell it though. And I don’t think there is an Orient here.” Guy pointed out.</p>\n<p>The two “friends” were currently strolling around Radiant Academy’s grounds. The academy was one of the central landmarks in Radiant City, which was part of the Maika Duchy. </p>\n<p>This new world, called Gaea, was somewhat similar to Earth. Except it was still in the middle ages. With the presence of magic and mana, technological development had stagnated and hadn’t advanced for a few 1000 years. There were various empires and kingdoms dotted across the globe, most practised feudalism, while others had variations or completely novel governmental structures.</p>\n<p>The kingdom he was currently in was called the Solar Empire, and within the Empire, the Academy was in one of the less prominent Duchies which was controlled by Maika Clan.</p>\n<p>In this world, people could use magic. From birth, everyone had some level of affinity to using magic and spells, but those with proper aptitude and skill that chose to go further in the field were called mages. The more advanced the mage was, realm-wise, the stronger they were and the longer they lived. Hence it was inevitable that most people in positions of power had some form of cultivation since the prevailing philosophy of this world was “might is right”. There was no place for weakness.</p>\n<p>With regards to cultivation, a budding mage had only a few options to choose from. But regardless of their choice, they would almost always share the same starting point.</p>\n<p>Nearly all individuals who aim to become a mage would first opt to enrol into an Academy. These were neutral establishments that were generally affiliated with the authority where they were established. For instance, the Radiant Academy answered to the Maika Duchy, which answered to Solar Empire. </p>\n<p>These magic academies were fairly pricey to enrol into and would only support the students till they reached Foundation Establishment, that too only for 5 years at max. If a student failed to reach Foundation Establishment within that time frame, that meant they didn’t have any aptitude in magic. That is why students usually dropped out within their first two years if they found themselves progressing at a snail’s pace.</p>\n<p>Once a student graduated from a magic academy, they would be faced with four options. The first and most straightforward option was to pursue magic as a rogue practitioner. Rogue practitioners were few and far in between. This was because advancing in magic is a resource-intensive endeavour, and sourcing resources is naturally difficult for unaffiliated rogue practitioners. That did not mean that rogue mages weren’t successful. There have been historical records of various renowned rogue mages. But the fact remained, it is not a path suited for the average.</p>\n<p>The second, and the rarest of options was to find tutelage with a certified teacher. Within academies, the teachers essentially held the highest authority. Due to the neutrality of schools, teachers had complete freedom when it came to where they sought employment. There were certification tests that teachers could take to gain prestige and raise their employability and fame. Teachers were also not restricted by political boundaries. This inevitably meant that they weren’t allowed to interfere in political conflicts.</p>\n<p>Should a certified teacher recognise your skill, they would decide to take the student under their wings as a disciple. Being a renowned teacher’s disciple was also a prestigious opportunity. Due to their neutrality, they would often obtain many opportunities from powerful figures and organisation. And these opportunities would naturally trickle down to the teacher’s disciples.</p>\n<p>The other three options included joining a clan, sect, or private organisation. A clan status is awarded to large and prominent families. Most clans have deep roots and lots of clout. Large clans usually had control over vast lands, which were further divided for the smaller clans under them. It was properly feudalistic. If one decided to join a clan and work their way up, they would be completely tied to the clan. However for clans, if the mage showed promise, the amount of resource they would receive would also proportionally increase.</p>\n<p>A sect is something like a clan except there are no blood ties between its members. mages can opt to join a sect, but they will most likely have to go through a gruelling entrance exam. Within the sect, there are levels, which the mage can ascend by taking missions or gaining achievements. The sects have some leeway with regards to entering and exiting, but once you reached a high enough position, leaving wasn’t an option. Sects usually remained unaffiliated, but proximity and positioning usually decided which faction a sect aligned itself with.</p>\n<p>Finally, a mage could also seek to gain employment with a private organisation. Companies and organisations naturally needed their own muscle. To do this they would cultivate loyalty into the mages from a mouldable age. Becoming an employee for a private organisation usually came with huge rewards, but equally high risks. There was always subterfuge and wars of attrition occurring between organisations. Since capitalism never rests.</p>\n<p>There were many other lesser-known options for mages, but the above options provided more guarantees and were generally more successful.</p>\n<p>It was still early in the morning, and the apprentices had nought to do except troll for some prospective students. Since this was the last day, only the most desperate teachers and students remained.</p>\n<p>As the day progressed, fewer students remained, and even fewer apprentices were standing student-less. Those that did remain were ones without any prospects. All except for Dahrk Boise, the star of the current generation of apprentices. He was considered to be the cream of the crop, the academy’s poster boy for the next generation. He was a breath away from breaking into the Foundation Establishment realm and had numerous accomplishments. All the students that he taught showered praises upon him, which in turn elevated his supervising teacher’s ranking within the academy.</p>\n<p>Dahrk was currently standing in a very conspicuous position at the centre of the yard, his eyes scanning the crowd. On an obfuscated corner of the yard, a few teaching apprentices, including Guy, were talking amongst themselves.</p>\n<p>“Why is Dahrk still without a student? I thought he’d take one on the first day. There was literally a huge line of students begging to be taught by him. Damn it! Pretty boys get all the luck!” One of the apprentices grumbled.</p>\n<p>“Apparently he’s waiting for a ‘promising seed’. Yech! What arrogance!” Another chimed in.</p>\n<p>“You’re just jealous that he has a choice. Once the week ends and he is still without a student, I bet you the Academy will personally assign one to him. They may even strip one from under the tutelage of another apprentice.” The first one retorted.</p>\n<p>“Look! Another student’s approaching him!” The second pointed out.</p>\n<p>Back at the centre of the yard, a dark-haired and scrawny boy confidently strutted towards Dahrk, with a resolute expression dyed across his face. He looked a little malnourished for a 12-year-old, but his visible musculature indicated that he had undergone some form of formal training in martial arts.</p>\n<p>As the boy approached Dahrk, slowly his resolute expression started to wane. And by the time he was standing before Dahrk, his body nearly crumpled into itself as he struggled to look the apprentice in the eyes.</p>\n<p>With great difficulty, the boy mumbled, “Teacher Boise! I… Please take me in as you student.” and bowed showing his respects.</p>\n<p>Dahrk glanced at the boy. His eyes threatened to penetrate the boy’s soul.</p>\n<p>“Who’s that kid?” One of the apprentices next to Guy asked.</p>\n<p>“Holy shit! That kid’s the third son of the Bori clan.” The second apprentice answered without missing the beat.</p>\n<p>“No way! Gaige Bori! The kid who was already into Middle stage Mana Condensation when he joined? I heard he lost his cultivation though,” the first one recollected and voiced out loud.</p>\n<p>“Yeah. Poor guy. He was a hardworking one, that kid. Even worse was that after his cultivation regressed, the marriage he had lined up fell through, now it’s his second brother who’s set to marry the girl,” the second apprentice voiced emphatically.</p>\n<p>“Y’all are just tossing out exposition left and right huh?” Guy commented casually. The other teachers looked at him with a questioning gaze to which he simply waved his hand and pointed at the spectacle before him.</p>\n<p>During the time when the two apprentices were providing story-specific exposition, Gaige had now gotten down on his knees and was begging profusely for the teacher to accept him. He promised that the regressed cultivation was only momentary and he could feel deep inside that he’d make a comeback. Unfortunately for him, Dahrk didn’t even bother to look down at the prostrating kid and walked away.</p>\n<p>Looking at the sorry state of the kid, Guy felt a little bad. And that’s when it hit him!</p>\n<p>“That’s an MC template!” He muttered. But what surprised him even more, was that Jo, who was standing next to him, actually said the same statement out loud.</p>\n<p>Guy turned towards Jo, who was enthusiastically walking towards the grovelling Gaige with a spring in his step. </p>\n<p>‘Something’s weird… Hey Mast, do you get a feeling that Jo is acting a little weird?’ Guy spoke inwardly.</p>\n<p>(Hmm. Let me see.) Mast said and then disappeared from his head.</p>\n<p>By this time, Jo was already standing next to Gaige and was talking to him with a serious expression on his face. Reading Jo’s lips, Guy could make out a few words.</p>\n<p>‘-raconic Bloodline?… Oh Draconic Bloodline! Is he just spewing bullshit now? Woah, look at how wide that kid’s eyes are! Jo must’ve been right! But how?\nHold up! That doesn’t matter! that kid’s golden! Damn it why didn’t I get to him first. The MC’s thigh should have been mine to grab!’ Guy cursed inwardly while metaphorically raising his fist towards the heavens.</p>\n<p>Just as Guy was lamenting his misfortune, Mast dropped another bomb. (Damn! That’s my sister!)</p>\n<p>Guy was shocked. ‘Where? I thought this place belonged to your elder brother!’</p>\n<p>(I meant that man, Jo, you were talking about. I inspected him, and my sister’s inside his head! Hahahaha! He’s another one like you!) Mast mirthfully commented.</p>\n<p>{Yo Big Brother!!} A cheerful feminine voice resonated inside Guy’s head.</p>\n<p>(Hey &#x26;&#x26;#$*! Wait, let’s use your plebian name Moni. My guy here doesn’t understand high-dimensional languages,) Mast spoke calmly.</p>\n<p>{Sup! So you brought one over too huh?}</p>\n<p>(I made a mistake and had to compensate this one. I heard Big Bro is trying some new stuff with this world and was struggling. I wanted to check it out, and well this was a pleasant opportunity. So what’s up with you?)</p>\n<p>‘Wait wait! You’re saying whoever is inside Jo is also a transmigrator?’</p>\n<p>{Yup! I brought that one from my world!}</p>\n<p>Guy had a lot of questions, but he asked the one that was on the tip of his tongue. ‘How different is your world from Mast’s?’</p>\n<p>(There’s something called life force or ki in her world. There are also a few more ‘alien’ lifeforms in close proximity to Earth.)</p>\n<p>‘So does that guy also have a system?’ Guy asked Moni cautiously.</p>\n<p>{What is with you humans and your systems? Yes, he does. The guy practically begged me to give him one. Basically, he worked as a librarian in my world, so he wanted a library that could record data on things he touched. Like everything from strengths, weaknesses, methods to improve and so on.}</p>\n<p>Guy screamed internally, ‘He has a Library of Heaven’s Path! Damn it Mast!’</p>\n<p>Mast ignored Guy’s tantrum and calmly instructed Moni. (You have to be careful Moni. Don’t mess too much with Big Bro’s world, otherwise, he’s gonna really lose it.)</p>\n<p>{I know. I know.} Guy could almost hear her wave her hand dismissively.</p>\n<p>{Well. I’m gonna go have some fun! By the way Guy, do you want me to tell him you’re a transmigrator too?} Moni asked.</p>\n<p>Guy thought about it for some time. But then he decided to let it be. Since the two of them weren’t from the same world, there was no point. Besides, Guy really didn’t like that Jo guy’s character. He reminded him too much of one of his college professors who could never take a loss. That professor would always try to argue with his students whenever they asked a counter-question.</p>\n<p>With all that said, Moni evacuated from Guy’s mind. By the time Guy came to, he saw that the apprentices next to him had already dispersed and had presumably found a student. Near the end of the day, in the yard, there was only one student left and Guy.</p>\n<p>Guy looked at the student and the student looked at Guy. Guy regretted that he didn’t act when he saw the MC template character.</p>\n<p>‘Hmm, what to do?’ Guy sighed.</p>\n<p>Mast calmly spoke up. (What about that kid over there? He seems to be looking for a teacher.)</p>\n<p>‘Ah! But that kid’s not as good as the MC template. He probably has a low potential. I don’t know if I can save my job if I take him in…’ Guy replied.</p>\n<p>(Low potential doesn’t mean no potential. I thought teachers never discriminated when it came to teaching students?) Mast commented offhandedly.</p>\n<p>Hearing that, Guy both inwardly and outwardly slapped his forehead. He had nearly fallen into a trap common amongst teachers. It was usual for teachers to have favourite students, and students they hated. Most teachers hated student who disrupted their classes, slacked off or were generally weak in learning. It is a natural human reaction. But it was the worst thing a teacher could do. </p>\n<p>Students come to school to learn, it is their only chance to advance in life. For a lot of them, the world has given up on them and this is the only way for them to escape. The kids that act out are basically seeking attention because either they’re lacking it in their own families, or are struggling inside. If even their teachers give up on them, then the students are damned to eternity.</p>\n<p>Guy’s face morphed and exuded seriousness. With long and confident strides, Guy made his way towards the lone student at the other end of the yard.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/1suISyZaV3dCF8Cb0hX1t\">Chapter 005 - Markus Reva</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/qZGIWN9jf8FDRS9Ha97VW\">Chapter 003 - Guy's Goal in Life</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}