{"pageProps":{"note":{"id":"ij2lpq4mfhqluwrf85nny3g","title":"Chapter 273 - All Coming Together (Part Two)","desc":"","updated":1674207046304,"created":1672074082295,"custom":{},"fname":"volume-4.chapter-273","type":"note","vault":{"fsPath":"vault"},"contentHash":"1e230d7c79b208ba9fafd7aaeb91b1fb","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-273","id":"ij2lpq4mfhqluwrf85nny3g","vaultName":"vault"},"value":"volume-4.chapter-274","position":{"start":{"line":97,"column":3,"offset":11132},"end":{"line":97,"column":27,"offset":11156},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-274"}},{"from":{"fname":"volume-4.chapter-272","id":"v6ody43h0mot549l0upzh46","vaultName":"vault"},"type":"backlink","position":{"start":{"line":85,"column":3,"offset":10114},"end":{"line":85,"column":27,"offset":10138},"indent":[]},"value":"volume-4.chapter-273"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-273---all-coming-together-part-two\">Chapter 273 - All Coming Together (Part Two)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-273---all-coming-together-part-two\"></a></h1>\n<p>The Emperor slammed his fist on the Throne's armrest, causing a heavy boom to echo across the room. A charged silence took hold, as all the nonsensical bickering ceased instantaneously. The room was massive in scale, with the throne placed prominently on a raised stand at the very back. Banners with the symbol of the Sol Clan flanked the throne on either side, and an elegant red carpet rolled from underneath the throne towards the exit on the opposite end. To either side of the carpet, stood two lines of men garbed in the attire attributed to the highest ranks on the Empire's Government - the Ministers responsible for every governing body.</p>\n<p>\"All we've been hearing are excuses, upon excuses, upon excuses,\" the Emperor growled. With each pause, he pummelled his fist on the armrest to accentuate his displeasure. \"It's been a whole day! The entirety of the Capital's Authorities has been dispatched on the case. And yet, none of you can tell me WHO was behind it, or WHY they did it?\"</p>\n<p>\"You Majesty,\" a 'brave' official stepped forth. While controlling, albeit unsuccessfully, his chattering teeth he responded, \"These are unusual circumstances. Usually, terrorist organisations release some sort of manifesto or declaration to sign their name and cause behind their act of terror. Yet this... group has been strangely silent.\"</p>\n<p>The Emperor shot the man a deathly glare before rising abruptly from his Mithril-infused Gold-Adamantium Throne. The seat was laden with one of the largest Mana Gems in existence that cycled between every colour on the visible spectrum. It was a symbol of the Sol Clan's power, though it only came to be during the reign of the Third Emperor. The many years of peace and stagnation within the Empire had fostered a sense of disillusionment with the Emperor's Power among the common people. Hence, to prove his might, the Third Emperor had the throne built - crafted by three 5-star Blacksmiths and two 5-star Enchanters, the decadent piece of furniture was the epitome of excess. It was capable of withstanding attacks that could level an entire city AND its form adapted to match the shape of the person sitting on it while also offering unparalleled cushioning. Furthermore, it only allowed those with Sol blood flowing through their veins to rest their posterior on it. This was also how the originally crowned Fourth Emperor was discredited - as the moment his thighs touched the throne's metal, his body disintegrated completely.  </p>\n<p>\"So you're telling us that just about anyone can enter the Capital, wreak havoc, and get away with it without any consequences?\" The Emperor interrogated, standing half an arm's length away from the 'brave' official.</p>\n<p>\"Y-Your Majesty-\"</p>\n<p>\"They literally ENTERED our backyard, DESECRATED it, and LEFT! How does it reflect upon the Empire if we cannot even police the city the Throne is situated in?!\"</p>\n<p>Once again, silence.</p>\n<p>\"Alright, we see how it is,\" the Emperor commented while returning to the throne. \"If it is incentives that you need, it is incentives you shall receive.\"</p>\n<p>\"Minister Graves!\" He bellowed, and a man standing in the line by the carpet flinched. Collecting himself, he immediately rushed onto the carpet, faced the throne, and kneeled.</p>\n<p>\"It appears that your time as the Minister of Internal Security has been...\" his eyes locked on to the man's overflowing fat that not even the loosely fitting uniform could hide \"... relaxed?\"</p>\n<p>\"No, Your Majesty!\" The man responded.</p>\n<p>\"Well, we have learned through our time with the Royal Tutor that the best way to manage people is through the 'Carrot and Stick' approach. The 'Carrot' refers to rewards, that one can use to motivate others to act, while the 'Stick' alludes to punishment. It appears that your position as the Minister of Internal Security has allowed you to accumulate a lot of... 'Carrots' though I doubt you've eaten any of it,\" he said while eyeing the man's rotund frame with disdain. \"However, it has amounted to nothing. Thus it appears that it is time for the 'Stick'. Let this be known, that the penalty for every day that passes without any progress in the investigation into the terror attack at the Capital... is one finger.\"</p>\n<p>\"Your Majesty?\" The man yelped in shock.</p>\n<p>\"Let them think of us as a tyrant,\" the Emperor declared. \"We rather be referred to as a tyrant than a stooge.\"</p>\n<p>\"But we will make your life easier,\" the Emperor looked behind the kneeling minister and transmitted commands to the guards stationed around the room. \"We shall loan you one hundred from the Imperial Forces.\"</p>\n<p>A group of men in heavy armour of polished metal marched to the Minister's side and saluted the Emperor.</p>\n<p>\"T-Thank you for your graciousness, Your Majesty,\" the minister fawned. But right as he was about to rise, a heavy hand descended on his back and held him in place. One of the armoured men dragged forward a table and placed it before him.</p>\n<p>\"It has already been a day, Minister Graves,\" the Emperor revealed with a dangerous edge in his voice.</p>\n<p>The armoured man who brought the table pulled the minister's left-hand forward and grasped his pinkie finger with a vice grip and pressed it against the table.</p>\n<p>\"Y-Your Maj-\"</p>\n<p>With a deft movement, the armoured man slashed a dagger from his belt, causing the finger to separate from the hand. He then pushed his metal glove, which was a shade of luminescent red after being heated, against the wound causing it to cauterise instantly.</p>\n<p>\"AAAAAAAAAAHHHHHHH!\" The minister shrieked as he held his left hand, short of one finger.</p>\n<p>\"You have nine more days,\" the Emperor joked. \"Make them count, or you may lose the ability to count altogether.\"</p>\n<hr>\n<p>Silence reigned in the throne room after that over-the-top display of brutality. The Emperor wasn't one to endorse such violence, as his tenure to date had been fairly modest. However, the ministers could gauge the cause for such a reaction.</p>\n<p>The relationship between the common folk, the clans, and the government (which by extension encompassed the crown) has always been a precarious tightrope walk. While all the crown cared for was the support of the clans, it would be idiotic to write off the power of the commoners in its influence on the Empire as a whole. Commoners that believed in the Crown's authority often performed better than those that were disillusioned by it. And in a state where the majority were illiterate and ill-informed, it was unbelievably easy for the opinion of the populace to shift from one spectrum to the next.</p>\n<p>Furthermore, human psychology tended to devolve and matched that of sheep when the number of voices comprising the flock exceeded a certain amount. Given enough momentum, it could even turn the opinions of the clans that governed the many sectors of the Empire.</p>\n<p>The events that transpired yesterday, if left to fester without a proper resolution, would eventually enter the rumour mill and evolve into something damaging to the Empire's reputation. This was because, amongst the many dead from the terrorist attack, a good portions were high-ranking officials and ministers who reported directly to the Emperor. The story could only focus on the number and nature of the casualties for so long before the question moved on to what those officials were doing in such establishments of ill-repute in the first place!</p>\n<p>The Crown was already facing heavy criticism from the clans and the common folk for its decision to yield to a peaceful resolution in the long-standing war against the Blackstar Kingdom. If the news of the officials' borderline illegal sexual proclivities made the rounds as well, then the citizen's trust towards the crown - which was already hanging by a thread - would snap!</p>\n<p>\"Your Majesty, the Kingdom is pressuring us to decide on the date for the Marriage between the Princess of the Empire and the Prince of the Kingdom,\" the Minister of Foreign Affairs brought up worriedly, breaking the charged silence.</p>\n<p>\"We have yet to decide on the Princess, how can we settle on a date?\" The Emperor sighed exhaustedly. \"Must we go through with this decision?\"</p>\n<p>\"Your Majesty, they refuse to budge on this stand...\"</p>\n<p>The Emperor was about to respond when suddenly, his head darted upwards and his gaze sharpened in the direction of the Inner Court. A faint tremor passed through the room, causing the pillars holding up the ceiling to creak lightly.</p>\n<p>\"Head Eunuch Row-\"</p>\n<p>\"This slave will investigate the disturbance,\" a masculine voice with a feminine tune interjected the Emperor's sentence before a man dressed in the Head Eunuch's attire appeared out of thin air, bowed, and disappeared.</p>\n<p>The Emperor flashed a look towards the Imperial Forces stationed in the room and transmitted a series of commands telepathically. Although he'd lent an appreciable amount of his forces to the City's guard, there was still enough remaining to handle this... situation.</p>\n<p>\"The court is adjourned,\" the Emperor declared as he stood up with a flourish. With that said, the ministers filed out of the room hurriedly. He then proceeded to walk at a brisk pace towards the source of the disturbance while spreading out his senses to collate as much information available as possible.</p>\n<p>\"It appears that a pest has, quite literally, entered our backyard,\" he mused while observing the fight between Eunuch Row and the assailant. \"And it appears that it has taken something... valuable from us.\" The caretakers of the Royal-Blood Lanterns were skittering around in worry over the doused lantern of the Second Princess.</p>\n<p>Who was this Second Princess? Why hadn't he heard of her? What was her name? Where did she-</p>\n<p>The Emperor exuded a calm and collected aura, but he faltered when in an instant, the presence of his most trusted servants ceased to exist!</p>\n<p>\"Guards! Form up, now!\" He bellowed, before bursting out from his position. Tracing the movement of the intruder, he predicted the path he would move through and commanded the Imperial Forces to form an impenetrable barricade in advance.</p>\n<p>For the first time in forever, the Emperor stood battle-ready in front of his army. His form was steady and unwavering, his gaze narrowed and focused, and his presence radiating an aura of absolute confidence.</p>\n<p>The wait lasted minutes, but the tense atmosphere hanging over the defending forces caused it to feel like hours. Eventually, the target entered the visible range. The man, or thing, walked casually and nonchalantly but exuded an explosive aura of destruction. None of the soldiers standing behind the Emperor could stand still when facing the approaching entity that emanated a deathly, green, corrosive flame with every step it took.</p>\n<p>The contraption with the human face, and its appearance sparked a hint of recognition from the deepest recesses of the Emperor's memories.</p>\n<p>\"So one of the Yoruz Clan's dastardly contraptions still lives? Here we thought that the knowledge and skill to create them went extinct with that wretched woman,\" he commented as he stepped forth. The memory he recalled wasn't pleasant - the Emperor anticipated an extremely frustrating fight. He was not looking forward to this at all...</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/nlnvr4olwhcd5x8v7zvcwda\">Chapter 274 - Departure from the Capital</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/v6ody43h0mot549l0upzh46\">Chapter 272 - All Coming Together (Part One)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}