{"pageProps":{"note":{"id":"ijKtQUCIPNAOBbcTAXb9A","title":"Chapter 050 - To Do or Not To Do","desc":"","updated":1643622911568,"created":1643569310890,"custom":{},"fname":"volume-1.chapter-050","type":"note","vault":{"fsPath":"vault"},"contentHash":"f642286220307a544a9a110acc792eb4","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-050","id":"ijKtQUCIPNAOBbcTAXb9A","vaultName":"vault"},"value":"volume-1.chapter-021","position":{"start":{"line":141,"column":3,"offset":11630},"end":{"line":141,"column":27,"offset":11654},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-021"}},{"from":{"fname":"volume-1.chapter-049","id":"bfd79j7lw7nza2be2s6dg0g","vaultName":"vault"},"type":"backlink","position":{"start":{"line":131,"column":3,"offset":11660},"end":{"line":131,"column":27,"offset":11684},"indent":[]},"value":"volume-1.chapter-050"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-050---to-do-or-not-to-do\">Chapter 050 - To Do or Not To Do<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-050---to-do-or-not-to-do\"></a></h1>\n<p>Guy was extremely impressed at Karmin's efficiency. Just two weeks after they hashed out their contract, steel weapons and armour started to make an appearance in the market!</p>\n<p>Guy didn't know whether the bureaucracy of registering this world's equivalent of a patent was as extensive as back on Earth, but he could make an educated guess.</p>\n<p>In addition to that, Karmin had taken Guy's advice and tested with varying the carbon content in the steel being produced and had also released weapons with higher and lower carbon content to fit the user's needs. Some weapons also contained a mix of both types, which reminded Guy of the katanas from Earth.</p>\n<p>On top of that, Karmin had also begun testing with alloying steel with other kinds of mana metals to create element-aligned and mana reactive weapons and armours. Most of these appeared to be in the testing phase, but the oral advertising in and around The Burning Forge encouraged the crowd to pre-order for a lowered price.</p>\n<p>Guy inwardly praised Karmin for his business acumen. The man knew how to work the population like sheep. His marketing strategies could only be defined as textbook examples from Earth!</p>\n<p>However, unlike most capitalistic businessmen from his old world, Karmin was a man true to his words. Karmin registered Guy's current bank account with Drayden Bank as the deposit point for Guy's share of the profits from the sale of steel weapons. The benefit of being a partner to a massive company with branches in different cities and towns was that the scope of sales was massive. This meant that Guy found himself flush with cash very quickly.</p>\n<p>During the past four weeks, Guy had been on cloud nine. He was tempted to withdraw the amount from his account, lay it over his mattress and roll around!</p>\n<p>The currency in this world was archaic. Copper coins made up the lowest denomination. A hundred copper coins comprised a silver coin, and a hundred silver coins comprised a gold coin. These currencies primarily applied for the purchase of mortal and low-magic items. For items that were exclusively suited to mages, the common currency was in mana crystals of low-, medium- and high-grade.</p>\n<p>A common person could survive a day with 20 copper coins. It would cover their living arrangement in a shabby inn and their sustenance from cheap street food.</p>\n<p>With that as a baseline, an average forged steel weapon was sold at the price of 50 silver coins. An average forged iron weapon is sold slightly lower at 30-40 silver coins. Casted weapons cost a quarter of the amount due to their ease of manufacturability.</p>\n<p>So in essence, Guy was making around 2 to 6 silver coins per sale. Alone it may not sound like much, but considering the scale, it was no coincidence that Guy had to upgrade his bank's package!</p>\n<p>As Guy was returning from the local branch of Drayden Bank, he kept his ears open for the gossip lingering in the streets.</p>\n<p>\"Have you heard of the new steel weapons by The Burning Forge?\"</p>\n<p>\"Yea... who are you again?\"</p>\n<p>\"Oh, I'm just a passerby, good citizen of Radiant City.\"</p>\n<p>\"Okay...\"</p>\n<p>\"Apparently, the steel weapons are exactly like Dwarven metals!\"</p>\n<p>\"What? No way! The Burning Forge is probably falsely advertising again. I heard a rumour that they're skimping on-\"</p>\n<p>\"Yes way! The Smithing and Enchanting Guild as guaranteed it as so!\"</p>\n<p>\"Wow! I bet it costs a lot though...\"</p>\n<p>\"No! I heard that it costs almost the same as an iron weapon!\"</p>\n<p>\"Really! I need to check that out.\"</p>\n<p>\"Yes, good citizen! You should go this afternoon. The Burning Forge is going to do a demonstration in which they will clash a steel sword with the market's alternatives of the same cost. I heard that steel is much, much stronger!\"</p>\n<p>\"That's probably a reach. I bet they'll use faulty test weapons to boost their credibility.\"</p>\n<p>\"They are also accepting audience participation. If you can bring your own weapon made of metal alloys from a list published in the market's bulletin board, and break The Burning Forge's steel weapon of the same type, then you can qualify for a massive cash reward!\"</p>\n<p>\"Wow! I'm going to see if my Kaminite-Orichalcum broadsword qualifies for the test!\"</p>\n<p>Guy chuckled at the inconspicuous shill's effectiveness in influencing people. He secretly threw up a thumbs-up and a 'Fighting!' as he passed by.</p>\n<p>Radiant City was considered the commerce capital of the Solar Empire. The Maika Clan didn't have many mage powerhouses backing them, but they were so financially endowed that the Emperor had no choice but to respect their Duchy. Their success was in part due to their laxer trade and commerce laws, as well as their willingness to invest in local industries that showed promise.</p>\n<p>Since it was their speciality, Radiant City, which was the centre of the Maika Duchy, had a bustling yet well-managed commerce district. It wasn't haphazard like in most other cities. For a business to open a stall in the district they had to go through multiple stages with the city's management to get the permit. The city had planned the commerce district with great detail. Even for a first time visitor to the city, all it would take was an initial visit to understand the layout.</p>\n<p>For instance, Guy was interested in purchasing ingredients for the inscribing ink for enchanting. To get this, he had to visit the section of the district that bordered the weapons and armours, and the alchemy departments. It was an intuitive process.</p>\n<p>Guy followed the directions displayed on the signs hanging near the streets and managed to reach the street that corresponded to the shops that catered to both alchemists and enchanters.</p>\n<p>Through word of mouth, Guy knew that only one shop in this street could cater to his needs, and so he scanned the boards hanging in front of the shops for \"Myriad Emporium\".</p>\n<p>As he pushed open the doors of the shop, a pleasant ring echoed and indicated his presence.</p>\n<p>\"Good afternoon, customer! Welcome to the Myriad Emporium, home to a myriad of ingredients and materials for your enchanting needs. How may I help you?\"</p>\n<p>A smiling woman who appeared to be in her late 20s walked over with a cordial aura around her.</p>\n<p>\"Hi, I'm looking to purchase the following ingredients. I was wondering if you have them available?\" Guy responded while handing over a paper listing a bunch of materials.</p>\n<p>The woman took the list with both hands and read through its contents. As her eyes descended downwards, her forehead furrowed incrementally.</p>\n<p>\"May I ask what your purpose might be with these ingredients?\" she probed.</p>\n<p>Guy frowned, \"Why? You don't have them here?\"</p>\n<p>She quickly shook her head, \"Oh no! We have them with us! It's just that you're asking for two phials of Slime Residue. As you may already know, harvesting Slime Residue is a very time consuming and complicated process. You have to nurture the slimes, feed them with biomatter of the proper type, manage their exposure to the elements, and so on. It's not just us, but even the other stores in this street will tell you the same thing. Hence we require proper verification from our customers who place an order for this material.\"</p>\n<p>The woman followed up, \"Based on the other ingredients, I can posit that this is for making inscribing ink. Can you please produce your enchanting license?\"</p>\n<p>Guy smiled bitterly and responded, \"Actually, I'm not an enchanter. I don't have a license.\"</p>\n<p>The woman snorted to that statement, \"Without your license, I cannot sell it to you.\"</p>\n<p>\"Is there really no other way?\" Guy pleaded.</p>\n<p>\"Ha!\" The woman scoffed. At this point, she was losing her patience. The man was clearly ill-informed and a complete novice. Just looking at the materials on the list, the woman knew that he was reaching beyond his limits. Her arrogance was fell founded, though. She was after all a Practicing Enchanter. Even though she failed her 1-star license test two times in a row, her qualifications placed her above the bumbling idiot before her.</p>\n<p>\"If you want to purchase Slime Residue without a license, then you'll have to pay a 50% mark up,\" she commented offhandedly. Slime Residue was already an expensive item worth 1 gold coin per phial, to add a 50% mark up on top of that was daylight robbery! However she didn't care, she just wanted to get rid of him, and possibly flaunt her superiority along the way.</p>\n<p>Guy frowned and contemplated on the turn of events. 'What the hell is happening? Is she looking down on me?'</p>\n<p>He already had an estimate of the cost to purchase all the items on the list. It was well within his capacity after his most recent windfall. Even with that 50% mark up, Guy could comfortably make the purchase.</p>\n<p>'Wait a minute! This is my chance!' Guy exclaimed internally. 'Finally! After so many months, it is my opportunity to taste the high from a juicy face slap!'</p>\n<p>Guy's lips extended into his cheeks to form a sly grin. He reached into his jacket pocket to grasp his new and improved bank account token. He was preparing to pull it out flaunt the luminescent metal indicating his richness.</p>\n<p>'Time for this woman to behold this rich young master and his coffer full of gold! Hehehehe.'</p>\n<p>However, as his hands were about to leave the pocket, they stopped. No matter how hard Guy tried, he just couldn't pull it out and peacock his rich young master-ness.</p>\n<p>The pocket wasn't physically obstructing him, it was something else. Something inside him. Deep inside him, his tranquil puddle of cultivation perceived a tremor. It threatened to send the environment into flux.</p>\n<p>But the disturbance was slowly quenched, step by step, until tranquillity resumed.</p>\n<p>'I shouldn't do that... She didn't do anything wrong. It was a misunderstanding after all...' Guy started to rationalise.</p>\n<p>Finally, Guy sighed in defeat and retrieved his token, without any additional extravagance.</p>\n<p>\"I guess it was my mistake,\" Guy said in an apologetic tone. \"However I really need it, so I can't do anything but it.\"</p>\n<p>He handed the token to the woman and added, \"Please charge it to my account. Thanks!\"</p>\n<p>The woman held the luminescent token with an agape expression. She knew from experience that not everyone was entitled to such a high-end account from Drayden Bank. It was solely awarded to the whales, the high rollers, the nouveau riche!</p>\n<p>She gulped to swallow the disdaining words that were on the tip of her tongue and smiled cordially once again. She was thankful that this young master wasn't vengeful and was willing to forgive her faux-pas.</p>\n<p>\"I shall pack things up immediately! Please wait for five minutes. Would you like some beverages or snacks while you wait?\" She added.</p>\n<p>Guy shook his head and took a seat inside with a smile.</p>\n<p>The woman quickly rushed inside and returned as promised after five minutes with a wooden box help by both hands.</p>\n<p>She carefully placed it on the table before Guy and retreated with a bow. Guy opened the container and inspected its contents while cross-referencing it against the list. After he was satisfied, he closed the box.</p>\n<p>She then handed an invoice to obtain Guy's signature. Guy observed that on it, she hadn't added the mark up. Guy didn't want to bring it up, because he knew that the woman wanted to scrub those arrogant words from existence.</p>\n<p>Guy signed without any hesitation. She then proceeded to stamp the bank token on the invoice to leave a clear and visible imprint.</p>\n<p>Guy lifted the box and left the establishment without any further delay. But before he left, he offered his thanks to the woman and smiled politely.</p>\n<p>The woman bowed even lower and directed Guy towards the door as a sign of respect. Once he turned the corner, the woman unwound her stressed self and sighed in relief.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/abZuubVxzSmXlehhWb3VZ\">Chapter 021 - Wei Zao vs. the First Arrogant Young Master</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/bfd79j7lw7nza2be2s6dg0g\">Chapter 049 - (Interlude) Shady Dealings</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}