{"pageProps":{"note":{"id":"intj2ry8wdnvffwxytsgibq","title":"Chapter 181 - Heart-to-Heart","desc":"","updated":1654026184153,"created":1651742519768,"custom":{},"fname":"volume-3.chapter-181","type":"note","vault":{"fsPath":"vault"},"contentHash":"9ba3d74c64b41a222cc58c0930127af9","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-181","id":"intj2ry8wdnvffwxytsgibq","vaultName":"vault"},"value":"volume-3.chapter-182","position":{"start":{"line":119,"column":3,"offset":10772},"end":{"line":119,"column":27,"offset":10796},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-182"}},{"from":{"fname":"volume-3.chapter-180","id":"4alhm3o85hzg0etg8eqmp96","vaultName":"vault"},"type":"backlink","position":{"start":{"line":81,"column":3,"offset":9346},"end":{"line":81,"column":27,"offset":9370},"indent":[]},"value":"volume-3.chapter-181"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-181---heart-to-heart\">Chapter 181 - Heart-to-Heart<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-181---heart-to-heart\"></a></h1>\n<p>Marek's feet twitched due to the stress building up inside him. It had been a long time since he poured his heart out like this. His previous experience, many years ago, had wounded him greatly and he was anxious to see how it would go this time.</p>\n<p>He alternated his gaze between the table and Al's face. His conversation partner appeared distracted while gazing blankly into the wall. This simply worsened the turmoil in Marek's heart.</p>\n<p>'Give me a reaction,' Marek pleaded. 'Anything at all!'</p>\n<p>At that instant, Al suddenly raised his palm, brought it over his face, and started to shudder as a burst of mirthful, muffled laughter resonated from him.</p>\n<p>'That's...' Disappointing. Marek's heart ached once again. He wanted to dig a hundred feet-deep hole and bury himself in it. He wanted the world to end right now so that the past conversation would cease to exist. He wanted anything, absolutely anything, to save him from the humiliation he was feeling right now.</p>\n<p>\"I really can be stupid sometimes,\" Al commented. \"The answer was right in front of me - it was literally squashed up against my nose - but I was too absorbed in my paranoia to grasp it.\"</p>\n<p>\"W-What-\"</p>\n<p>\"I am flattered that you think of me that way,\" Al continued. \"Honestly, I really am. But I am not looking to pursue a romantic relationship at the moment. As you so correctly pointed out, I am going through something. Let's call it a disaster of my own creation. And I hope to resolve that first before moving on to other ventures.\"</p>\n<p>Based on Al's answer, Marek could see a faint glimmer of hope. \"If that's the case, maybe I can help? After all, two heads ARE better than one.\"</p>\n<p>\"While I appreciate your offer, I won't accept it. I once included someone in pursuit of solving this problem, only to bring peril upon them. I cannot in good conscience inflict the same pain on another person,\" Al denied immediately.</p>\n<p>Marek smiled bitterly, before sighing in relief. \"Thank you for that, Al. I really mean it.\"</p>\n<p>\"Thank you? For what?\"</p>\n<p>\"For your kind rejection,\" Marek answered. \"I didn't know it, but there was a heavy load weighing down on my heart this entire time. 'Should I tell Al? How would he take it?' Those kinds of questions were eating away at me from the inside. Now that I've brought it out into the open, and received closure, I feel lighter all of a sudden.\"</p>\n<p>\"Why should you feel so apprehensive?\" Al challenged. \"Is it about the stigma?\"</p>\n<p>\"Obviously! Like I said before when I was still a budding mage, I grew attracted to a fellow Sect member. He was a kind-hearted lad who wouldn't think twice before helping others. Although he didn't make much headway in his cultivation, he was always willing to guide and trade pointers,\" Marek started with a nostalgic glaze in his eyes.</p>\n<p>\"Over time, my affection for him kept growing and growing. It reached a point where I couldn't contain it within myself. And so, I took a leap of fate and confessed. I thought he was... like me. The nature of our interactions made it appear as such. But he-\" Marek flinched as he recollected the moment. \"He put me out to dry. Let's say his rejection wasn't as dignified as yours. Ultimately, he let it slip and then everybody in the Sect knew - of the deviant named Marek Glista. I realised then that this world had no place for people such as myself. Thankfully I wasn't weakhearted. I could bear the jeers and deriding comments. I worked my ass that day forth. And now, none who looked down on me remain alive. They either succumbed to the tests of time or my blades.\"</p>\n<p>\"What of that boy who betrayed your trust?\"</p>\n<p>\"He killed himself,\" Marek answered flatly. \"While it may sound morbid, his death was what helped me get over that whole debacle. When I found out that he killed himself, I realised that I wasn't the only one who held affection for the other in our friendship. He too reciprocated my feelings, but he was in denial of his own identity the entire time. He feared validating his feelings for me. It gave me comfort to know that I wasn't alone, but I was also a little dismayed that he chose that path.\"</p>\n<p>Marek paused once he finished the anecdote and said, \"But I am surprised that you aren't offended or repulsed by my expression of affection towards you.\"</p>\n<p>\"Why should I be offended, more importantly, why should you feel anxious about it either way?\" Al retorted. \"You are in a position where you dictate the rules! To hell with what other people think, they're all hypocrites.\"</p>\n<p>\"Are you trying to make me feel better?\" Marek smiled.</p>\n<p>\"You think your love for another man is unnatural and abnormal? What of all the people who wouldn't think twice before laying with other species? Is that not unnatural?\" Al reasoned. \"Your affection is pure. You didn't force yourself on anyone nor did you pressure anyone, you were considerate the entire time.\"</p>\n<p>\"The way you rejected me earlier, I get the feeling that you've been in a relationship with another man before?\" Marek probed.</p>\n<p>Al nodded, \"Of course! You should know that my cultivation urges me to try and learn new things. I have experimented with a man. It was pleasant, I won't deny it.\"</p>\n<p>\"I am envious of the man who you shared that experience with,\" Marek said with a wry and dismayed expression.</p>\n<p>\"Don't be so dramatic. It was just physical,\" Al shot back. \"I know that you're looking for something more substantial.\"</p>\n<p>The ambience in the room turned brighter at this point as both sides lowered their guards against each other.</p>\n<p>\"Since we're being truthful here,\" Al followed up. \"That kid isn't my Student, and that man isn't my Apprentice.\"</p>\n<p>\"Are you talking about your companions?\"</p>\n<p>\"Yes. The kid's actually the man's Disciple,\" Al confessed.</p>\n<p>\"Really? This is the first time for me - seeing a Master and Disciple both in the same cultivation realm. Did the guy con the kid into entering his discipleship?\" Marek asked incredulously.</p>\n<p>\"No. But their circumstances are... special. I won't expound on it as it isn't my place to do so,\" Al clarified. \"But I urge you to observe them more carefully, and not dismiss them so readily. Who knows, maybe you'll see something interesting?\"</p>\n<p>\"I still don't get why they need to peruse the Sect's archives,\" Marek pointed out.</p>\n<p>\"It didn't HAVE to be the Cloudstrider Sect. We would have made do with any other, but this was convenient given the favour. And it worked to our benefit due to the Sect's rich history,\" Al answered.</p>\n<p>\"Let me guess, you're thinking of starting your own sect?\" Marek guessed. \"That's not possible though, you are already associated with the co-operative of Teachers... So it's that man then?\"</p>\n<p>\"Astute deduction,\" Al lauded.</p>\n<p>\"It's going to be difficult,\" Marek responded while shaking his head. \"The scene is quite saturated. Just last year, the Solar Sect Alliance welcomed 250 new registered Sects of which only two remain functional, that too as subsidiaries of the Poison Rain Sect down south.\"</p>\n<p>\"I don't think that's going to be an issue,\" Al assured.</p>\n<p>\"Why?\" But Marek immediately followed by exclaiming, \"Don't tell me! Given how calm you are, it must mean that it's basically a done deal - a guaranteed success. That can only mean that the man has a strong backer.\"</p>\n<p>\"I have no comments,\" Al responded with a blank expression.</p>\n<p>\"Your silence speaks volumes,\" Marek chuckled excitedly. \"So who is it? Anyone, we know? Can't be, all of our acquaintances are deeply affiliated with one group or another. Must be someone from outside! Is it a foreigner?\"</p>\n<p>\"I was promised an NQA, what's with all these questions?\" Al complained with an exaggeratedly scandalized tone.</p>\n<p>\"<em>tsk</em> You're no fun! That's okay, I'll have to cross paths with them anyways. I'll be the one representing the Cloudstrider Sect in the next Alliance gathering. The Sect Leader is growing increasingly worried,\" Marek grumbled while scratching his forehead. \"It ain't my fault that he can't birth a capable heir! Honestly, the years of stagnancy have caused malicious rot to set in.\"</p>\n<p>\"Can't you do something about it?\" Al suggested.</p>\n<p>\"Why should I? The idiot that I am, I made a Soul Contract with the Sect when I got this position. I was too young and hot-headed back then. So long as this Sect exists I will be forever tethered to it,\" Marek blurted out. \"The sooner that I'm free, the sooner I can go about doing something productive with my life.\"</p>\n<p>\"Shh!\" Al cautioned. \"What if the Sect's Ancestor hears?\"</p>\n<p>\"Do you think that fossil's still alive?\" Marek scoffed. \"It's been years since he entered seclusion in pursuit of an inspiration. My guess is that the bloke failed and Ascended. It's all smoke and mirrors I tell ya!\"</p>\n<p>\"I don't understand why you decided to tie yourself with a Sect. Life is so much freer when studying in an Academy,\" Al lamented on Marek's behalf.</p>\n<p>\"That's because your family was loaded, isn't that right?\" Marek sneered. \"I wasn't so lucky. And my 'talent' towards cultivation required a lot of arduous unearthing to manifest. It wouldn't have been tractable if I joined an Academy. See, each side has its advantages and disadvantages, Al.\"</p>\n<p>At that moment, Marek and Al both cocked their heads toward the entrance to the room with a frown on their faces. Within seconds of them turning, a series of knocks resounded from the door.</p>\n<p>\"Elder Glista! Elder Glista!\" A man's concerned voice called out as a blonde-haired, bearded figure burst in.</p>\n<p>\"I'm entertaining a guest, Korr,\" Marek warned sternly, his mana pushing forcefully against the hyperventilating man. This was enough to let Marek know that an act was underway - why else would a Core Formation realm expert breathe so heavily? </p>\n<p>\"You better have a good reason for this interruption if you wish to leave with both your eyes intact. And know this, after I remove your eyes if I ever see them healed and functioning I will gauge them out again right then and there.\"</p>\n<p>Without flinching, or hesitating, the man named Korr spoke up, \"Young Mistress Loras and Elder Glista's guest are duelling! A verbal spat devolved out of control into a physical confrontation which then turned into a life-or-death duel, which unintentionally triggered the Life-and-Death Formation. This slave implores the Elder to intervene!\"</p>\n<p>\"Those are lies,\" Al denied flatly. \"Markus would never willingly participate in any such duels.\"</p>\n<p>\"And yet, the formation is active,\" Marek muttered with a concerned frown as his senses detected the formation in use within the Outer Division. \"The girl has grown impudent. Her father's idiotic doting has spoiled her to her core.\"</p>\n<p>Without wasting a second, Marek gestured at Al and disappeared from his room. Once the two experts had gone, the exhausted Korr immediately dusted himself and wore an impassive expression once again. He then followed the duo as well.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/cpv9q4newgverol3d8fchw4\">Chapter 182 - Outplayed, Outdone, Outclassed</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/4alhm3o85hzg0etg8eqmp96\">Chapter 180 - Ulterior Motives</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}