{"pageProps":{"note":{"id":"iscq05hi6cp9ca7ff09wx35","title":"Chapter 233 - Next Stop","desc":"","updated":1665514937471,"created":1662631127525,"custom":{},"fname":"volume-4.chapter-233","type":"note","vault":{"fsPath":"vault"},"contentHash":"e3aa67ff0c39bdf03e3bcdf2b3e45084","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-233","id":"iscq05hi6cp9ca7ff09wx35","vaultName":"vault"},"value":"volume-4.chapter-234","position":{"start":{"line":91,"column":3,"offset":10863},"end":{"line":91,"column":27,"offset":10887},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-234"}},{"from":{"fname":"volume-4.chapter-232","id":"tvwuvat47agbfehxlb3qqt1","vaultName":"vault"},"type":"backlink","position":{"start":{"line":69,"column":3,"offset":9538},"end":{"line":69,"column":27,"offset":9562},"indent":[]},"value":"volume-4.chapter-233"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-233---next-stop\">Chapter 233 - Next Stop<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-233---next-stop\"></a></h1>\n<p>The duo arrived at Dawnbreak Town right as the dockworkers were leaving for their lunch breaks. Lea proceeded to offload her goods, a process Liam inserted himself into, going against Lea's repeated insistence. He carried the stack of baskets all by himself and deposited it at Lea's usual spot. Marie and Krish split off around that point, noticing that Liam had also insisted upon managing the sales of the dumplings before they parted ways.</p>\n<p>\"He's a kind man,\" Marie commented.</p>\n<p>\"Kindness borne of selfishness,\" Krish responded cryptically.</p>\n<p>\"He doesn't seem interested in receiving a payment, though,\" Marie countered with a frown. Krish stopped in place and gazed pointedly at his Disciple. It looked as though he intended to say something, but he swallowed his words and simply moved past her.</p>\n<p>\"Hey, wait up!\" Marie jogged after her elusive Master who glided over the ground while still walking with a visible hobble.</p>\n<p>This wasn't Marie's first time coming to Dawnbreak Town. Most of her earlier assignments with merchant caravans passing through Wayward Town would end at this junction. Since no rivers were flowing into the sea within the Maika Duchy, merchants that wished to transport their goods overseas had to inevitably converge at Dawnbreak Town. Although the Maika Duchy had the largest coastline within the Solar Empire, a large portion of it was inaccessible to large vessels and ships either due to extremely shallow waters or cliff and mountainous regions. Dawnbreak Town happened to have the perfect conditions for establishing a port and dock for both trading and overseas travel and was thus one of the first few towns established within the Solar Empire. Currently, its size rivalled that of a small- to medium-sized city. The only reason for keeping the 'Town' designation in place was the fact that the population was sparse in comparison to the town's physical span.</p>\n<p>Most of Dawnbreak Town - almost three-quarters of it - was made up of docks and ports. Various ships and cargo vessels were anchored in these locations, loading and unloading both cargo and people. Right opposite the docks and port was a sprawling market with high foot traffic and a wide variety of offering both local and foreign in nature. Much like the hasty sales made in Wayward Town by merchants looking to offload possible loss-making goods, the market opposite the docks served a similar purpose. Oftentimes, certain imported goods or goods set to be transported out may not survive the trip to their intended destination. Thus, to recoup the costs, these goods are sold at a more discounted rate. People within the Duchy would travel from far and wide to benefit from these discounts, it would be impossible to get foreign products at such prices otherwise.</p>\n<p>\"I suppose our purpose is beyond shopping?\" Marie snorted as she inspected a quaint yet charming doll made of palm fronds displayed on a seller's stand. Palms trees weren't common in the Solar Empire. They were endemic to the Red Waste, a sprawling desert on one of the continents past the Vast Blue Expanse. The stall owner also happened to have a darker complexion and a large roll of cotton cloth forming a turban three times the size of his head. He immediately reached forward and grabbed Marie's hand, \"You touch, you buy!\"</p>\n<p>\"Huh?\"</p>\n<p>\"You touch goods,\" the man said while pointing at the palm frond doll. \"You buy.\"</p>\n<p>\"Wha- How much for this?\" Marie asked exasperatedly. In response, the man raised three fingers. Marie reached into her pockets and retrieved three copper coins, yet instead of accepting the payment, the man shook his head in denial.</p>\n<p>\"Three silver,\" the man declared.</p>\n<p>\"Three silver? For this doll?\" Marie shrieked. \"Are you out of your mind?\"</p>\n<p>\"Foreign craftsmanship. Unique. Fair price,\" the man countered without budging on his stance.</p>\n<p>\"I don't have three silver,\" Marie shot back with equal stubbornness.</p>\n<p>\"Then we have problem,\" the man said with a morose intonation. \"I will lodge complaint with the Town Magistrate.\"</p>\n<p>At that moment, three silver coins whizzed past Marie and landed expertly upon the turban-garbed man's stall. The man gazed at the coins, followed their trajectory and observed Krish standing in a neutral leaning stance. The man picked up the coins and slid them into his turban, then lifted the doll Marie had touched, wrapped it in rough cloth and handed it to her.</p>\n<p>\"Thank you for your purchase,\" he said as Marie took the wrapped doll.</p>\n<p>\"Can we stop dilly-dallying?\" Krish inquired with a sigh. Marie snorted and jogged after her Master.</p>\n<p>\"Jerk!\" Marie spat indignantly. \"It's not even a food item! It's not like me touching it would ruin anything?\"</p>\n<p>\"The people of the Jehakan Confederacy do not tolerate half-measures,\" Krish explained. \"They are literal in every sense of the word. You either do or do not, want or want not. If you want or do, you must not waste it. If you waste, you die. Do you see that turban on his head? Every child after their fifth birthday must start wearing the turban, both boys and girls. They must wear it at all times when they leave their domicile. Then, at every subsequent birthday, they must unroll their turban in front of an invited stranger and wrap themselves in it. If the roll of material falls short, they must then stitch on an extension so that they are able to cover their entire body. Ultimately, at their time of death, their corpse must be fully bound using the cloth forming their turbans and buried in the Red Waste.\"</p>\n<p>\"That's... morbid,\" Marie commented with a shiver.</p>\n<p>\"Very much so. The purpose of this tradition is to enforce the fact that death is inevitable and unpredictable, and that one must go through life without hesitation and apprehension,\" Krish concluded.</p>\n<p>\"I don't think I want to go there,\" Marie murmured.</p>\n<p>\"Actually, the Jehakans are a rather hospitable folk. They never let a guest leave without having a meal. And their cuisine is one of the best I've ever eaten in my entire life. The things they can do with camel meat- Oh we're here!\"</p>\n<p>Marie halted alongside her Master and laid her eyes upon their destination. \"Isn't this the head office of the Raynor Ship Management?\"</p>\n<p>Marie was familiar with the organisation known as Raynor Ship Management - every merchant worth their salt knew of Raynor Ship Management. It was one of the longest-running businesses in the Solar Empire. In an ecosystem where a business' survival balances at the edge of a cliff every single day, finding a business that had survived for over two hundred years without the backing of a clan or sect and was still thriving was as rare as finding a Unicorn out in the wild. That is to say, Raynor Ship Management was a Unicorn in the business world.</p>\n<p>\"Are we going in there?\" Marie inquired while pointing at the heavily guarded entrance. A large wall surrounded the compound which acted as the head office for Raynor Ship Management. Like most head offices, it also doubled as the domicile of the business owner. To that end, a heavy battery of security systems protected the compound and the buildings within. A small squadron of guards, around six in total, was stationed at the entrance whose cultivation Marie could not observe using her mana sense - they were definitely beyond her but by how much? Furthermore, as she extended her senses beyond the wall, her perception experienced emptiness - as though nothing existed on the other side, not even air.</p>\n<p>Marie gulped audibly and probed, \"I don't think we can enter without an invitation-\"</p>\n<p>Before she could finish, she noticed Krish strolling nonchalantly towards the gate into the compound. Marie bit down a scream of surprise and followed her Master. As Krish approached the entrance Marie braced for an impending halt initiated by the guard, but contrary to her expectation, they simply passed through without a hindrance.</p>\n<p>\"What's happening?\" Marie whispered.</p>\n<p>\"You can speak normally,\" Krish said with a chuckle. \"They can't hear you, see you, smell you-\"</p>\n<p>Krish immediately yanked his hands to his chest, pulling Marie away from an approaching guard's path, \"They can still feel you, so be mindful of that.\"</p>\n<p>\"How can they not sense me? My presence should trigger something in them, right? The movement of the wind, the tremors from my footsteps... something?!\" Marie just could not understand how someone could just erase their presence so easily and selectively.</p>\n<p>\"You seriously underestimate the gap in power between a Tesseract Transformation realm mage such as myself and these unsuspecting saps in the Foundation Establishment realm,\" Krish said while gazing exhaustedly at his hyperventilating Disciple. \"For reference, it would take at least ten Al Jeeves-es to take me down!\"</p>\n<p>Marie grabbed her head in distress and said, \"What kind of nonsensical conversion is this? If it takes ten Teacher Jeeves-es to defeat you, how many Josies would it take to take down one Teacher Jeeves?\"</p>\n<p>\"What the hell are you talking about?\" Krish said while narrowing his eyes in disbelief. \"Stop trying to quantify power with maths! It's not like you can just look at someone and read out their level?\"</p>\n<p>\"You're the one who defined the ratio of 1:10!\" Marie argued. \"Hey, you haven't answered my question! How can they not sense us?\"</p>\n<p>Krish didn't entertain his Disciple any further and continued his hobbling walk through the front garden - a beautifully maintained ecosystem filled with flora from all around the world that also evoked a sense of age and antiquity. Weaving past the period patrols and workers managing the courtyards, the duo finally landed upon the mansion at the centre of the compound. It was a luxurious structure built of marble carved with painstaking precision. It was largely open, taking advantage of the pleasant breeze blowing in from the ocean.</p>\n<p>Before Marie could pause and appreciate the ingeniously symmetric architecture (from all cardinal directions), her Master glided forward and beelined through the corridors to the centre-most room. Approaching the door leading into the room, Krish rested his hands on the carved wooden board. From his palm, multiple spell circles flashed out in quick succession, faster than Marie's perception. Then, with an apathetic push, he swung the door open and entered.</p>\n<p>The door slammed shut behind Marie, causing the aged and wiry man, who was approaching his late fifties, seated behind the desk at the centre of the room to jolt in panic. His eyes ran all across the area, searching for something, at which point Krish released the occluding spell surrounding them.</p>\n<p>\"Who are you?!\" The man yelped in shock and moved his hands instinctively towards a plate underneath his desk. Yet at that instant, he found his entire body grasped in place rendering him completely immobile.</p>\n<p>\"W-What do you want?\" The man eked out through the chattering of his teeth.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/akpic96pj9uf5ab7ixy5jy9\">Chapter 234 - Superstition</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/tvwuvat47agbfehxlb3qqt1\">Chapter 232 - Opportunity Cost</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}