{"pageProps":{"note":{"id":"J84rpIfKwF1mmpPZXX528","title":"Chapter 058 - Apprentice Tournament (Part Three)","desc":"","updated":1643623338980,"created":1643569428716,"custom":{},"fname":"volume-1.chapter-058","type":"note","vault":{"fsPath":"vault"},"contentHash":"1680dfbe858c1adc3ec4429aa9c83395","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-058","id":"J84rpIfKwF1mmpPZXX528","vaultName":"vault"},"value":"volume-1.chapter-059","position":{"start":{"line":131,"column":3,"offset":10595},"end":{"line":131,"column":27,"offset":10619},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-059"}},{"from":{"fname":"volume-1.chapter-057","id":"xGYpzYgOaoBq0gbaBdIhp","vaultName":"vault"},"type":"backlink","position":{"start":{"line":163,"column":3,"offset":10321},"end":{"line":163,"column":27,"offset":10345},"indent":[]},"value":"volume-1.chapter-058"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-058---apprentice-tournament-part-three\">Chapter 058 - Apprentice Tournament (Part Three)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-058---apprentice-tournament-part-three\"></a></h1>\n<p>Guy Larks cursed his bad luck the moment the referee declared the match-up.</p>\n<p>'I'm up against Jo Way, right off the bat? Why?'</p>\n<p>No matter how hard Guy tried to distance himself from the agent of misfortune, he'd always end up getting drawn into the man's path of destruction.</p>\n<p>'It's as if the whole world is revolving around him!'</p>\n<p>(It's all a coincidence...) Mast would often reiterate in his mind.</p>\n<p>'I'd agree with you if it was the one time. But this? This whole thing reeks, I tell ya!'</p>\n<p>(But it really is a coincidence...)</p>\n<p>Anyways, Guy wasn't optimistic about the match-up. In all his experience reading those formulaic web novels from his old world, not once had a native from the world triumphed over a transmigrator. Even if there was a victory, they'd end up losing out miserably in the long run.</p>\n<p>Guy didn't overlook the fact that he too was a foreigner in this world.</p>\n<p>'I'm only a transmigrator in name. I don't have any boosts or cheats like Jo Way,' Guy sighed frequently.</p>\n<p>(Again with you and your cheats!)</p>\n<p>Many times, Guy had reassessed his decision to work as a teacher of magic because, in a lot of ways, this occupation was antithetical to his beliefs. Take this match for example! Introducing tweens to violence and subjecting them to pain at such an early age was a recipe for creating emotionless monsters.</p>\n<p>Because of that, Guy had spent a lot of time grooming Markus and appealing to his humanity. Guy didn't want him to become a psychopathic murder-hobo who would unleash his rage on all those that fronted him in the past.</p>\n<p>Seemingly, Guy's teachings had been effective, because Markus was exceedingly careful in his confrontation against Gaige.</p>\n<p>Guy knew for a fact that Markus was nerfing his spellcasting lethality. He could have very easily overpowered Gaige and maimed him, but he chose not to do that. Markus even repeatedly urged Gaige to surrender because he was averse to inflicting unnecessary pain on his peer.</p>\n<p>Was it admirable, or foolish? Was it brave, or cowardly? Guy couldn't be the judge of that.</p>\n<p>In all honesty, Guy would have done the same thing if he was in Markus' shoes. He couldn't just flip a switch in his head and accept the fact that he had to hurt someone so excessively.</p>\n<p>But his contemplation came to a sudden halt when Gaige unleashed a roar filled with an aura of intense suppression. It was at that moment that Guy nearly overturned his entire outlook on life and concluded that, 'Yep! Markus should have finished him when he had the chance...'</p>\n<p>Markus pushed Gaige to the edge. He suppressed him with his superior skills and spellcasting, and sent him into a pit of despair. Gaige was on the verge of defeat. But someone with a template of the MC wouldn't succumb to such as outcome so easily.</p>\n<p>As Gaige's roar resonated, a blanket of darkness emanated from him and covered the entire arena. The white in Gaige's eyes turned pure and marbly, while the bluish hue in his pupils deepened in colour. His blistering skin started to peel off as scales black as the abyss burst out and covered his torso and lower body. The scales encroached into and enveloped his appendages, revealing sharp and stark-black claws.</p>\n<p>The scales reached up to his chin and halted their progression. Instead, his canines elongated by a few centimetres.</p>\n<p>Guy gaped in disbelief as he heard Jo Way's hushed explanation of what transpired, \"Perfected resonance? That's just great...\"</p>\n<p>Mortals in the Late stage of Mana Condensation realms are technically able to advance into the Foundation Establishment realm. However, most don't do it straight away. This is because they wait to achieve what is known as perfected resonance. This is a state achieved by mortals that have perfectly assimilated the fundamentals of their cultivation method and have reached the optimal point to lay their foundations into the path of magehood. For many, this may take years after achieving Late stage Mana Condensation. Generally, if a mortal human is unable to achieve perfected resonance before they reach their 30s, they resolve to just advance without it at the cost of not being able to advance any further.</p>\n<p>Many criteria contribute to achieving perfected resonance. Ultimately, it all relies on the mortal's accumulation of pertinent insights into themselves and their cultivation. Having a Specialised cultivation method definitely helps in that regard. For Gaige, he managed to achieve perfected resonance after he understood the true power that lay within his bloodline. And what was his special bloodline?</p>\n<p>It was the Abyssal Wyrm!</p>\n<p>Guy had read about it in a book owned by Al Jeeves. The Abyssal Wyrm was a remnant from before the Age of Isolation. The reptilian species known as the Draconids were endemic to the Fel realm, known for their immense power and strong affinity to mana.</p>\n<p>During the times were the realms were connected, many Draconid species migrated from the Fel realm in search of unconquered lands. The Wyrm were a class of Draconids that were known for their snake-like appearance. They lacked appendages but had a lengthy body with immense strength. Wyrms were parametrically the largest species of Draconids in existence.</p>\n<p>The Abyssal Wyrm was the strongest subspecies of its kind. Its strength came from its inherent affinity to a very rare kind of mana - darkness. Many mages had tried to build an affinity to this mana, and only a few had succeeded. Those that failed suffered death so brutal, that it discouraged others from following in their footsteps.</p>\n<p>The blanket of darkness unleashed its power immediately after it stabilised. Markus quickly collapsed into a prone position, as if the weight of the entire world was dumped on him.</p>\n<p>Markus raised his wand and cast a spell through familiarity. However, the fire that burst out from the spell circle was sucked into the blanket of darkness, leaving no trace.</p>\n<p>Gaige remained stationary in his original position, but he directed his gaze on Markus and roared harder. In response, the pressure on Markus intensified. He found it harder to breathe.</p>\n<p>Slowly, he found that he could no longer raise his arms or legs.</p>\n<p>Guy started to fidget in place. He wanted to throw in the towel on behalf of Markus, but he held himself back with great difficulty. He couldn't make that move and demotivate Markus. This was a fight Markus had to overcome by himself, and Guy couldn't interfere no matter how much his conscience screamed for him to do so.</p>\n<p>The referee observed the fight with unwavering focus. He couldn't afford to make any mistakes, lest a student loses their life during his watch...</p>\n<p>He trained his attention on Markus and observed for an opportunity to intervene.</p>\n<p>Markus didn't let out! He gritted his teeth and held on to dear life.</p>\n<p>'Can't lose...' He repeated in his mind. If he gave up now, then he will have ruined his Master's only chance to become a teacher!</p>\n<p>Markus' lungs begin to collapse under the increasing pressure. But Markus was unwilling to let out. He measured his breath and tried his hardest to maintain consciousness.</p>\n<p>'Any... second! He can't maintain this enraged state for long,' he surmised.</p>\n<p>And true to his assumptions, the blanket started to recede into Gaige - he had run out of steam.</p>\n<p>Gaige wheezed as he tried to maintain his position; he was so exhausted that a light breeze could topple him. His scales and deformations started to recede as well, however, his chest and torso remained the same.</p>\n<p>Markus pressed his hand against the floor and tried to raise himself. His right hand grasped the wand and began to materialise a spell circle.</p>\n<p>Gaige's eyes widened in shock, 'This is it...'</p>\n<p>As he braced himself for an attack, he suddenly heard a loud thud.</p>\n<p>He squinted and looked ahead, only to see the slumped body of his opponent - unconscious.</p>\n<p>\"The victory goes to Number 32!\" The referee exclaimed.</p>\n<p>Right as his voice pierced through the silence, Guy rushed on stage and carefully turned Markus and lay him on his back. He then raised the boy's head and poured a potion into his mouth. After he made sure that the potion was consumed, he picked the boy in his arms and rushed off stage.</p>\n<p>\"I won...\" Gaige muttered in elation. \"I WON!\" He screamed with gusto.</p>\n<p>The audience didn't chime in with cheers, though. They were still shellshocked by the events that transpired.</p>\n<p>\"You did it! Good job!\" Jo Way praised as he rushed over and supported the weak Gaige. \"Let's get you fixed up, hmm?\"</p>\n<p>\"I did it, teacher! We did it!\" The boy muttered in a low voice as he trailed along while slumped onto Jo Way's shoulders.</p>\n<p>Wei Zao smiled at Gaige's face, but when the boy diverted his attention, the smile regressed into a thoughtful frown.</p>\n<p>Many details stood out and gnawed at Wei Zao during the match.</p>\n<p>Gaige's cultivation with the Insight into the Abyss had tailored his body to match the Abyssal Wyrm as closely as possible. This allowed the boy to uncover the truths of the bloodline and had managed to achieve perfected resonance. The fact that Gaige had achieved it so early - at the age of 13 - was both a boon and a curse for Wei Zao. Gaige definitely wasn't an outlier; many other extraordinary talents had managed to achieve perfected resonance near his current age. However, many powerful sects, clans, organisations and empires collected such extraordinary talents at all costs. If word got out, he'd have to contest with these powerhouses to keep Gaige. With his own strength being only at the Base stage of Foundation Establishment, his chances weren't promising. </p>\n<p>But that wasn't Wei Zao's biggest concern.</p>\n<p>\"Unknown cultivation method?\" Wei Zao muttered in disbelief. This was the first time that his Omniscient Library had thrown such a value at him.</p>\n<p>Furthermore, it even failed to discern the spells that were cast by Markus. Not even a hint!</p>\n<p>This automatically triggered red flags in Wei Zao's head. If his system, which labelled itself as omniscient, had gaps in its knowledge, then there were definitely higher powers at work.</p>\n<p>He realised that he had been a bit too lax by placing his complete trust in the system. He was simply a pawn in the games played by those that managed these infinite worlds. Maybe, the system was a tag placed on him to keep him under their control.</p>\n<p>'Is Markus also a transmigrated soul?' Wei Zao asked his system with some suspicion.</p>\n<p>Annoyingly enough, he was received by silence, {...}</p>\n<p>'Stupid system!' He cursed. After a moment of contemplation, he formulated a plan.</p>\n<p>\"There's only one way to get to the bottom of this!\" He had to probe directly at the source - Markus Reva!</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/LJPFXDaEK1emAhKUm1Z1v\">Chapter 059 - Defeat</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/xGYpzYgOaoBq0gbaBdIhp\">Chapter 057 - Apprentice Tournament (Part Two)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}