{"pageProps":{"note":{"id":"JkZVhXRuKcuozwYC7ZyOb","title":"Chapter 039 - Tasting the Limelight","desc":"","updated":1643622373955,"created":1643569252909,"custom":{},"fname":"volume-1.chapter-039","type":"note","vault":{"fsPath":"vault"},"contentHash":"3b842f35f5d5b8b8fc1385718a4b86a8","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-039","id":"JkZVhXRuKcuozwYC7ZyOb","vaultName":"vault"},"value":"volume-1.chapter-040","position":{"start":{"line":91,"column":3,"offset":11264},"end":{"line":91,"column":27,"offset":11288},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-040"}},{"from":{"fname":"volume-1.chapter-038","id":"4thOPS6iT1xwVGcO52rVB","vaultName":"vault"},"type":"backlink","position":{"start":{"line":99,"column":3,"offset":10430},"end":{"line":99,"column":27,"offset":10454},"indent":[]},"value":"volume-1.chapter-039"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-039---tasting-the-limelight\">Chapter 039 - Tasting the Limelight<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-039---tasting-the-limelight\"></a></h1>\n<p>One thing that used to irritate Guy a lot after transmigrating into this world was how everyone just kept ignoring him as if he was a nonexistent entity. Even if he was the only other person in the room, they'd treat him like air. The last time he was at the library, some kid sat right in front of him and just let out an ear-shattering fart, then he looked around to make sure no one heard it AND sighed in relief!</p>\n<p>He didn't know why it was like that. Maybe it was the aura surrounding him that encouraged people to overlook his existence. Even in his past life, he'd met people who had a forgettable presence. They would pass through other people's lives without leaving a mark. They didn't have anything that separated them from the crowd - nothing that made them stand out.</p>\n<p>But just like everything, Guy only realised the benefits of his nonexistence after he entered the limelight. After all, being sponsored by a famous individual such as Al Jeeves was a recipe for gaining a lot of attention in a short time frame.</p>\n<p>It was only after Guy got the taste of fame that he started to regret his initial dissatisfaction with his facelessness.</p>\n<p>In many ways, the feeling was similar to how it was like in his old world but amplified by a lot. As a son from a prolific family, he had his fair share of prominence and public recognition. He never shied away from it because he realised that it was a byproduct of his birth. One could say that he was at the peak of existence in his previous life. However, that wasn't the case here.</p>\n<p>In this world, he was only a grunt - an insignificant being without anything to his name. People never care about grunts and mob characters because they never interfere with anything. But when a mob character enters the spotlight suddenly, without any backing to it, then things get murky.</p>\n<p>People are fine when a scion from a rich household gains many favours because it is expected. People are also fine when a pauper gains fame and recognition due to their talents, that is also expected. But what if an average individual suddenly rises to fame? That is just indigestible!</p>\n<p>'What makes him so special? I'm just like him, why can't I get equally lucky?' They'd argue, and those would be valid points. Why was he so lucky?</p>\n<p>To that, Guy couldn't say anything. Luck operated in mysterious ways. He'd been a victim to it in his past life, and he was not going to mess around with it in this life.</p>\n<p>All Guy could do was suck it up and bear with it, which was what he had been doing ever since he entered the cafeteria to have a filling meal.</p>\n<p>As soon as he entered, he'd attracted the attention of everyone in the room. They all stared at him like he was a deer entering a wolves' den. Gulping down his discomfort, Guy found a fairly isolated corner in the room and sat down to eat. Unfortunately, that was never going to happen anytime soon, since the moment his rear touched the chair, the seat opposite him was occupied by a pair of enthusiastic individuals.</p>\n<p>\"Hi, I'm Forna -\" \"And I'm Morian -\" They said excitedly while extending their hands as a sign of greeting.</p>\n<p>Guy was a little surprised, and also felt a little awkward. Cautiously, he offered his hand and reciprocated the greeting, \"Hi, I'm Guy Larks.\"</p>\n<p>Right after they completed the greeting, the two opposite him started talking, \"We know! We were interested in discussing with you about something, - \"</p>\n<p>And that was when things took a 180-degree turn. They started asking him questions regarding enchanting and smithing starting from the practising level. To Guy, it all felt like some form of a viva voce examination. He tried his best to contest the barrage of inquiries, but he was quickly starting to get overwhelmed. They didn't even offer him enough time to enter his RoK and cheat!</p>\n<p>After Guy slipped up in fielding a few questions, the two started to openly display their displeasure and immediately left in a huff, not forgetting to throw out a few subtle jabs his way for \"wasting their time\". Guy very much wanted to stand up and retort that it was them that initiated this conversation, but he held his tongue - he was too hungry to retaliate.</p>\n<p>Maybe it was his willingness to submit to those jeers, or it was his unassuming appearance and aura, but the way everyone looked at him skewed a little. While the general feeling remained consistent, it had a more offensive aftertaste. It was as if he was still a deer in a wolves' den, just that he was now visibly sickly and diseased.</p>\n<p>\"What did Teacher Jeeves see in him anyway? He's just a nobody.\"</p>\n<p>\"Who are we to argue with how those bigshots think? Anyways, I bet I'm better than him!\"</p>\n<p>He could hear such grumblings in the background. Basically, due to the lack of Internet, the public did not have a forum to offload their displeasure through anonymity. And so they resolved to air out their insults through hushed conversations in the general vicinity of the target in question.</p>\n<p>Guy had only read of or seen this in web novels from his old world. He never thought that he'd one day be subjected to it.</p>\n<p>At least with cyberbullying, one could always disconnect themselves, even if it wasn't a substantial solution. But with these offhanded comments floating around him, Guy just didn't know how to shut things out. Some of the insults were quite personal and painful to hear - these guys did not hold anything back!</p>\n<p>Guy could barely swallow the food on his plate with the words buzzing around him. It was starting to make him feel angry. He hadn't felt such emotions in a really long time.</p>\n<p>To calm himself, Guy quickly retreated into the RoK and found some reprieve. Unfortunately, as long as he remained in here his body would stay dormant. This meant that he couldn't eat!</p>\n<p>Just as Guy was about to leave the RoK, his gaze landed on the unfamiliar void mask. Ever since that thing manifested in the RoK, Guy had been avoiding it like the plague. The first time he wore it, he was subjected to a very detached feeling. While there was a passion when he spoke, there was also a general sense of dissociation. It was as if he both simultaneously meant, and was indifferent to things he uttered. He was simply a clear mirror that reflected what the person before him wanted to hear. Guy surmised that it was the awkward combination of unfettered passion from the mask and his sliver of supreme rationality that caused this conflicting situation.</p>\n<p>With hesitation, Guy picked up the mask and put it on. He was immediately subjected to a feeling of being lowered into a cold bath as a shadow crept all over him. Following that, he entered the all too foreign trance-like state. Zealousness and passion manifested in his psyche, but Guy forced his rational mind to suppress them. He was NOT going to preach drivel in public and ruin the last bit of reputation he had earned.</p>\n<p>Guy didn't want to remain in the Church any longer than necessary and wooshed out of it without pause. After returning to his body, Guy once again looked at the people around him. As he saw into their eyes, he got a glimpse into their inner thoughts and feelings. It wasn't as if he was reading their minds, but rather he was more receptive to the general direction their emotions were leaning.</p>\n<p>If he was preaching, this would have made things so much easier! He could so easily rope in- <em>cough</em> enlighten these poor sheep and show them the True World!</p>\n<p>Guy shook those thoughts and started to eat the sumptuous, and now cold, meal in front of him. Guy pushed his rational mind to maintain dominance. Using this method, he had entered a complete state of separation and was unaffected by the things happening around him.</p>\n<p>Then while he chewed, he would direct his attention to the people in his vicinity. As he examined them, those at the receiving end were extremely creeped out. They felt as if his gaze was drilling into them and stripping them bare.</p>\n<p>Organically, a perimeter started to form around him that people started to avoid. This didn't stop them from grumbling disfavourably though. They just increased their volume so that he could still hear them.</p>\n<p>Right as Guy was halfway through with his food, another individual approached him. Unlike the two that came before, this one was more courteous and actually asked whether the seat was occupied. Guy was unconcerned and gestured for the man to take a seat.</p>\n<p>Once the individual introduced himself and began talking, Guy started to evaluate the person. Just based on the way the conversation was going, Guy could sense that the man was here with the intent to make his acquaintance. Even though the man, Karmin, knew about Guy's mediocrity he was willing to entertain this thought, which was interesting.</p>\n<p>\"If you ever need to find me, just show this at the reception of The Burning Forge,\" the man said while placing an identification token before Guy. When Karmin spoke the name of his business, there was a sense of pride bursting within his voice. Guy glanced at the engraving in the token and quickly realised that Karmin was the owner of The Burning Forge.</p>\n<p>'He looks at his company as his own child,' Guy concurred. Through a series of deductions, Guy concluded that Karmin probably raised the business from scraps solely through his efforts.</p>\n<p>Guy took a minute to consider Karmin and his intention. As he looked into his eyes, he could see that the man had ambition and drive. Guy could also glean from the way Karmin carried himself, and his open-mindedness, that he was a man with vast experience. Just the fact that Karmin was willing to gamble in connecting with Guy simply based on Guy's thin connection with Al was reason enough to support this. Compared to those born of money in this world, the flexibility and capacity to lower one's pride signified that Karmin was most likely of a lower origin. </p>\n<p>As Guy looked further, he could see a genuineness in Karmin that was lacking in others he'd met before. The man before him did not seem to grumble over his shortcomings and was always looking for a way to make up for it. The man was a lot like Al in that sense.</p>\n<p>Guy smiled as he carefully lifted the token on the table, \"It's truly my luck to meet an accomplished individual such as yourself, Smith Zola.\"</p>\n<p>As he spoke those words, Guy too lowered his guard and prepared to enter a genuine conversation. And it worked as Karmin, most likely sensing Guy's amiability, started to contribute wholeheartedly.</p>\n<p>Guy fully used Karmin as a resource to whet his newly learned knowledge. Although the man was only a smith, he seemed to have a great deal of insight in enchanting.</p>\n<p>While Guy interacted with Karmin, a thought started to surface in his mind. He seemed to have a lot of items on his to-do list that needed attention simultaneously. While it was alright depending on Al, it wouldn't do if Guy had to go to Al for everything. He needed to diversify his portfolio in some way. Karmin seemed like an honest and good-natured individual. </p>\n<p>And best of all, Karmin was a businessman at heart, which meant that as long as Guy could offer benefits equal to the favours he asked for, Karmin would be willing to assist.</p>\n<p>Thus, Guy gently probed, \"I know that this is presumptuous, seeing as how we just met. But I have a request-\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/37hD0M2dmXCHXmBi29sjz\">Chapter 040 - Profitable Opportunity</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/4thOPS6iT1xwVGcO52rVB\">Chapter 038 - Karmin Zola</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}