{"pageProps":{"note":{"id":"K65Qr7po9sNdnGBmKhUM7","title":"Chapter 075 - Breaking Through to Foundation Establishment","desc":"","updated":1645964244759,"created":1643569487929,"custom":{},"fname":"volume-1.chapter-075","type":"note","vault":{"fsPath":"vault"},"contentHash":"ea60d2ca4d55fffcebc6fb3f2c708ca8","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-075","id":"K65Qr7po9sNdnGBmKhUM7","vaultName":"vault"},"value":"volume-2.chapter-076","position":{"start":{"line":79,"column":3,"offset":11636},"end":{"line":79,"column":27,"offset":11660},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-076"}},{"from":{"fname":"volume-1.chapter-074","id":"smGG2GnLM6dQNGA2MwFaY","vaultName":"vault"},"type":"backlink","position":{"start":{"line":107,"column":3,"offset":10593},"end":{"line":107,"column":27,"offset":10617},"indent":[]},"value":"volume-1.chapter-075"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-075---breaking-through-to-foundation-establishment\">Chapter 075 - Breaking Through to Foundation Establishment<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-075---breaking-through-to-foundation-establishment\"></a></h1>\n<p>Interestingly, Markus and Guy weren't alone in the room. No, this entire time, another pair of eyes, mana sense to be specific, were trained in their direction originating from a quaint little cottage at the base of the steps leading up to the orphanage.</p>\n<p>Not once had Krish let down his observation since the arrival of the aberrant party with a fortune as black as the clear night sky. This entire time, he had his eyes on Guy with unwavering obsession.</p>\n<p>\"What is your deal?!\"</p>\n<p>Krish's characteristically endless patience was wearing thin at a very rapid pace. He was a nail's width away from barging in front of the man, splitting open his head and observing everything that laid within.</p>\n<p>This was until today!</p>\n<p>He was attracted by an explosion from the orphanage. Since it followed a sudden fluctuation of mana, Krish figured that it must have been a spell gone wrong.</p>\n<p>\"The boy's probably messing around again,\" he sighed. He had witnessed the chap called Markus trying to flit around with spells. He was tempted to reprimand the boy on his stupidity. Not just anyone could create a new spell. Yet he was repeatedly proven wrong when 80% of the spells the boy put together ended up working. Krish was convinced that the boy was some hidden genius, wasting away his talents in this village.</p>\n<p>After making sure that the boy was okay, Krish retrained his senses back on Guy, who was rushing towards the orphanage with concern plastered over his face. Krish didn't have a poor opinion of the man's character. Through his observation, he had found that Guy was extremely cordial and personable, especially with kids. He had raised a seemingly illiterate boy into a voracious reader within the span of just a month. This was unprecedented by Krish's standards. Sure, teaching mortal knowledge and magic were two different realms by definition, yet the craft at its base remained the same. A good teacher was to be respected no matter what they specialised in. And Guy for one had entered Krish's books as the paramount definition of one.</p>\n<p>Krish observed as the master and disciple cleaned up the room and sat down to discuss the disciple's current quandary. It was a conversation Krish had observed many times in his life. Defeat was always hard to digest, especially when a genius experienced one. As the saying went, \"the bigger you are, the harder you fall!\" Oftentimes, the damage incurred by a rapidly deflated ego was far-reaching and seldom healed.</p>\n<p>Yet the boy hadn't fretted over it as hard as Krish predicted. Maybe it was due to Guy's tutelage, but Markus was able to accept his loss. His only problem was in trying to find a way to overcome his defeat and grow stronger. That was also understandable. After all, he was unfortunate enough to face a mage with the bloodline of an Abyssal Wyrm. Krish had fought against those dastardly reptiles on a few occasions in his lifetime. It was never an easy fight, even when he was realms above them.</p>\n<p>However, Guy did not dissuade Markus from pursuing his research into the spell. This shocked Krish! Usually, he would wholeheartedly agree with Guy's teachings. But Krish knew for a fact that unless someone had the inherent quality to mould darkness mana, replicating the spell would be impossible.</p>\n<p>It was at that point that Guy started explaining about an archaic object he called a \"black hole\". Krish would have scoffed and berated Guy like every other mage, if not for the fact that he had read manuscripts explaining a similar phenomenon.</p>\n<p>After the Age of Isolation, many mages had ventured out of Gaea in search of other realms or planetary bodies with life. A few had found traces, yet none was substantiative. Within the accounts of one such mage, Krish had read of his experience witnessing a faint dark spot in the already dark canvas of outer space. It had an ethereal halo surrounding it, but that was all his senses could gleam. According to the mage's notes, just observing it had sent his instincts blaring in fear. One must note that the mage whose journals Krish read was also in the Tesseract Transformation realm. To scare a powerhouse at the pinnacle, it must have truly been a powerful existence - this \"black hole\".</p>\n<p>\"But how does he know of this?\" Krish muttered. In recent years, no one had ventured out of Gaea. Most accounts that emerged in the past had disappeared from the face of this planet. The only explanation to Guy's vast knowledge was the existence of a power backing him. Maybe a teacher with multiple millennia in his pockets, or even an inheritance from a deceased mage. Both were likely possibilities and warranted further digging, but there was time for that.</p>\n<p>The exchange within the room reached a stalemate as Markus was unable to grasp the insight his teacher conveyed to him. Krish sighed in disappointment, yet he wasn't discouraged. Maybe in a few years, the boy would grasp the essence of these insights and assimilate them. Cultivation wasn't like making food. Adding a new ingredient may take effect immediately when creating a sumptuous meal, but insights took time to take root and grow. Only geniuses amongst geniuses could grasp insights the moment they left a teacher's lips.</p>\n<p>But what happened next, once again, threw Krish for a loop. The two in the room entered a kind of fugue state. Their eyes turned blank as the aura permeating from Guy changed drastically. For a moment, Krish saw a burgeoning light within Guy's seemingly void-like fortune. The man also \"felt\" different. There was an overwhelming sense of zealousness permeating from his pores that assaulted Krish's rationality, tempting it to succumb.</p>\n<p>As he scrutinised the scene further, he realised that the two were cultivating. Their mana flow was indicative of that. Krish changed the way he trained his senses to glean more information about their cultivation. At his level, it was possible to grasp information beyond what regular senses could see. Sometimes he could even see abstract concepts. Cultivation happened to be one of them.</p>\n<p>He saw that Markus was at a roadblock in his cultivation, a bottleneck if you will. This was determined based on a myriad of factors bundled into one: mana flow, body conditioning, environmental fluctuations, and so on. It would take a few years for this to pass naturally as the boy organically advanced through assimilating insights. Alternatively, he could ingest some potent potions and smash through the barriers, but that was generally frowned upon at lower levels of cultivation. Since the higher your realm was, the harder it was to break through. So it was unnecessary and detrimental to force breakthroughs at a lower realm when it was supposed to be easier.</p>\n<p>Right in front of Krish's eyes, or senses, the bottleneck was being opened smoothly. The boy's rigid mana circulation was smoothening and previous restrictions were being burst through with a torrent of mana. It was an unbelievable occurrence! To do that must have meant that the boy had gained an epiphany of Herculean proportions and that too within minutes of experiencing the bottleneck!</p>\n<p>Upon further inspection, Krish noticed that it wasn't just the bottleneck that was being eased away, but the boy's cultivation itself was undergoing a drastic change that usually led to deviations within most mages. Certain active mana pathways were being rerouted or truncated, as though parts of the boy's cultivation were being snipped off by some sort of non-existent pair of scissors. In some locations, new mana channels were being opened up and widened, as if new sections were being glued in. Some channels were getting twisted or elongated, while others shortened or straightened. None of this made any sense! It was beyond Krish's vast realm of comprehension.</p>\n<p>After calming himself, Krish was able to hypothesise two possible reasons for this. Either the boy's cultivation method was special that allowed for such drastic changes in his core paradigms without incurring massive deviations and internal damage, or Guy was such a potent teacher that he was able to change his student's cultivation at its core without incurring any consequencess. Maybe they were both true!</p>\n<p>\"Another string to follow!\" Krish exclaimed with enthusiasm.</p>\n<p>As the metaphorical dust began settling, Krish witnessed another rare occurrence: perfected resonance! Surprisingly, it wasn't just Guy, but his student too! They were both simultaneously undergoing perfected resonance! And through the entire process, they were preoccupied in a fugue state, oblivious to the changes they were undergoing.</p>\n<p>After a brief minute, Markus started to settle down. His cultivation had formed a solid and unshakeable core and appeared ready to break into the Foundation Establishment realm. Maybe after cultivating a little more, the boy could breakthrough.</p>\n<p>However, Guy didn't stop. A whirlpool of mana began exhibiting above the orphanage and started to siphon into Guy. The temperature within the room rose drastically as steam began emanating from the man's skin. As gaseous, scalding, mana escaped from his pores, his clothes started to disintegrate, falling into tatters. The pure mana coursing within him started to change state from gaseous to liquid. Like with most physical exothermic state changes, this released a lot of heat. Usually, mages would isolate themselves, submerge in a cool medical bath and proceed completely in the nude to alleviate any possible damages they may incur.</p>\n<p>With an ethereal boom, the man's foundations solidified and the impurities within his blood surged out as steam. Guy had successfully stepped foot into the true path of magehood - he was now within the Base Stage of the Foundation Establishment realm!</p>\n<hr>\n<p>Guy had put together a \"video\" for Markus by splicing together key bits and pieces from various documentaries such as Neil DeGrasse Tyson's \"Cosmos - A Space Odyssey\" and from fiction works such as \"Interstellar\". Although he hadn't personally witnessed a black hole in its horrific majesty, he believed that these visual mediums were suitable enough to convince Markus. Of what remained, Guy let his passionate self take reign and fill in the gaps.</p>\n<p>Through some religious drivel explaining the power one could wield by comprehending the \"True World\" Guy was able to inculcate the concepts of an unbelievable phenomenon into Markus. As the boy absorbed the information, Guy saw his ethereal form turning more solid. At a point, a string connecting his consciousness and Markus' form in the Church materialised and started to grow thicker.</p>\n<p>Guy wasn't sure what this was, and his current state refused to question it even a little. He wanted to let his supreme rationality take over, but the other guy just wouldn't let off! There was still a few sermons to go through apparently...</p>\n<p>Guy wasn't having any of it! He quickly assaulted his other self and reigned it in, immediately taking off the mask. After he returned to the RoK, he was greeted by an unbearable heat assaulting him.</p>\n<p>\"Oh my goodness, it's hot!\" He quickly retreated from the RoK and reentered his body.</p>\n<p>Before he could take account of what had happened, the door to Markus' room swung open.</p>\n<p>\"Markus, it's time for lunch- What the hell is going on in here?!\" Grace exclaimed as she witnessed the completely naked Guy sitting in front of Markus in a lotus position.</p>\n<p>\"YOU PERVERT! I knew you were trouble when you walked in! Leave Markus alone!\"</p>\n<p>She cursed with a shrill voice and fetched a convenient stick supported against the room's door frame.</p>\n<p>\"Get over here!\" She yelled as she rushed over at Guy with visible rage in her eyes.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/NCGs2UZ3JxDjFycMAbuNV\">Chapter 076 - Nightmares</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/smGG2GnLM6dQNGA2MwFaY\">Chapter 074 - I See Dead Stars</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}