{"pageProps":{"note":{"id":"mo9ojkj4mns8v9rleubsc1m","title":"Chapter 292 - Nightmares Turned Reality","desc":"","updated":1678703995225,"created":1676787954302,"custom":{},"fname":"volume-4.chapter-292","type":"note","vault":{"fsPath":"vault"},"contentHash":"6972386e86272a607f4bb011a4fc6242","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-292","id":"mo9ojkj4mns8v9rleubsc1m","vaultName":"vault"},"value":"tags.Another","alias":"#Another","position":{"start":{"line":48,"column":1,"offset":4221},"end":{"line":48,"column":9,"offset":4229},"indent":[]},"xvault":false,"to":{"fname":"tags.Another"}},{"type":"wiki","from":{"fname":"volume-4.chapter-292","id":"mo9ojkj4mns8v9rleubsc1m","vaultName":"vault"},"value":"tags.Your","alias":"#Your","position":{"start":{"line":52,"column":1,"offset":4268},"end":{"line":52,"column":6,"offset":4273},"indent":[]},"xvault":false,"to":{"fname":"tags.Your"}},{"type":"wiki","from":{"fname":"volume-4.chapter-292","id":"mo9ojkj4mns8v9rleubsc1m","vaultName":"vault"},"value":"tags.If","alias":"#If","position":{"start":{"line":56,"column":1,"offset":4332},"end":{"line":56,"column":4,"offset":4335},"indent":[]},"xvault":false,"to":{"fname":"tags.If"}},{"type":"wiki","from":{"fname":"volume-4.chapter-292","id":"mo9ojkj4mns8v9rleubsc1m","vaultName":"vault"},"value":"tags.A","alias":"#A","position":{"start":{"line":60,"column":1,"offset":4490},"end":{"line":60,"column":3,"offset":4492},"indent":[]},"xvault":false,"to":{"fname":"tags.A"}},{"type":"wiki","from":{"fname":"volume-4.chapter-292","id":"mo9ojkj4mns8v9rleubsc1m","vaultName":"vault"},"value":"volume-4.chapter-293","position":{"start":{"line":105,"column":3,"offset":9479},"end":{"line":105,"column":27,"offset":9503},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-293"}},{"from":{"fname":"volume-4.chapter-291","id":"hi341oyun57mzz3hdwwxk63","vaultName":"vault"},"type":"backlink","position":{"start":{"line":113,"column":3,"offset":11173},"end":{"line":113,"column":27,"offset":11197},"indent":[]},"value":"volume-4.chapter-292"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-292---nightmares-turned-reality\">Chapter 292 - Nightmares Turned Reality<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-292---nightmares-turned-reality\"></a></h1>\n<p>The thick black mist gushed out and siphoned towards Josie's agape mouth. She gasped thirstily for fresh air, only to have it doused by the ghastly taste of all things horrid to ever exist in the world. Her assailant looked on with an expression bordering rage and excitement with his mouth ajar to an almost inhuman degree.</p>\n<p>Josie's eyes drifted beyond the man's head and landed on her Young Miss. She had fallen over as she tried to protect the two- No, one girl huddled behind her. Dora had rightfully followed Josie's instructions and fled the scene.</p>\n<p>Her Young Miss' usually stoic face was showing cracks. Josie would be relieved to witness this development, if not for the fact that instead of joy and elation, immense distress and unassailable fear were the ones surfacing.</p>\n<p>As the man tightened the grip around her neck, Josie could feel the sickness demolishing her from within. There was little she could do to save herself now. Her death was certain.</p>\n<p>But she couldn't leave without making certain that her Young Mistress was safe! This was the last promise she made to her Mistress before her passing. This was her last and true purpose in life.</p>\n<p>Josie's gaze hardened with resolve, quite possibly for the last time. She looked deep into the man's strangely listless eyes. Her lips parted to reveal the remainder of the Dimiriteum darts.</p>\n<p>The man's face faltered as a realisation dawned on him. His gaseous grip loosened and all the muscles of his body (or what remained of it) tightened as he prepared to escape.</p>\n<p>A palm-sized spell circle formed around Josie's lips. A finger-width whirl of wind ejected from her mouth and carried the darts along a guided trajectory with the haste of gale-force storms, directly into the man's ajar mouth.</p>\n<p>Through pure reflex, the man's mouth clenched shut, engulfing the darts embedded deep at the back of his throat.</p>\n<p>Josie collapsed onto the ground as the man's gaseous arms dissipated - his attention was now wholly within his body as he had no idea of how to eject the literal ticking time bombs in his mouth. Freedom at hand, Josie did not hesitate to rush forward and push the girls further away with a quick cast of |Gust|.</p>\n<hr>\n<p>Jean's world tumbled as she saw herself growing distant from Josie. Before she could regain her bearings, she felt a reverberating symphony of explosions that disoriented her further.</p>\n<p>A sense of foreboding burgeoned inside her as the implications of the convoluted sequence of events started to connect inside her jumbled mind. Jean's lips moved, \"No, no, no, no, no...\" but she could not hear those words as her ears rang monotonously. Her sight was blurry and stung as she tried to blink away the mud that entered it during her tumble backwards.</p>\n<p>The moment her vision clarified, the first thing Jean saw was the dreaded appearance of a thin, filmy wall. Behind the wall was the steadily emaciating and blistering figure of Josie, her face straining with a relieved smile. Jean stumbled onto her feet and rushed towards the ward and banged her fist against it.</p>\n<p>\"Josie, NO!\"</p>\n<p>Josie's lips moved, but Jean could neither hear nor could she discern what was being spoken. Jean's eyes flashed beyond Josie and noticed the man-creature's half-decimated body. Nothing existed above his abdomen barring a violently rotating grey-black ball of energy - his core. Jean knew enough to understand what was about to happen, and her eyes returned towards her attendant.</p>\n<p>\"No, no- NO!\" Jean's hearing returned only to be drowned by her own blaring voice pleading in agony.</p>\n<p>\"Young... Miss... Run... Away...\"</p>\n<p>Jean ignored Josie's words and repeatedly hammered away at the ward. She had to- NEEDED to get through.</p>\n<p>And then it happened. The spinning core remnant of the man-creature pulsed and released a black wave, no doubt carrying whatever virulent disease he fostered inside him. The wave engulfed Josie and moved towards Jean wantonly, only to face opposition and dissipate after colliding against the ward put up by Josie.</p>\n<p>The ward flickered.</p>\n<p>Josie was fading.</p>\n<p>Jean's mind was thrust back in time. Josie's figure overlapped with her mother's. The voices in her head started to shout over each other with frenzied fervour. She froze.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Another (Private)</a> one killed.#</p>\n<p><em>You didn't kill her.</em></p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Your (Private)</a> mere existence invites death.#</p>\n<p><em>It was Josie's choice.</em></p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#If (Private)</a> I were you, I would just end it all.#</p>\n<p><em>Killing yourself won't change anything. You should work hard, become the best healer you can be and save lives.</em></p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#A (Private)</a> healer that kills. Oh what an interestingly ironic destiny!#</p>\n<p>One debate boiled over to the next until multiple arguments started to run parallel and overlay one on top of the other. Jean's mind started to churn violently. Emotions that had been barricaded deep within Jean's mental vaults by alchemical castration started to breach through. Like a battering ram colliding against a wooden door, she was flooded with years of repressed emotions all at once. A pain most profound crippled Jean's mental faculties as she was forced to live through everything all at once within the span of a second.</p>\n<p>With her mind overwhelmed, her body soon followed. Tears, laughs, screams and howls all started to escape from her at a maddening frequency. She had no control, nor was she aware of what was happening any more. Not even the fearful tugs by Kili behind her could save her lost mind.</p>\n<p>For all intents and purposes, Jean was broken and lost within the confines of her fragmented mind.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>That was until an ethereal string of flickering light extended out from her navel. A pulse of light hurried towards Jean through this string, causing the frantic flickers to stabilise. The string was invisible to everyone around her, herself included. And its effect was deep, unknown even to her.</p>\n<p>Suddenly, Jean's frenzied state turned tranquil like a still pond.</p>\n<p>Her mind restarted, and everything within turned quiet.</p>\n<p>A mind that was lost within the endless ocean of limbo resurfaced and gasped for breath. The amount inhaled was only enough to perform basic mathematics. Therefore, the situation presented before her was quickly summarised by her starved rationality.</p>\n<p>Jean had to save Josie. To do that, she needed to breach through the ward. If Josie died, the ward would dissipate. If the ward fell, then the little girls would die - this meant time was of the essence. For the time being, the ward was flickering - a forceful push between wavers would send her through without breaking it. Once within, Jean would die under the influence of the black wave of sickness on the other side. To stop the wave of black, the core would have to be removed.</p>\n<p>The equation was set. The solution was evident.</p>\n<p>Jean reached into her jacket and retrieved the phials of Kili's blood. Then, she ingested the blood directly and started to circulate it in parallel with her mana. She forcefully ruptured her oesophagus with her mana and directed the blood towards her heart. The rationale behind this action was nonsensical, but in Jean's mind, it somehow made sense in the simple and crude equation. As this was taking place, Jean quickly shoved the girl to the side and ran towards the flickering shield. Her body collided against the solid wall of mana, and her shoulder groaned but the pain went completely unregistered. She was through.</p>\n<p>The pungent smell of sickness and death (at least that was what Jean imagined those two concepts would smell like) assaulted her superhuman senses. But that was still insufficient to stop her. She could feel the sickness taking hold of her, but it was being combated by the antibodies coursing through her by virtue of her haphazard and injurious blood transfusion.</p>\n<p>Before Josie's horror-filled gaze, Jean beelined towards the pulsing core and grasped it with both her hands.</p>\n<p>A mage's core is the physical embodiment of their cultivation. It is a supremely condensed ball of pure will (at least until they break through into the Tesseract Transformation realm when it also embodies their soul). Upon touching such a condensed ball of \"experience\" with the intention of absorbing it, one can expect one of two outcomes: cultivation deviation (which is the most common outcome), or in the rarest of cases a profound leap in cultivation.</p>\n<p>A deviation occurs if the \"experience\" runs counter to or conflicts with the absorber's cultivation. A mage specialising in water magic will suffer a deviation in nine out of ten cases if they try to absorb a fire mage's core. Although there is always that one case when it doesn't and a mage with dual specialities is born who takes the world by storm.</p>\n<p>A profound leap occurs when the \"experience\" meshes with the absorber's cultivation thus bolstering it and filling in the blanks. This is extremely rare, as even two fire mages can have conflicting bases for their cultivation. After all, since cultivation isn't standardised, there is a large degree of subjectivity involved.</p>\n<p>Jean held no such intentions when she grasped the core. She didn't know if the process would cause her to deviate and die, or if it would help her breakthrough, and she didn't care. She only wanted the core to disappear. Her metaphorically oxygen-starved mental mathematics only went that far.</p>\n<p>Nonetheless, she succeeded and the core disappeared. Unfortunately, it was completely absorbed by her. Jean collapsed onto the floor, and her body convulsed violently as a war of wills started to run rampant inside her body.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/go97ibet1jf7w7h7awv2a0c\">Chapter 293 - Hopeful but Helpless</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/hi341oyun57mzz3hdwwxk63\">Chapter 291 - Second Wind</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}