{"pageProps":{"note":{"id":"MrakEum8IRD0jFvTqFaVX","title":"Chapter 018 - First Disciple","desc":"","updated":1643572085948,"created":1643568814021,"custom":{},"fname":"volume-1.chapter-018","type":"note","vault":{"fsPath":"vault"},"contentHash":"e8ec6b7368514003fb7b96079742e00f","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-018","id":"MrakEum8IRD0jFvTqFaVX","vaultName":"vault"},"value":"volume-1.chapter-019","position":{"start":{"line":107,"column":3,"offset":11012},"end":{"line":107,"column":27,"offset":11036},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-019"}},{"from":{"fname":"volume-1.chapter-017","id":"RMpU3WqbyumcTycgwpX0f","vaultName":"vault"},"type":"backlink","position":{"start":{"line":125,"column":3,"offset":10500},"end":{"line":125,"column":27,"offset":10524},"indent":[]},"value":"volume-1.chapter-018"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-018---first-disciple\">Chapter 018 - First Disciple<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-018---first-disciple\"></a></h1>\n<p>Disciples and student may mean the same thing by their definition. But in fact, there was a massive gulf that separated the two statuses.</p>\n<p>A student could be anyone enrolled in an academy or teaching establishment. It could also be someone that frequented lectures or talks given by notable individuals. In essence, students are affiliated with any organisation or individual. Personal students are just regular students but with a temporary supervisor.</p>\n<p>Disciples, on the other hand, are special. Disciples are directly connected to their Masters. Becoming a disciple of a teacher was akin to gaining a new parent. The master would hold many responsibilities apart from simply relaying knowledge to their disciples. They would also be required to raise them and guide them in their path. As a result, disciples tended to follow their masters in their journeys.</p>\n<p>A master-disciple relationship is evoked through an informal process. There aren’t registries that indicated whether someone was a disciple of a particular teacher or not. This affiliation is ascertained by the coat of arms or symbol adorned by the disciple, matching their master’s. Qualified teachers, especially those with a star certification, would develop their own unique seal. When the teachers took on disciples in the future, they would allow them to decorate their outfit with this seal. This would be an indication that the disciple is affiliated with said teacher.</p>\n<p>Although the initiation was informal, the master-disciple bond is taken very seriously. One doesn’t invoke this relationship on a whim. Breaking a master-disciple bond was a shameful deed, biased in favour of the master. Even if the disciple’s rank and capacity far exceeded their master’s, the master-disciple connection would still remain. The disciple was naturally required to be respectful to their master. This was why Guy advised caution at Markus’ seemingly impetuous decision to establish a master-disciple relationship.</p>\n<p>Hearing Markus’ resolute declaration, and his bent figure, Guy was taken aback. Based on this body’s memory, taking on a disciple or recognising a master was considered a huge deal.</p>\n<p>While he was fine accepting Markus, Guy admitted that he was probably viewing this situation from a modern man’s lens.</p>\n<p>In his old world. The idea of becoming a disciple was an archaic concept. While it still persisted in some old customs, with the ubiquity of the internet most knowledge was no longer hoarded or withheld like in the olden days. If someone wanted to learn a new skill, finding a skilled teacher was more often than not only a few clicks away. </p>\n<p>Guy realised that such ubiquity was not a thing in this world. Even within the Academy’s library, which was supposed to be a public repository, there were closed-off sections inaccessible to the regular folk.</p>\n<p>And so Guy decided to caution Markus, “While I would love to accept you as my disciple, I do have to warn you. I am just a teaching apprentice. I want you to think carefully before you make this decision.”</p>\n<p>Markus smiled self-deprecatingly, “You don’t understand, Sir. That day, during fresher’s week, I was this close to giving up,” he said while pinching his fingers.</p>\n<p>Markus sighed and continued, “As you already know, I’m an orphan. I am from an orphanage in a sparse village five days away from Radiant City. The village is right at the foot of the Serrated-Peaks Mountain Range, bordering the Green-Sky Forest. To get there, you need to take a long detour from the trade routes. You can already guess, the security situation. We live on the edge every day.”</p>\n<p>“I’m the oldest back at the orphanage. My siblings and I scraped and scrounged to save just enough to send me here. I have just enough to pay the fees for a year and a half, only just,” he commented solemnly.</p>\n<p>“I… I…” as he tried to continue, tears started to flow down his cheeks. “I was ready to give up everything! I was… I was going to …”</p>\n<p>Markus quickly brought his sleeves to his face and dried his tears. He wore a serious expression and continued speaking with a stable voice.</p>\n<p>“You have no idea how much this means to me,” Markus declared as he picked up the neatly folded spell diagram.</p>\n<p>“You’ve given me hope. It would be my absolute honour to become your disciple. So please,” Markus stood up once again and bowed at a ninety-degree angle, “I want to become your disciple, Master!”</p>\n<p>Guy smiled warmly and stood up in front of Markus, “Well, as long as you are confident and have thought it through.”</p>\n<p>He placed his palm on Markus’ shoulders and declared, “I, Guy Larks, accept you, Markus Reva, as my first disciple!”</p>\n<p>Markus straightened his back and beamed in excitement. He then lowered his head and brought his hands together in a praying gesture. “I, Markus Reva, greet my Master, Guy Larks!”</p>\n<p>Guy returned the gesture and completed the ceremony.</p>\n<hr>\n<p>Markus called out, “Master,” and then smiled as he mentally processed his new master-disciple relationship. Although his master wasn’t a certified teacher or even a complete teacher for that matter, he was extremely elated. He held immense respect for his master. His master never gave up on him and accomplished something that most people had written off as impossible. He had found a way for Markus, who was magically inept, to advance in his cultivation.</p>\n<p>“Sit, sit! I hope you had breakfast? We have a lot to go through today,” Guy said while gesturing for Markus to take a seat next to him.</p>\n<p>The two were back at the library at Guy’s usual spot. It was sufficiently secluded that other’s wouldn’t be disturbed by their hushed conversation. Although, most advanced mages could still hear them with their improved senses.</p>\n<p>“Yes, master!” Markus answered sheepishly and sat down obediently in a chair next to Guy.</p>\n<p>“Alright, so-” but before Guy could continue with his lesson, a familiar call interrupted him.</p>\n<p>“Wait for me!”</p>\n<p>Guy and Markus both turned in the direction of the voice and saw an excited Al walking briskly towards them. Al shamelessly pulled a seat opposite Guy and looked at them with an expectant gaze.</p>\n<p>Seeing as the two were simply staring at him, Al waved his hand and said, “Go on! I’m just observing.”</p>\n<p>Guy nodded and diverted his attention back to his disciple, “Alright, so I guess you have a lot of questions?”</p>\n<p>“Yes, master. I -” but again they were interrupted by Al,</p>\n<p>“Master? Hold up! Did you accept this kid as your disciple?” Al exclaimed in an uncharacteristically high-pitched voice.</p>\n<p>Guy looked at Al in defeat causing the guilty party to gesture by pressing an extended index finger against his lips. Guy exhaled and indicated to Markus to continue.</p>\n<p>“So during breakfast, I was going through the spell construct once again. As you already know, I’ve studied quite a few spells from this library, but I don’t think I’ve seen anything like this one,” said Markus in a confused tone.</p>\n<p>Guy nodded in affirmation and replied, “Of course it isn’t here. I developed it.”</p>\n<p>The revelation received similar responses from Al and Markus. For Al, it was a little bit more exaggerated since he actually knew, as an intellectual, exactly how difficult it was to develop new spells.</p>\n<p>“Well, I didn’t make it from scratch. I put pieces together and developed them. If you look at it carefully, the spell is basically a modular construct made up of both sequential and parallel components,” Guy explained while pointing at the pertinent sections on the spell construct.</p>\n<p>“What are these symbols?” Al asked. Markus nodded as this was also something he didn’t fully understand.</p>\n<p>“Remember when I told you about the books I purchased from the travelling merchant? These symbols were scattered in it, with explanations supporting what they meant,” Guy articulated while infrequently glancing at Al. When he saw that Al was nodding in contemplation, he relaxed. Guy wanted to make sure that there weren’t any holes in his explanation. He knew Al was a smart cookie, and so he couldn’t half-ass it.</p>\n<p>Markus scratched his head, “Which book are you talking about, master?”</p>\n<p>Guy smiled wryly and began his anecdote, “When I was little, I used to love to read a lot of books. As you know, books can get expensive, and since the orphanage I lived in was quite poor, we had to make do with very little. Luckily, the matron was acquainted with a travelling merchant that passed through our village regularly. Every time he stopped by, he would unload stacks of books that were about to fall apart. He would donate those books to the orphanage. I used to always look forward to those days when he would stop by.”</p>\n<p>As he spoke, he modulated his tone to his signature teacher’s voice. “One day, he brought a stack of books that were in near-mint condition. When I asked him, he said that he tried selling them, but no one would buy them. The customers always complained that the contents made no sense, and were really boring.<br>\nFor me, that didn’t matter. Books were books, I didn’t have the luxury to be choosy. And so I started reading those books. At first, things didn’t make sense. But after I finished them once, and read through them again. I got a clearer picture of what they were talking about.”</p>\n<p>Guy paused and gauged the mood of his audience. As a teacher, orating was a valuable skill. Especially back when he was going from village to village in his old world. He had picked up methods to quickly attract the attention of little kids and keep them hooked. Unsurprisingly, he had completely bewitched Markus. When he turned his head, he saw Al looking at him with a very weird gaze. It was almost as if he wanted to devour Guy whole. It gave him goosebumps. </p>\n<p>He quickly shook it off and continued speaking, “The books were actually records written by a long-forgotten race from an old realm.”</p>\n<p>That revelation registered gasps from both his audience members. Although, Al was wearing a sceptical look.</p>\n<p>According to Guy’s research, realms were a highly debated topic in this world. The word itself was used ambiguously. Some said that a realm was an alternate dimension. Others said that realms connected to different worlds. As a world-traveller, Guy was somewhat of an expert in this field. Well no one else apart from him, and maybe Jo, had traversed from another world so he was the expert by definition. </p>\n<p>But Guy decided to gamble on this ambiguity and make an assertion, “The race was called Homo Sapiens, and the realm they lived in was extremely scarce in mana.”</p>\n<p>Guy saw that Al had loosened his frown. It appeared as if he bought this lie. After mentally pumping his fists, Guy continued, “Since the world lacked mana, the Homo Sapiens had to make do and develop ways to survive in their harsh environment.<br>\nAnd it is their unique perspective borne from the unusual circumstance that led them to develop in a completely novel direction.”</p>\n<p>Guy took a deep breath, grit his teeth and stated, “They theorised that the world was inherently devoid of mana. They called this model, the ‘True World’.”</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/PwQJRflr06RNcr6arnfDC\">Chapter 019 - Science in Magic</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/RMpU3WqbyumcTycgwpX0f\">Chapter 017 - Scrutiny</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}