{"pageProps":{"note":{"id":"n0o3dgnca6op2mcgnxyb1ja","title":"Chapter 201 - Securing an Investment and Gaining an Employee","desc":"","updated":1660070329131,"created":1656225192711,"custom":{},"fname":"volume-3.chapter-201","type":"note","vault":{"fsPath":"vault"},"contentHash":"2a1fd0dba24b106883ff865e0adaea9c","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-201","id":"n0o3dgnca6op2mcgnxyb1ja","vaultName":"vault"},"value":"volume-3.chapter-202","position":{"start":{"line":129,"column":3,"offset":11836},"end":{"line":129,"column":27,"offset":11860},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-202"}},{"from":{"fname":"volume-3.chapter-200","id":"qkdbfnbrubl1fcq3nx269hm","vaultName":"vault"},"type":"backlink","position":{"start":{"line":67,"column":3,"offset":9933},"end":{"line":67,"column":27,"offset":9957},"indent":[]},"value":"volume-3.chapter-201"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-201---securing-an-investment-and-gaining-an-employee\">Chapter 201 - Securing an Investment and Gaining an Employee<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-201---securing-an-investment-and-gaining-an-employee\"></a></h1>\n<p>\"This is fantastic,\" Garlin praised while pointing at the varied instances of graphs peppered across the report. \"It so accurately encapsulates everything I want to know, without me having to sit down and deconstruct pages upon pages of indecipherable text and numbers.\"</p>\n<p>\"What are these images?\" He added while glancing between a pie, bar and line graph conveying three different sets of data.</p>\n<p>\"They're called graphs. As you so rightly said, they are pictorial representations of data,\" Guy affirmed.</p>\n<p>\"Wonderful! Did you invent these graphs?\" Garlin responded, but then he caught himself and bit his tongue. \"Apologies, I understand if these are trade secrets of some kind.\"</p>\n<p>Guy waved his hand casually and said, \"To answer your first question, I wasn't the one who invented them. I do teach about them, though.\"</p>\n<p>Garlin noticed Markus nodding along and asked the boy, \"You know how to make these things?\"</p>\n<p>\"Master has taught us how to collect, process and present data in human-readable format, yes,\" Markus answered. \"Graphs and charts are included in this.\"</p>\n<p>Garlin pushed out his lower lips and nodded with an impressed expression. His eyes darted to his son who was also perusing through the report, reading the pages he had already finished. A thought sprouted in his mind at that instant, but Garlin didn't actively pursue it for the time being. After a short half-minute, he quickly reverted to the situation at hand.</p>\n<p>\"This Verum Trading Company, you intend to use it to finance the True World Sect which you will be leading,\" Garlin confirmed.</p>\n<p>Upon receiving a nod from Guy he followed up, \"To that end, I have a few questions regarding your Sect since the two will be inevitably tied together.\"</p>\n<p>\"Go ahead,\" Guy agreed.</p>\n<p>\"I am sufficiently informed of the requirements to starting and maintaining a Sect,\" Garlin started. \"How can you guarantee that the Solar Sect Alliance will validate the creation of your Sect?\"</p>\n<p>\"We have the support of a Tesseract Transformation realm mage,\" Guy declared openly.</p>\n<p>Garlin's eyes nearly popped out of his sockets, and his son who was gulping down a glass of water took a legitimate spit-take.</p>\n<p>\"A T-T...\" Garlin stuttered. \"Tesseract Transformation? H-HOW? WHO?\"</p>\n<p>\"I believe it would be in our best interest to not agitate them. Though I can provide guarantees of their support. If need be I can add it to the contract.\"</p>\n<p>\"Contract?\"</p>\n<p>\"Right!\" Guy snapped his finger and retrieved the second monstrous paper pile from his satchel and dropped it before Garlin. \"These documents are for our potential partnership in this venture. If you are interested in investing and holding a stake in this business, there are additional clauses,\" Guy added while sliding forward another set of documents.</p>\n<p>Compared to Karmin's response, Garlin's eyes sparkled with excitement. He rubbed his hands in anticipation and licked his right thumb in preparation for some aggressive page flipping. Guy swore that he saw the man salivating as he mouthed the clauses.</p>\n<p>\"Oh ho! Smart, smart, I would have missed that,\" the man commented with a sly chuckle. Every now and then, Garlin released a similar comment in contemplation or in commendation followed by a sound ranging from a thoughtful hum to a full-blown laugh.</p>\n<p>\"Beautiful!\" The man concluded as he finished reading the final clause. \"I could not find a single lapse or exploitable clause. Every aspect I could think of was addressed and then some. Truly a magnificent contract, this one is. Did you write this, or was a third-party consulted?\"</p>\n<p>\"I wrote it, thank you for your kind words,\" Guy replied with a wry grin. He wasn't completely used to receiving compliments, especially if what he was getting it for wasn't something he was expressly good at. Guy had seen better contracts penned down in his past life by people who were far more educated in the field than he was. This barely scratched the surface - Guy was sure that if a more ruthless capitalist with a top-notch legal team were to approach this self-admittedly haphazard contract, they could drill holes into it like a worm devouring a tasty fruit.</p>\n<p>\"I must say that I am truly impressed by... well everything, really!\" Garlin exclaimed. \"The proposed venture is robust, and based on your research, which I must say has floored me in its meticulousness, it will be profitable. Although I have yet to see some of the products your company will develop and sell, I can infer from your confidence that you have some plans in motion?\"</p>\n<p>\"That I do,\" Guy affirmed. \"I am currently in talks with Karmin Zola of The Burning Forge. Not only is he an investor, but The Burning Forge will also act as the manufacturer of our products.\"</p>\n<p>\"You got Karmin in on this?\" Garlin blurted out in surprise. The man and his company's name were on most people's lips these days. The advent of Steel had changed the market landscape, shaking it to its core. The alloy was as durable as Dwarven metal with enchanting capacity close to it as well. What really shattered the market was the affordability of the metal - it was nearly as cheap as iron for goodness’s sake! Steel weapons and armour had become commonplace in most establishments, it was just that good.</p>\n<p>\"Yes, currently, we are at the prototyping stage of a device,\" Guy added. \"The product is owned completely by Verum Trading Company. The Burning Forge only has the rights to manufacture. They don't have rights to sell it either, so a purchase of said products needs to be validated through Verum Trading Company or True World Sect,\" he emphasised immediately after. That answered a question that was about to roll off of Garlin's tongue, which was 'Why should I invest in your company if I can get it from the manufacturer?'</p>\n<p>\"That's a smart move,\" Garlin commended.</p>\n<p>\"As for your earlier question about the products in our catalogue, let me introduce you to the Gutenberg Press,\" Guy started. He then went on to give an overview of how the device worked minus excessive technical details since he recognised that his audience wasn't as experienced in this field as Karmin. That, and because he wasn't fully sure if Garlin was on-board with the business. Unlike Karmin, Guy could not get a proper read on Garlin likely due to the man's years of experience in this ruthless environment.</p>\n<p>\"I believe we can even start a publishing company after creating this product. All the while, a company under Verum's umbrella could take on publishing contracts for large-scale manufacture and sales.\" this time it was Furion who spoke up. The boy had been silent this entire time, making himself as scarce as possible. However, his eyes gained a motivated glimmer as he blurted out his ideas. \"Apart from that, instead of selling these machines, they could be leased to others at first.\"</p>\n<p>\"What is your rationale behind the decision to lease instead of sell?\" Garlin directed his son calmly. The boy jerked in surprise.</p>\n<p>\"Umm, I mean...\" Furion stuttered.</p>\n<p>\"Speak clearly,\" Garlin emphasised.</p>\n<p>\"I-If, I mean if they sell the products from the beginning, there is little guarantee that the purchaser won't open up the product and steal its designs. Leasing can help avert those problems. First, a breakdown mechanism could be installed inside the machine that causes the product to malfunction if someone opens it. Then, when the product fails to work after being put together, Verum Trading Company can impose a penalty on the buyer. Maybe a clause can be added to the leasing contract?\" Furion listed.</p>\n<p>Guy shuddered upon seeing the little capitalist's mind at work. Back on Earth, many corporations implemented such devious methods inside their own devices to avoid theft in cases where patent litigation could not be extended. Nonetheless, Guy was completely for Furion's suggestion. In this world, there were no such things as patents and copyrights. The only cases where intellectual property rights were respected occurred when guilds became involved. Such as the deal Karmin had with the Smithing and Enchanting Guild.</p>\n<p>\"You seem taken with this product,\" Garlin commented, directing it to his son.</p>\n<p>\"Well, it seems fresh,\" the boy admitted.</p>\n<p>\"What do you think of the company?\" Garlin followed up.</p>\n<p>\"The proposal presents a worthwhile investment,\" the boy answered. Although he'd spent most of his time before as an aimless scion, Furion had some knowledge of the field through following his father.</p>\n<p>\"It's decided then!\" Garlin declared. \"I will invest in Verum Trading Company. I will partner with the company for distribution. Though, I do have some conditions.\"</p>\n<p>\"We can negotiate the deal, sure,\" Guy responded.</p>\n<p>\"I am willing to invest 100000 gold coins,\" Garlin said. \"But it will be in the name of my son.\"</p>\n<p>\"What?!\" Furion shrieked.</p>\n<p>\"He will be your contact and facilitator at Dune Caravan Management. If there is anything you need doing, it will go through him and him alone.,\" Garlin continued. \"Essentially, I want him to become an employee at your Verum Trading Company.\"</p>\n<p>\"Won't that be a conflict of interest?\" Guy probed.</p>\n<p>\"It would,\" Garlin answered. \"But from the date of signing this contract, the boy will no longer be bankrolled by me.\"</p>\n<p>\"Father?\" Furion uttered in shock.</p>\n<p>\"You will live in this house, your essentials will be funded by deducting a percentage of the salary you earn from your work at Verum. You will be responsible for every other expenditure of yours from this point on,\" Garlin declared.</p>\n<p>\"Will that be a problem?\" Garlin asked Guy. But the question felt rhetorical.</p>\n<p>\"You wish to educate your son through this?\" Guy rephrased.</p>\n<p>\"I do,\" Garlin answered.</p>\n<p>\"Why?\"</p>\n<p>\"Furion here and his group of wastrels spent less than a year with your Disciple and changed completely,\" Garlin started. \"I was always intrigued by how a single boy could accomplish such a feat. But after meeting you in person, I can see your fingerprints on his personality.\"</p>\n<p>\"Markus here managed to elicit changes in my son in months, where I failed over years,\" Garlin confessed with a sorrowful frown. \"I won't be shameless and foist him upon you without remuneration. You can treat those 100000 gold coins less like an investment and more like fees to teach my boy. Treat him how you see fit, pay him what you feel is appropriate, just please do anything to fix my mistakes.\"</p>\n<p>\"Father,\" Furion said with a wavering voice.</p>\n<p>\"I made a mistake,\" Garlin continued while shaking his head, speaking to his son this time. His voice sounded aged and worn out. \"I pushed my expectations upon you without considering your feelings. You are a talented and thoughtful boy, it's just that I wasn't good enough to nurture it well.\"</p>\n<p>Furion's eyes threatened to tear up, but he quickly dabbed them and looked away.</p>\n<p>\"So, Sect Leader Larks. Do you find these conditions acceptable?\" Garlin redirected. His face had mellowed out, and there was a pleading and hopeful intonation in his request.</p>\n<p>To that, Guy frowned and said, \"So you're basically saying that you will invest in my company if I take in a new student, for an exorbitant fee at that?\"</p>\n<p>As Garlin nodded, Guy said, \"I don't accept.\"</p>\n<p>Before the man's face drooped in defeat, Guy warped with a sly smile and said, \"I was here for an investment, and I will take your money as an investment. You will be eligible for the benefits that come with said investment as stipulated in the contract. Apart from that, I accept the employment of your son in Verum Trading Company in concordance with your conditions (to be amended into the contract). This employment will involve an extensive training phase which will intimate him with all the aspects of the business and will cover a wide range of skills.\"</p>\n<p>Guy extended his arm forward and concluded, \"Are those conditions acceptable?\"</p>\n<p>Garlin laughed uproariously as he interpreted Guy's words, \"We have ourselves a deal then!\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/yj44qre1rma1wbkn4eg4rv3\">Chapter 202 - Covering all of the Bases</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/qkdbfnbrubl1fcq3nx269hm\">Chapter 200 - Rekindling</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}