{"pageProps":{"note":{"id":"nB7lGOAd7kCMof7T8oRDG","title":"Chapter 124 - Do Not Try This At Home (Redux)","desc":"","updated":1643657657716,"created":1643655636040,"custom":{},"fname":"volume-2.chapter-124","type":"note","vault":{"fsPath":"vault"},"contentHash":"ac8169b3c6b5dfaee535edb9f1ba4ae6","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-124","id":"nB7lGOAd7kCMof7T8oRDG","vaultName":"vault"},"value":"volume-2.chapter-125","position":{"start":{"line":135,"column":3,"offset":12466},"end":{"line":135,"column":27,"offset":12490},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-125"}},{"from":{"fname":"volume-2.chapter-123","id":"vlfbRPCPYMVdb9Z5S8wkH","vaultName":"vault"},"type":"backlink","position":{"start":{"line":97,"column":3,"offset":10341},"end":{"line":97,"column":27,"offset":10365},"indent":[]},"value":"volume-2.chapter-124"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-124---do-not-try-this-at-home-redux\">Chapter 124 - Do Not Try This At Home (Redux)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-124---do-not-try-this-at-home-redux\"></a></h1>\n<p>Elaborating on the compartmentalisation spellcasting process was easier for Markus because he played a crucial role in its development. Jean could hear the pride in Markus' voice as he accentuated certain nuances, and offered his personal insights. During this, Markus ensured that the explanation did not extend beyond Jean's level by peppering small anecdotes and relatable examples, just as he'd learned from Teacher Larks.</p>\n<p>After a quick half an hour, Markus separated himself from Jean. \"Let us follow the standard scientific process. Here, catch!\" He commanded while tossing a small ball of coal towards Jean.</p>\n<p>\"Start by casing a standard |Fireball| but use a physical Source Component targetting this coal,\" he instructed.</p>\n<p>Jean cast the |Fireball| using her wand, and flicked the materialised ball towards the rock outcrop. This time, the ball hurtled at a straight path and collided against the surface with an audible bang.</p>\n<p>\"Awesome! Now follow the steps for compartmentalisation,\" he instructed.</p>\n<p>Jean nodded and exhaled loudly to centre her mind. She recollected Markus' earlier explanation and started by simultaneously constructing two spell circles with her will. As Jean finalised the spell circles she materialised it through practice, except she focused on two different points. The first was at the mana gem at the wand base, for the targeting and projection components. The second was from her core, which initiated from her shoulder and moved towards the wand. The two spell circles collided and joined together to form one which reached the tip of the wand, before getting activated with Jean's mana.</p>\n<p>Right as the |Fireball| formed, Jean heard a warning from Markus, \"Don't get excited and lose your focus!\"</p>\n<p>Jean grasped her faltering mind and flicked the ball as practised towards the rock outcrop, the result matched her earlier attempt.</p>\n<p>Markus approached Jean while asking, \"Did you notice the difference?\"</p>\n<p>\"The mana consumption... it was significantly lower,\" Jean affirmed.</p>\n<p>\"Exactly! By offloading the targeting and projection components, which tend to consume exponentially greater mana at your stage, to the mana gem, we reduce the overall mana consumption from your pool. Compartmentalisation is a huge boon for mages. At my level, I can cast over five hundred |Fireball| spells in succession before completely depleting my mana. And that is with a transmutation Source Component, with a physical one I can go for a few hundred more!\"</p>\n<p>Jean's eyes widened slightly in shock.</p>\n<p>\"If instead of the earlier targetting and projection components, you use these,\" Markus said as he pointed to a new page in his grimoire which contained two different spell circles, \"it reduces the mana consumption even further!\"</p>\n<p>\"What's the difference between these circles and the one earlier?\"</p>\n<p>\"The one which I taught you is tailored specifically for that specific type of |Fireball| spell. It will be impossible to apply it for any other projectile type spells. However, this one is a universal type which can be used with any projectile spells,\" Markus explained.</p>\n<p>Jean tilted her head before commenting, \"But these are two different spell circles, how did you confirm this given our limit?\"</p>\n<p>\"That's the bottleneck. You see, thanks to the wand, we at the Mana Condensation realm can sustain two spell circles simultaneously even though the limit is one. However, Master tried out my theory and confirmed that using these two circles for targetting and projection, as well as a third circle for the spell itself, the mana consumption becomes unbelievably lower!\"</p>\n<p>Jean hummed contemplatively, as she pondered over the revelation. She then pointed out, \"Here's the thing though, I agree that further compartmentalisation improves spell efficiency, however, is it worth it? I mean, at higher realms, you have significantly larger mana pools which can be used to leverage the mana consumption of spells without excessive compartmentalisation. Besides, will we even need wands at higher levels? It seems as though these are mainly crutches to allow us to advance at this stage of mage .\"</p>\n<p>Markus shook his head immediately before declaring, \"That's where you are wrong, Junior Sister. The possibilities the wand offers are immeasurable, and so are the prospects from further compartmentalisation. In fact, the two in conjunction can even allow you to cast spell multiple levels beyond your own AND spells that are attuned to special 'elements', natures or even bloodlines.\"</p>\n<p>Jean's unwavering expression didn't completely occlude her confusion from Markus' perception. Somehow, after teaching Jean for so long, he had become more aware of her limits of comprehension, as well as her subconscious behaviours and ticks. Markus smiled slyly before walking further away, in the direction of the stream. He turned to face Jean and began orating.</p>\n<p>\"By increasingly compartmentalising a spell, although we increase the number of spell circles, we are reducing their intricacy. This trade-off makes it palatable for a mage at the lower realms who have a limit on the number of spells they can sustain.\"</p>\n<p>As he said this, Markus started to cast a new spell. It started with three small spell circles forming simultaneously from the base of the magic wand, and blooming outwards circularly around his wrists.</p>\n<p>\"On top of that, the larger mana gem with the fluid enchantment offers a greater surface to sustain multiple smaller spell circles as long as they are arranged in a mathematically compact orientation, and you don't mess it up during their formation of course.\"</p>\n<p>Markus' face scrunched up with great discomfort as a fourth spell circle began to form and descend from his shoulders. It didn't stop there, though! Markus grunted audibly before generating a fifth, large spell circle that could encompass all four within it, and pushing it down from his left shoulder.</p>\n<p>\"Quickly cast a |Fireball| and project it at me!\" He commanded in a strained voice.</p>\n<p>\"But-\"</p>\n<p>\"DO IT!\"</p>\n<p>Jean caught herself quickly and started to cast a |Fireball| through practice. She decided to go with the easier, non-compartmentalised, method to avoid mistakes. She didn't miss the fact that the Senior Brother had essentially cast five simultaneous spell circles, which were said to be beyond the limits of a Late-stage Mana Condensation realm mage, well into the Internal stage of Foundation establishment (a step above Teacher Larks' current cultivation level). She could already fathom the difficulty of this attempt.</p>\n<p>'He must be straining his will to its limits in doing this. Senior Brother is so... Awesome!' she celebrated with amazement.</p>\n<p>The |Fireball| was formed and, with a flick, hurtled towards Markus.</p>\n<p>Right as the ball left the tip of Jean's wand, Markus activated the spell circles and pushed them forward. The spell circles on his right hand with the wand formed a diagram with a large central circle containing smaller equally sized circles with their centres at its circumference at the bearing 0-degrees, 120-degrees, and 240-degrees. This collided with the larger spell circle, which contained multiple components lined along the periphery, from his left hand. They joined together in front of him, to form a massive spell circle that started to rotate agitatedly. As it activated, and the purple ethereal diagram was illuminated, an ungodly screeching resonated from it.</p>\n<p>Markus grit his teeth and circulated even more of his mana towards the spell circle, which quickly formed a small dark point, the same size as the tip of a pin, at its centre.</p>\n<p>The screeching grew in volume markedly, as Markus could feel air gushing towards the point uninhibitedly. Right then, the hurtling ball of fire collided against the point, causing the screeching noise to quieten slightly. The |Fireball| whirled in place as the flames started getting siphoned into the point voraciously. Even the dirt from the ground wasn't saved from the point's suction, as specks started to rise and rush towards the minuscule maw!</p>\n<p>As Markus observed this reaction, he was brought back to his fight against Gaige. Back then, all of his attacks were easily extinguished and consumed by a curtain of avaricious darkness. The point was close, but it still wasn't the same! Something in his mind told him that it was only a weak replica of that attack, and insignificant compared to the black hole he'd seen before. He was overcome with disappointment at his spell's performance.</p>\n<p>The moment of distraction was enough for his spell to waver. The small black point started to vibrate.</p>\n<p>\"Oh no!\"</p>\n<p>BOOM!</p>\n<p>An explosion surged outwards as the point expanded instantly. The sonic boom that followed pushed Markus back and flung him into the flowing stream behind. Thankfully, Jean was at a safe distance away and quickly collapsed towards the ground on her stomach.</p>\n<p>\"S-Senior Brother!\" Jean coughed out instinctively.</p>\n<p>\"I'm okay!\" Markus groaned as he rose from the flowing stream.</p>\n<p>A short second following that, the hurried figures of Al and Guy descended upon the scene, worry plastered across their faces. It didn't take long for them to put together the situation after observing the surroundings. Guy's face warped into a defeated frown before he growled, \"Markus!\"</p>\n<p>\"I-I can explain, Master!\" Markus quickly vocalised.</p>\n<p>\"Oh, you better! What the heck was that screeching sound? And the explosion?!\"</p>\n<p>\"Teacher Larks,\" Jean quickly interjected. \"Senior Brother replicated the spell Gaige used!\"</p>\n<p>\"Not exactly-\" Markus tried to explain, but he was immediately interrupted by an agitated Al. \"You did what? Quick, show it to me!\"</p>\n<p>Markus wanted to properly elucidate them about his spell, but Al was having none of it! Markus sighed in defeat and simply produced the spell circles he used from his grimoire.</p>\n<p>With a maniacal chuckle, Al started to cast the spell. He didn't need to use a wand, nor did he need to use multiple hands. The entire ensemble was formed instantaneously in his right hand.</p>\n<p>Markus inconspicuously shuffled away from Al and pulled Jean and Guy with him. Al followed up immediately by activating the spell circle. As he did so, a much louder screeching noise resonated from the spell circle, causing the others present to cover their ears in pain.</p>\n<p>\"HA!\" Al exclaimed as a black point materialised at the centre of the spell circle.</p>\n<p>\"HAHAHAHAHA!\" Al continued as he pushed the black point towards the ground. As it descended, the point consumed the soil and drilled further and further downwards.</p>\n<p>\"It works! AMAZING!\" Al emoted.</p>\n<p>As this was happening, Guy noticed Markus' strained expression.</p>\n<p>\"What's wrong? The spell works, why are you so distressed?\" He asked.</p>\n<p>\"The spell is incomplete,\" he confessed while screaming over the muffled screech. \"It isn't the same as Gaige's attack...\"</p>\n<p>\"What do you mean?\"</p>\n<p>\"Well... After some thought, I realised that Gaige's attack wasn't how a black hole worked. All the matter and energy that was consumed simply disappeared, releasing nothing. That's not what a black hole does. A black hole emits radiation and energy.\" Markus explained.</p>\n<p>\"That makes sense.\"</p>\n<p>\"I figured that there were probably other mechanisms at work there apart from just absorption. Maybe he dissipated the energy over the blanket of darkness after disintegrating the matter and energy. Anyways, I decided to pivot and focus on the principles of how a black hole works. You see this spell generates a point that absorbs all matter that enters it and compresses it infinitely. This process is sustained by how much mana a mage can continuously expend,\" Markus continued.</p>\n<p>\"Sure.\"</p>\n<p>\"But what happens when the mage runs out of mana? Or they stop the spell?\" Markus concluded.</p>\n<p>\"Then everything that's within... Oh shit!\"</p>\n<p>Guy immediately grabbed his two students and rushed out.</p>\n<p>\"Heh? Where did they go?\" Al commented as he noticed the missing audience. He shrugged and decided that it was time to cancel the spell, seeing as it was consuming exponentially more mana as it progressed.</p>\n<p>BOOOOOOOOOOM!</p>\n<p>An earthshattering explosion blossomed from the clearing. A large swatch of the forest was overturned. The stream had been rerouted as well. Thankfully the explosion didn't reach the village. Yet the aftershock did cause a few structures to shift and collapse. To this date, no one knew exactly what caused this because the only people complicit in this incident kept their mouths shut, and were prepared to take it to their graves.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/3DqNboan0HBe19rcxMxTJ\">Chapter 125 - Artistic Philosophy</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/vlfbRPCPYMVdb9Z5S8wkH\">Chapter 123 - Explaining Compartmentalisation</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}