{"pageProps":{"note":{"id":"nchwfnbotw2rcsib1xn1qas","title":"Chapter 100 - (Interlude) A Brewing Storm (Part One)","desc":"","updated":1648144826363,"created":1648144826363,"custom":{},"fname":"volume-2.chapter-100","type":"note","vault":{"fsPath":"vault"},"contentHash":"47442c8f501aff5df2f5344029a17883","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-100","id":"nchwfnbotw2rcsib1xn1qas","vaultName":"vault"},"value":"volume-2.chapter-101","position":{"start":{"line":105,"column":3,"offset":11386},"end":{"line":105,"column":27,"offset":11410},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-101"}},{"from":{"fname":"volume-2.chapter-099","id":"okV8GIQk9UYlBOtrZl1VR","vaultName":"vault"},"type":"backlink","position":{"start":{"line":175,"column":3,"offset":11926},"end":{"line":175,"column":27,"offset":11950},"indent":[]},"value":"volume-2.chapter-100"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-100---interlude-a-brewing-storm-part-one\">Chapter 100 - (Interlude) A Brewing Storm (Part One)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-100---interlude-a-brewing-storm-part-one\"></a></h1>\n<p>\"Be careful!\" The woman exclaimed with a helpless expression. She walked with a slight hunch, which wasn't helped by the fact that a massive basket was slumped over her shoulders, resting against her spine. Although she was only in her late twenties, her appearance was haggard and resembled someone who was well beyond. Her face contained many wrinkles and blemishes, possibly a result of poor skincare and overwork.</p>\n<p>The person she called out to, a little boy carrying the same yet a more size-appropriate basket, stopped and turned to face her with a bright smile, \"Mom, hurry! The fungus I saw last time is this way. We need to get there before an animal eats it.\"</p>\n<p>The boy appeared a bit malnourished for a six-year-old. However, his bright smile overshadowed it all, dousing the obvious suffering his body had gone through.</p>\n<p>\"<em>sigh</em> Slow down,\" the woman pleaded with a bitter smile. If anyone observed her carefully, they would notice a slight limp in the way she walked. After years of hard labour, damages had accumulated within the woman's body.</p>\n<p>The boy noticed his mother's struggling expression and immediately relented, \"Umm. Why don't you wait here? I'll go fetch it real quick!\"</p>\n<p>\"Absolutely not! Although this part of the woods is relatively safe, I can't let you take a risk like this!\" The woman denied it immediately. The duo had traversed these woods for many months now and was thoroughly acquainted with the layout and the movement of fauna. The woman was sure that there wouldn't be any issues with letting the boy venture by himself. However, something inside her, possibly her instincts, warned her against it.</p>\n<p>\"But... But it's exactly what the magistrate was looking for,\" the boy pleaded. \"We could make a lot from this,\" he further reasoned.</p>\n<p>The woman's firm expression faltered slightly as she pondered over her son's proposition. The mother and child lived alone. The woman's husband, and the child's father, had perished after getting conscripted into the army for a futile border dispute. It was futile because, after a few confrontations, nothing had changed. Apart from the razing of a few villages and the loss of a few lives, the border remained as it was. To top it all off, the woman didn't even learn of her husband's passing until three whole years had passed after the war ended. All that time, she lived in uncertainty. Not knowing if her husband was dead, or if he had abandoned them. Until one day, one man who revealed that he was her husband's comrade in the war arrived at their doorsteps and begged for forgiveness.</p>\n<p>Her husband and the man had volunteered to lay down their lives to let a small regiment retreat to safety during a confrontation with the opposing army. They believed that since they were the eldest in the whole regiment, it was their duty to shoulder the burden. Fortunately, or unfortunately, the man happened to survive after he feigned death following a strike from a sword. Her husband wasn't so lucky. Hearing the whole story, the woman cursed her husband. What valiance? What honour? Honour never paid the bills!</p>\n<p>Nonetheless, left alone in this world with nothing to their name, the mother and son had to resort to menial labour to survive. Collecting wild plants, fruits and vegetables was their most recent venture. Usually, a regular trip such as this one would amount them maybe 5 to 8 copper coins on a good day. That was barely enough for one person to survive. Most of what she earned would go towards nurturing her son, the morsel that remained would be used to fill her.</p>\n<p>Finally, the woman released a defeated sigh and affirmed with a nod. \"But please... Please don't do anything stupid and be careful...\"</p>\n<p>The boy vigorously in response. \"Just wait right here, mom! I'll be back in no time.\"</p>\n<p>The boy received into the woods with a skip in his steps as he tried to trace back the path to the spore cluster he had found earlier. He was an intelligent boy with a sense of memory far beyond his years. He expertly navigated through the thickets and finally arrived at his destination, underneath a towering tree that rose up and above the canopies.</p>\n<p>Near the roots of the tree - the sections that snaked out from the soil - he saw the prospering spores he'd been searching for. The mushrooms were small and coloured a deep shade of brown. He'd heard of them before when lurking around in the marketplace. According to the intermittent conversations floating around there, he learned that these specific ones were highly sought after for their umami flavour, whatever that meant. After all the boy never ate for the taste, he ate to survive.</p>\n<p>These were supposed to be extremely rare kinds of mushrooms because they grew in a very particular environment. But all that information wasn't of this kid's concerns. He just plopped down the basket hanging over his back and started to harvest them with a semi-blunt knife. One by one, the mushrooms were separated from their stems and were tossed into the basket. The kid wasn't overzealous with the harvesting. He knew that if he flooded the market with these mushrooms, he'd raise a few eyebrows. He knew better than to attract unwanted attention. So, after ensuring that he had only collected enough to satisfy the magistrate, the boy stopped.</p>\n<p>Before he left, he moved a few barks from the tree trunks nearby, and a few fallen leaves to cover up the spores. Although these wouldn't completely dissuade wild animals from inspecting the area, he hoped that it would at least protect them from prying eyes.</p>\n<p>As he started to make his way back, the boy suddenly felt an ominous and unsettling wave pass through him. The feeling made him sick to the core. Controlling the urge to vomit, the boy slowly supported himself by standing against one of the trees. After he caught his breath the boy investigated the area around him.</p>\n<p>Abruptly, the boy heard loud sounds coming from far in front.</p>\n<p>\"Mom!\" The boy exclaimed and rushed out. </p>\n<p>Compared to his earlier trip, the boy stumbled multiple times as he frantically avoided the underbrush and rocky protrusions along the ground. With each step closer to the source of the wave, he grew increasingly agitated and anxious.</p>\n<p>Finally, the boy broke through the woods and entered the clearing where he had separated from his mother. </p>\n<p>\"Mom!\" he called out towards the squatting figure of a woman, with her back towards him. Hearing the boy's call, the woman twitched her shoulders and jerked her neck.</p>\n<p>\"a...a...a...\" A gravelly voice escaped the woman's mouth as she rose with a mechanical jerk in her motion - it was like her joints had all dried up. The woman with a tilted head yanked her body in a 180-degree turn and faced the boy.</p>\n<p>As soon as the boy's eyes fell on the woman's empty, bloodshot, and lifeless eyes, he took a step back and fell onto his bottom.</p>\n<p>\"M-Mom!\"</p>\n<p>\"Raaaa!\" The woman vocalised with a gravelly and rage-filled voice. She took an unstable step forward, and nearly fell over.</p>\n<p>The boy shuffled back as he observed his mother approach him with an unfamiliar, predatory gaze. The look in her eyes mimicked that of a starving beast!</p>\n<p>\"M-Mom...\" The boy muttered out loud. \"W-Why are you acting like this?\"</p>\n<p>Alas, the woman didn't respond to him as he expected. All of a sudden, the woman jerked into a rapid crawling motion on all fours. She rushed towards him, mouth agape with her teeth exposed and with murderous eyes.</p>\n<p>\"AAAAA!\" The boy screamed out loud. He instinctively closed his eyes and fear overtook his subconscious. When faced with certain death, one often assumes that the only two options that one's instincts will default to are fight or flight. But this is only true if the instinct predicts even a minuscule chance of survival. Upon facing imminent and unchallengeable death, the body chooses that it is best to shut down and succumb as quickly as possible, to ensure minimum pain and suffering as death embraces it.</p>\n<p>Right before the woman's teeth approached the boy's exposed neck, it stopped. The boy opened his eyes and saw the woman he called mother before him. Her face had grown older within a short time. It had also grown paler and looked diseased. However, unlike the dead and beastlike eyes he'd gazed at before, there was life in them now! The boy could feel great sorrow within the eyes.</p>\n<p>\"Mom?\" He called out.</p>\n<p>\"S-Son... R-Run!\" The gravelly voice spoke with a warm intonation.</p>\n<p>\"Mom?\"</p>\n<p>\"R-RUN!\" The woman repeated.</p>\n<p>The boy tried to scramble up, but his body failed to respond. He started to wail in fear and sadness as he tried to shift backwards. </p>\n<p>Before he could create sufficient distance, the woman's eyes shifted again. With a hoarse, bloodthirsty shriek, the woman leapt at the boy.</p>\n<p>The boy was once again preparing himself for his demise.</p>\n<p>However, it didn't come. Just a short second after the woman rushed at him, the boy heard a loud boom, then a pop, and then a tsunami of warmth collided against him.</p>\n<p>He slowly opened his eyes and was assaulted by a horrific scene. Before him, lay the body of his mother... headless. Above her neck, black blood oozed out like a fountain. Around it and dangling over him was gore and bits of her rotting brain. The corpse twitched slightly before it turned completely limp, squirting out more blood in the process.</p>\n<p>\"Mom?\" The boy said through hiccups. He approached the body and turned it over. He verified that it was his mother, although he couldn't see her face. </p>\n<p>He wanted to cry. But he could feel his emotions being blocked in place. There was just too much, and just too little space to allow it to flow through. It had all backed up.</p>\n<p>It had all happened too quickly. His mind couldn't process it all...</p>\n<p>As the boy gazed lifelessly at his mother's corpse he heard another boom, just like before. He followed the sound to its source subconsciously, but he made sure to hide as he did so.</p>\n<p>\"Tsk! So this is what is left of the great Plague Emperor?\" An arrogant voice pierced through from behind a hanging collection of vines.</p>\n<p>\"We knew that it was all just exaggeration. To think that the sect was scared of you?!\" Another arrogant voice chimed in.</p>\n<p>The boy peeked through the vines to observe the hubbub. He separated a few hangers and saw an emaciated and dastardly looking old man keeling over and vomiting out black blood.</p>\n<p>\"PAH!\" The elderly man spat out with venomous anger. \"So much for the orthodox, HONOURABLE, sects! Attacking a mage while he is advancing in realms - aren't you ashamed?!\"</p>\n<p>\"HA! History is written by the victors. Who's going to know?\" One of the earlier voices retorted. The boy followed it and saw that it originated from a man floating around the height of the canopy. He was wearing a dark blue robe that reached up to his ankles. The boy could immediately tell that the man was extremely tall because his partner, who looked to be of average height, was completely dwarfed next to him.</p>\n<p>The shorter partner was also a male and wore a similar get-up. However, for what he lacked in height he more than made up with his nigh flawless, chiselled appearance. The partner snorted and added, \"How else can two Core Condensation mages such as us stand up to a Tesseract Transformation realm mage? Sometimes, certain measures need to be taken. Now! It would be better for you to stand down and accept your death. We promise to make it quick and painless.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/gb0zs9edb4ioqavt94qkxxt\">Chapter 101 - (Interlude) A Brewing Storm (Part Two)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/okV8GIQk9UYlBOtrZl1VR\">Chapter 099 - Prowling for Some Petals</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}