{"pageProps":{"note":{"id":"nj0k3j168dqzri7yhz46tcq","title":"Chapter 210 - Alternative to the Heavenly Eye","desc":"","updated":1660073331911,"created":1658039964619,"custom":{},"fname":"volume-3.chapter-210","type":"note","vault":{"fsPath":"vault"},"contentHash":"6a82084c0ccda6080010e8bee818cacd","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-210","id":"nj0k3j168dqzri7yhz46tcq","vaultName":"vault"},"value":"volume-3.chapter-211","position":{"start":{"line":101,"column":3,"offset":10478},"end":{"line":101,"column":27,"offset":10502},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-211"}},{"from":{"fname":"volume-3.chapter-209","id":"yd1wkkw1wlkax8os82ny6hq","vaultName":"vault"},"type":"backlink","position":{"start":{"line":83,"column":3,"offset":10345},"end":{"line":83,"column":27,"offset":10369},"indent":[]},"value":"volume-3.chapter-210"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-210---alternative-to-the-heavenly-eye\">Chapter 210 - Alternative to the Heavenly Eye<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-210---alternative-to-the-heavenly-eye\"></a></h1>\n<p>Although Guy enjoyed indulging his student's requests and teaching, he recognised the disrespect in the act of intruding into a Master's territory and guiding their Disciple. Although this wasn't his first time aiding Marie in her cultivation, he didn't want this to become a regular event. After all, it was a bad sign if the Disciple of another approached him with all of her cultivation hang-ups. Therefore, the first thing he did after waking up was to approach Krish's cottage and get his permission.</p>\n<p>However, before he could take a step out of the orphanage, the answer he sought was delivered directly into his head. \"You can go ahead and ease her troubles.\"</p>\n<p>It was Krish's voice through transmission. Since Guy didn't have the same range, he had to speak out loud to seemingly no one in particular, like a madman.</p>\n<p>\"I don't know how to do it though. Again, I am not informed about the Heavenly Eye in any way whatsoever. Furthermore, I am aware that revealing any sensitive information can result in calamitous consequences. Are you sure that you want me to get involved in this?\" Guy asked</p>\n<p>\"I trust Marie to differentiate between the knowledge that can and cannot be shared. She is a cautious and mature girl. She is just stuck right now and needs some guidance to nudge her in a direction that can yield some form of result. It doesn't have to be successful, as long as she feels like she has achieved something meaningful.\"</p>\n<p>Guy hummed in contemplation and inquired, \"What exactly is she trying to do?\"</p>\n<p>\"I will leave her to answer that question. You should prepare yourself, she is approaching you... Now!\"</p>\n<p>\"Mister Larks!\" Marie greeted from behind him.</p>\n<p>\"Marie, good morning.\"</p>\n<p>\"I don't know if it's good just yet,\" Marie snorted. \"Can we continue where we left off yesterday?\"</p>\n<p>\"I was waiting for you, after all,\" Guy said with a smile.</p>\n<p>Guy ushered Marie into the classroom and urged her to explain her trouble coherently while utilising the blackboard to augment her retelling. He recollected from yesterday that there were multiple moving parts and details that were important which sort of rushed past him. And by the time Marie finished presenting her piece, two blackboards had been filled up with intricate diagrams, key phrases, propositions, hypotheses and rogue thoughts.</p>\n<p>\"That's where I'm stuck,\" Marie said with a defeated sigh. \"I have no idea where to go with this. There is literally nothing I can do here!\"</p>\n<p>Marie's shoulder drooped with visible exhaustion, but it immediately perked up as her gaze gained a bright shimmer. She looked eagerly toward Guy. To her, Guy was akin to a great big bird who would swoop down and save her whenever she was stuck. Her tendency to rely on Guy had grown marginally within the last year, which was a good sign. It indicated that Marie was slowly letting go of the metaphorical weights that bore down on her shoulders. But it also put Guy in a difficult position, since he felt more and more pressured with each problem of hers as they grew in complexity. Maybe this was how parents felt as their kids grew older and the world moved forward while leaving them behind. Sometimes, Guy just didn't know what to do... If this were any other student of his, he would easily just tell them that he didn't know and guide them through possible research avenues. But when facing Marie's worshipping and admiring gaze, Guy just couldn't vocalise his ineptitude.</p>\n<p>Guy scratched his chin as he scrambled for a feasible starting point - any detail he could grasp and possible build upon.</p>\n<p>\"Just to confirm, as long as your observation of these 'Constants' is not through your Heavenly Eye, you will be safe? Have you confirmed that claim?\"</p>\n<p>\"We have reason to believe so. I mean, there hasn't been a set precedent, but circumstances suggest that it may be the case,\" Marie reaffirmed. Guy could see that she was holding back some details, but he could figure out that they may be secrets related to her cultivation method.</p>\n<p>\"Have you considered how other cultivators specialising in divination and future sight tune their powers?\" Guy inquired.</p>\n<p>\"No I haven't,\" Marie answered with some uncertainty.</p>\n<p>\"Why is that? You were struggling to find resources. Well, what about them?\"</p>\n<p>\"They aren't as accurate as the Heavenly Eye,\" Marie argued.</p>\n<p>\"But they work, don't they?\" Guy argued back. \"Even if the margin of error with them is greater, they offer a solution - something you sorely need.\"</p>\n<p>Marie's lips parted as she failed to come up with a response. In truth, this idea did pass her mind before but she didn't go through with it because-</p>\n<p>\"Arrogance,\" Guy declared. \"Every piece of knowledge which is sufficiently substantiated has truth to it.\"</p>\n<p>\"You're right,\" Marie accepted with a defeated smile. \"I was being conceited.\"</p>\n<p>\"Your Master is probably to blame,\" Guy blurted out, only to receive a sarcastic scoff directly transmitted into his head. He bit his tongue apologetically. \"The people you worry about competing against - those that have lived for millennia each - they are all cut from the same cloth. They have the same prejudices and biases. The arrogance that was building up inside you probably accumulated inside them as well. What you have in those records your Master showed you is an echo chamber in written format. Everyone is just accepting and repeating what others have written before them.\"</p>\n<p>Guy leaned forward and said, \"The first step to solving the puzzle in front of you is, like always, accumulating more perspectives even if it isn't optimal. Since I have a week or so of free time before the builders get here, we shall conduct the research work together.\"</p>\n<p>Marie nodded appreciatively, but then her gaze mellowed, \"I don't think Master has any cultivation manuals of other divination or farsight-based cultivation paths.\"</p>\n<p>To that, Guy revealed a proud smirk and said, \"That's not an issue. I remember reading through a bunch of them back in the Academy. I just have to transcribe them.\"</p>\n<p>\"You remember them by heart?\" Marie exclaimed in shock.</p>\n<p>Guy tapped the side of his head and spoke mysteriously, \"My head is a steel trap, once I read a book I never forget it. There is literally a Repository of Knowledge in there.\"</p>\n<hr>\n<p>Guy was never a fan of the myriad of cultivation manuals catching metaphorical dust in his Repository of Knowledge. Not only were they remnants of an unpleasant past of his after coming to this world as evidence of his failure, but they were also a massive headache to decipher. Cultivation manuals had a penchant for dramatics and tended to obscure the teachings with cryptic and often unintelligible drivel - in Guy's point of view. However, he was pleasantly surprised to see Marie sharing his opinion though for a completely different reason.</p>\n<p>\"There aren't any evidence or theories to back it up. Are we just supposed to believe them as is - take them for their word?\" She argued as she slammed the manual onto the desk with an annoyed huff. For the past three days, Guy and Marie had gone through the cultivation manuals pertaining to divination and future sight from both Guy's repository of knowledge and from a quick scouring of Krish's and Al's personal libraries. There was a substantial amount to go through, but with a division of labour, things progressed smoothly... in the beginning. After the first two manuals, both Guy and Marie started to exhibit outward irritation over their contents.</p>\n<p>\"Since you have a Master to train you and indulge in your inquiries, you have it easy. Back at the Academy, you had to make do with these manuals,\" Guy explained. \"The main reason why most students fail to advance in the Academy is BECAUSE they cannot decipher this garbage, and no one really goes out of their way to help unless the student shows some promise.\"</p>\n<p>\"Markus must have had it tough, uh?\" Marie commented, to which Guy affirmed with a hum.</p>\n<p>\"That's it, I can't take this anymore,\" Marie declared while throwing her hands in the air. \"They're all the same. They just move words around, use alternate phrasing, play with semantics and vocabulary...\"</p>\n<p>\"How are they the same?\" Guy targeted. \"Be more analytical.\"</p>\n<p>\"Well, they all revolve around the motion or organisation of inter- or extraplanetary bodies,\" Marie explained. She then spread her hands between two distinct stacks of books next to her and added, \"This stack of manuals focuses on constellation arrangements, star clusters and so on, while this stack focuses on the planetary bodies within our solar system.\"</p>\n<p>\"Now since we know for a fact that these cultivation methods are effective and CAN be used for future sight, our goal is to determine how and why, and the bridge the gap between them and the Heavenly Eye,\" Guy laid out.</p>\n<p>\"If I approach the reasoning from the other way: the Heavenly Eye directly gazes at the waves of fate, which is a fundamental law that governs the world. Waves of fate affect everything in and around us,\" Marie started.</p>\n<p>She then cradled her chin on her hand and hummed loudly while her mind ran through hypotheses. After an audible fifteen minutes, she opened her mouth and orated steadily, \"The Heavenly Eye can gaze directly into the waves of fate, however, those not practising it cannot do so. In order to make up for this disadvantage, the contemporary seers utilise the behaviour of massive bodies as indicators. This is because the planets hold a greater influence in the grand scheme of things.\"</p>\n<p>\"Elaborate,\" Guy urged.</p>\n<p>\"Well, if you perform an action, the magnitude of the wave is negligible compared to if a planet suddenly shifts its orbital trajectory. Your singular action may not create large ripples in fate's machinations, but a planetary-sized change might!\" Marie spoke with vigour and her eyes started to sparkle. She was nearing a conclusion and she was getting agitated at that prospect.</p>\n<p>\"So, there you have it,\" Guy beat her to the punch. \"Your solution to the alternative to the Heavenly Eye.\"</p>\n<p>\"But will it be effective?\" Marie muttered out loud.</p>\n<p>\"Not quite,\" a voice answered. A series of measured clacks of wood against the ground followed as it approached their position. Marie immediately recognised her Master's voice and readied a seat for him in anticipation.</p>\n<p>\"The books in front of you are evidence of the fact that they aren't as accurate as the Heavenly Eye is deciphering the future. I don't believe it will be possible,\" Krish said with an unsure frown as he entered the classroom.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/pp39nkujysxofng4hisuip4\">Chapter 211 - Deterministic Chaos</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/yd1wkkw1wlkax8os82ny6hq\">Chapter 209 - Contesting the Ancestors</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}