{"pageProps":{"note":{"id":"nmUVsokSqNTRu9pPUD0Bj","title":"Chapter 048 - Coincidental Source of Income","desc":"","updated":1643622740780,"created":1643569306100,"custom":{},"fname":"volume-1.chapter-048","type":"note","vault":{"fsPath":"vault"},"contentHash":"b643cd463a7d3781fb516ef7899fb977","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-048","id":"nmUVsokSqNTRu9pPUD0Bj","vaultName":"vault"},"value":"volume-1.chapter-049","position":{"start":{"line":93,"column":3,"offset":10546},"end":{"line":93,"column":27,"offset":10570},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-049"}},{"from":{"fname":"volume-1.chapter-047","id":"2w6UnSYUhb5wTI0Qf3qvn","vaultName":"vault"},"type":"backlink","position":{"start":{"line":109,"column":3,"offset":9427},"end":{"line":109,"column":27,"offset":9451},"indent":[]},"value":"volume-1.chapter-048"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-048---coincidental-source-of-income\">Chapter 048 - Coincidental Source of Income<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-048---coincidental-source-of-income\"></a></h1>\n<p>The last time Guy accessed Karmin's personal inventory, he had taken a cursory glance at the contents, especially at the items he recognised from his old world. One of the items he took notice of was a container filled with yellow powder. While he had a gist of what it was, he wasn't confident in recognising it at first glance. But after taking a pinch of it in his hands and combusting it, he immediately confirmed its identity through its blue flame.</p>\n<p>\"Sulfur!\" Guy declared as he carefully lifted a glass container and scooped up a decent amount of the substance. On his way out, he fetched a few more containers that were sturdy and could sustain higher pressures.</p>\n<p>He then brought them out of the inventory and moved towards a stable working platform in Karmin's workshop. All the while Karmin unflinchingly observed Guy's actions.</p>\n<p>Most high-school chemistry courses covered the topic of reversible chemical reactions. These are special chemical processes in which the system, defined as the sole mixture of reactants and products, is in a constant flux of forward and reverse reaction - the making and breaking of products. This is opposed to regular chemical reactions in which the process is monodirectional and it is impossible to obtain the reactants from the products.</p>\n<p>In this topic, students are forced to learn two case studies on reversible reactions and manipulating the equilibrium of these systems: the Haber process, and the Contact process. These case studies are so common that most chemistry teachers, even those that have retired, can recite them from memory without missing a beat.</p>\n<p>The former was named after a Nobel Prize-winning Polish scientist who developed a method to efficiently produce ammonia. That chemical had two faces, it is a key component in fertilisers and explosives. Interestingly, Fritz Haber, the namesake behind the reaction, intended to use it to ramp up Germany's offensive efforts in World War 1.</p>\n<p>The second case study, the Contact process, defined a strategy to synthesise sulfuric acid from sulfur, and this was what Guy was aiming for.</p>\n<p>Before he began, Guy pondered for a while and formulated a set of spells that would fit his needs coming forward. He didn't want to flounder around midway through the reaction and screw up the entire process.</p>\n<p>After he was satisfied with his preparation, he brought the sulfur into a closed container and combusted it with excess oxygen. The output of this reaction was sulfur dioxide. After he verified the gaseous contents of the container, he used another spell mixed with the cantrip |Inspect| to carefully remove all the other gases from the container except for sulfur dioxide.</p>\n<p>Once done, he channelled another spell to bring oxygen into the mixture. Using |Inspect| he made sure that the ratio of sulfur dioxide to oxygen was 2:1. He then used two alternating spells to both slowly lower the temperature inside the container as well as ramping up the pressure by forcefully bringing the gases closer together. This was because lowering temperature and increasing pressure favoured the forward reaction that formed the sulfur trioxide product.</p>\n<p>The temperature modulating spell wasn't draining, however, the pressure spell started to eat up a lot of his mana very quickly. Noticing this, Guy decided to act preemptively and pulled out the forming sulfur trioxide from the mixture using a strained third spell.</p>\n<p>He then directed this gas into a container of pure water and let the two react. By removing the product from the equilibrium reaction, the reaction between sulfur dioxide and oxygen accelerated.</p>\n<p>After a few more minutes, the gaseous contents of the container were depleted, and Guy was left with a container of highly concentrated sulfuric acid.</p>\n<p>He then proceeded to dilute the acid and tested it by dropping a sliver of steel residue from Karmin's forge. He observed whether the test metal dissolved in the acid, and further diluted it till he was satisfied.</p>\n<p>Once Guy finished, he transferred the dilute acid to a longer container which sufficient diameter to hold the forged sword and gestured Karmin to submerge it in.</p>\n<p>All the while Guy was performing his magic, Karmin was watching the performance with an engrossed expression.</p>\n<p>Karmin followed Guy's instructions and lowered the sword in till the liquid reached the hilt area, leaving the handle region exposed.</p>\n<p>The two then waited for 10 minutes and pulled out the sword from the acid. Guy proceeded to clean up the sword with a wash of water and quickly dried it.</p>\n<p>As the water droplets evaporated from the surface, Guy saw a familiar texture emerging. Although it wasn't as distinctive as with the Dwarven weapons, it was noticeable and close enough.</p>\n<p>Karmin slowly approached the sword and caressed it with a shaking hand.</p>\n<p>\"It's... It's... We did it!\" He muttered under his breath while lifting the sword into the light.</p>\n<hr>\n<p>Even though Karmin was a bit shaken after achieving his goal, that too in such a trivial manner, he didn't trudge around in a daze. He still had to finish up the sword by adding its guard and grip. Since it was a shortsword, he didn't have to forge an intricate guard, so he resolved to use one that was a part of the grip itself. He made the part out of wood and carefully wrapped it in a mix of cloth and soft leather. Due to his proficiency, this process didn't take a long time.</p>\n<p>After he was finished he placed the weapon on a table rack and admired it in its entirety. Working with Dwarven metal was a dream of every smith. However, due to the scarcity of the metal, they had to settle by melting existing Dwarven craftsmanship. This wasn't as easy as working with other metals because it was kind of like gambling. There was never a guarantee that the reforged weapon or armour would survive the quenching process. If there were cracks or failures, then the smith had to melt it again and reforge the item once more. Each reforging process would take a toll on the metal and would diminish its quality.</p>\n<p>Most smiths would perform months worth of preparation and archaic ceremonies to increase their probabilities of success when attempting reforging with Dwarven metal.</p>\n<p>However, Karmin was elated at the prospect of observing the innovative methods and optimisations provided by Guy. Not only had he managed to replicate Dwarven metal or steel, but he had also implemented a strategy that improved the probability of successful forging. These techniques would be worth a fortune. Most smithing clans would pass down these methods to their younger generation, and guard them close to their hearts.</p>\n<p>Guy just straight up gave it to Karmin for free!</p>\n<p>Karmin didn't know if Guy was a gullible fool or a charitable and kind man. Actually, Karmin wasn't interested in verifying it either. After experiencing betrayal, he wasn't prepared to open himself up just yet. He was grateful to Guy, but he wasn't of a mind to establish a relationship built on loyalty.</p>\n<p>And so, Karmin ran some numbers in his head and spoke up, \"I owe you an immense debt of gratitude, Teaching Apprentice Larks!\"</p>\n<p>Guy quickly waved his hands and replied, \"Please don't say that! I can't offer much in return for your gracious help in letting me practice gem inscription. Consider this as me repaying your kindness.\"</p>\n<p>Karmin shook his head, \"I can't accept that. I'm sure you realise the magnitude of the information you've provided me. This will shake up the market drastically! You say that you're repaying my kindness, but the balance is tilting heavily in your favour.\"</p>\n<p>Guy smiled wryly and retorted, \"You don't have to evaluate it like that...\"</p>\n<p>\"I know that it sounds crass and blunt, but I can only do it this way given my recent experiences. I hope you understand,\" Karmin clarified in a serious tone. He then continued, \"Even though you've offered this technique to The Burning Forge, I am hereby establishing this venture as a partnership. Since you aren't registered with the Smithing and Enchanting Guild, it will be harder, but I'm planning to send in a recommendation that will automatically qualify you for a Practitioning Smithing License. This way, I can register this alloy under your and my name with the guild.\"</p>\n<p>\"You can do that?\"</p>\n<p>Karmin nodded and clarified, \"There are two methods to gaining the Practitioning Smithing License. The first is by passing the guild's assessment. The other is by getting a recommendation from a guild registered smith with a minimum of 1-star. In the latter case, the sponsor must provide assurances about the individual's experience, but you don't have to worry about all that.\"</p>\n<p>Karmin cleaned his hands and pulled out a roll of paper, quill and ink from under his work desk and started writing, \"I am going to write up an informal contract, which I will formalise at a later date and get notarised by the Guild. Since your contribution was instrumental to the development of the new alloy, henceforth called 'Steel', it entitles you to a larger portion of the profits gained from its sale. However, since it was largely dependent on my contribution and work, I believe that I also qualify for an equal share. Any objections?\"</p>\n<p>Guy shook his head.</p>\n<p>\"In that case, how does a 40% share in the sale of steel ingots, and 20% share in the sale of steel weapons and armours sound to you. Since I will be the one providing the raw materials and labour, I believe the percentage is fair. This only applies to sales made through The Burning Forge. If the formula for making steel is to be distributed it will require your verification as well, and in that case, you will have to get involved in negotiating your stake. On that note, I hope that this method remains exclusive with The Burning Forge...\"</p>\n<p>The last part was more of a demand than a request, and Guy knew that. Hearing the long tirade filled with legal jargon caused Guy's palms to sweat up.</p>\n<p>\"It sounds fair to me...\" Guy affirmed in a low voice.</p>\n<p>Following that, Karmin went on to discuss various conditions, loopholes and provisions to account for a variety of scenarios and possible trends in the future.</p>\n<p>The whole process extended deep into the night!</p>\n<p>At that point, Guy inwardly applauded Karmin's capabilities and foresight as a businessman. Not many people would draw up such a thorough contract for a business deal in this world. Mostly it was an assumed agreement. Guy reckoned that once bitten twice shy, Karmin had definitely become more cautious in his dealings.</p>\n<p>'He'll thrive back on Earth!' Guy chuckled in admiration.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/bfd79j7lw7nza2be2s6dg0g\">Chapter 049 - (Interlude) Shady Dealings</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/2w6UnSYUhb5wTI0Qf3qvn\">Chapter 047 - Making a Steel Weapon</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}