{"pageProps":{"note":{"id":"nsj01cdqmr6teifoepmp23h","title":"Chapter 203 - Deadly Secrets","desc":"","updated":1656616265013,"created":1656225206735,"custom":{},"fname":"volume-3.chapter-203","type":"note","vault":{"fsPath":"vault"},"contentHash":"0b6f0f1a9769eaf3f861441a28a5217c","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-203","id":"nsj01cdqmr6teifoepmp23h","vaultName":"vault"},"value":"volume-3.chapter-204","position":{"start":{"line":109,"column":3,"offset":11256},"end":{"line":109,"column":27,"offset":11280},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-204"}},{"from":{"fname":"volume-3.chapter-202","id":"yj44qre1rma1wbkn4eg4rv3","vaultName":"vault"},"type":"backlink","position":{"start":{"line":49,"column":3,"offset":10369},"end":{"line":49,"column":27,"offset":10393},"indent":[]},"value":"volume-3.chapter-203"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-203---deadly-secrets\">Chapter 203 - Deadly Secrets<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-203---deadly-secrets\"></a></h1>\n<p>\"Yes... this looks good,\" Krish muttered as he tapped at a specific location on his cottage wall. He then moved frantically to another location and did the same, \"Yes... yes... good.\"</p>\n<p>He moved from one end to the other, and inspected the floor, the walls and even the ceiling by levitating above the ground at a stable height. This was what Marie observed when she entered the cottage to confer with her Master on this particular day.</p>\n<p>\"Umm... Master?\" Marie announced, expressing her bewilderment through her rising tone. \"What are you doing?\"</p>\n<p>\"Setting up the ritual formation. Close the door and sit there! Don't disturb me,\" he instructed as he resumed his seemingly aimless inspection.</p>\n<p>\"What is this ritual formation about?\" Marie inquired as she assumed a cross-legged, seated position on her Master's cot.</p>\n<p>\"It's in preparation for our next step- Ah shit! Can you stop interrupting me?!\" Krish yelped in frustration. He grumbled under his breath as he redid his previous check.</p>\n<p>\"Why are you being so fussy? Aren't you in the Tesseract Transformation realm? Can't you inspect all of it at once with your mana sense or something?\" Marie mocked.</p>\n<p>\"This girl- You have no idea of the kind of powers we're dealing with. If what we're about to do in here gets out into the world...\" Krish shuddered visibly at the thought.</p>\n<p>Marie squinted suspiciously at Krish and stuck out her tongue in a challenge. Krish noticed her movement and scoffed loudly, \"Stop distracting me!\"</p>\n<p>\"Fine, fine...\" Marie muttered as she lay on her back and napped - or at least she tried to. Her curiosity wouldn't allow her to relax just yet - it didn't help that her Master was extremely vocal the entire time, confirming things out loud and constantly humming in contemplation. This went on for some time, pushing Marie to her breaking point until finally a satisfied, \"Done!\" yanked her into an upright seated stance.</p>\n<p>\"So what is all this about? I don't see or sense anything,\" Marie asked with agitation in her eyes.</p>\n<p>\"You know, nowadays, I don't see you the least bit worried about your cultivation,\" Krish redirected. \"Markus and Jean both have achieved perfected resonance, the former advanced to Foundation Establishment while the latter stands at the cusp of breaking through. Do you not feel threatened or anxious at all?\"</p>\n<p>Marie shrugged and responded casually, \"Well it's going to happen to me too, eventually, right? I am fated with The Heavenly Eye, after all.\"</p>\n<p>Krish narrowed his eyes suspiciously before releasing a mirthful snort, \"I don't know whether it is a good or bad thing that you're starting to become more and more like me.\"</p>\n<p>Marie's face froze in disbelief, \"Damn it, I am, aren't I? When did this happen?\"</p>\n<p>\"It's an unfortunate side-effect of future sight, I'm afraid. When you know that things are about to happen, or have an idea that certain events will transpire, you tend to lose the motivation or urge to perform. It doesn't help that we have to constantly live on the edge, not knowing whether our actions will modulate the predetermined flow of events and come back to bite us,\" Krish explained.</p>\n<p>\"Does it only get worse? I mean, if I'm like this after learning Divination which only shows me the Transients, what will happen to me after I can observe the Constants?\" Marie probed worriedly.</p>\n<p>\"You will eventually start feeling detached from others,\" Krish answered honestly. \"You may have already noticed it happening now. While in the beginning, you had the urge to help after foreseeing negative events transpire, nowadays, you probably think twice about it. You question whether your interference is necessary or if it is better to just let them suffer through this one negative experience so that they can grow as people.\"</p>\n<p>\"That's... not good,\" Marie muttered.</p>\n<p>\"Ironic that the thing that you sought to keep your family safer is causing you to feel more detached from them,\" Krish commented.</p>\n<p>\"I won't let that happen,\" Marie responded resolutely. \"I will never- NEVER- let that happen!\"</p>\n<p>Krish revealed a sly smirk and egged the girl further, \"You don't know-\"</p>\n<p>\"NEVER!\" The cry was firm and unbending. It had the robustness of an Elder Tree capable of weathering the storms of time. Krish would have commended the girl, and felt proud even for having such a strong-headed and bold Disciple. Yet, he could not do so. How could he, when her words were literally, once again, changing the flow of fate?!</p>\n<p>'Troublesome,' he thought to himself. While he empathised with his dearest Disciple, the change she was attempting was too wild. She had no control over the waves of fate - proper control not just observing it as she was now. There would be unbound consequences to her actions, and he couldn't let that happen. Not yet. Not while he was still alive, anyways.</p>\n<p>\"Enough!\" Krish boomed. His voice was a whisper, but it echoed across the room - he had used both the wind and the mana to propagate it. \"I was only messing around with you.\"</p>\n<p>The girl's tenacious frown softened, before mellowing out completely. She shot a cautious look at Krish, and revealed a half-hearted smile. </p>\n<p>\"In truth, I am a little antsy about my stagnant cultivation. There were very few references I could use to improve my cultivation without having to resort to trial and error, which I know that you expressly forbade,\" Marie confessed. \"I guess I just trusted that you would tell me when it was my time.\"</p>\n<p>\"I appreciate that our relationship has reached that point,\" Krish said with a fulfilled smile. \"In fact, I was waiting for the right time. I did not want to disconnect you from Guy while he was still here. He should now begin the process of securing funding and hashing out the logistics to support the True World Sect, therefore he won't have much time to teach you anything. So, it is a perfect time for us to ramp up our progress.\"</p>\n<p>\"What will I be learning, Master?\" Marie asked as she sat up straight in preparation.</p>\n<p>\"Prior to that, let me explain to you what I was doing as you came in,\" Krish answered. \"Lined within the walls, in and around the cottage, is an extremely intricate ritual formation. Its purpose is to isolate the space within from the world.\"</p>\n<p>\"Is it some kind of noise cancellation formation?\" Marie surmised.</p>\n<p>\"Everything,\" Krish corrected. \"Once active, we, for all intents and purposes, will become isolated from the world outside.\"</p>\n<p>\"Oh! So it's like an alternate plane, a pocket dimension?\" Marie hypothesised.</p>\n<p>\"Something like that. It uses the same principles that underly the pocket dimensions dubbed inheritance grounds,\" Krish expounded. He then placed one palm flat over another. \"Prior to activation, we live in this lower dimension-\" he said while waving the lower palm. \"The moment the formation gets activated, the region within its boundary enters the above plane which we can refer to as an upper dimension. No sentient being can enter this upper dimension - only exit - while it remains active.\"</p>\n<p>\"That sounds extremely complicated. You lost me with this whole lower and upper analogy,\" Marie grumbled. \"Can you repeat it again, but slower.\"</p>\n<p>\"Don't bother. It isn't time yet for you to learn its mechanisms. Your actual purpose in entering here is to attune your body to become one with the waves of fate,\" Krish redirected.</p>\n<p>\"Why is that necessary, can't I already perform divinations by deciphering these waves?\"</p>\n<p>\"That's all you can do for the moment - just see what's happening. Don't you want to be able to implement changes to the natural sequence? That is the eventual outcome after becoming one with the waves of fate. Sequentially, after you unify with the waves, you will work towards forming your Heavenly Eye. Once that is active, you will move one step closer to altering the waves around you without having to draw them into you,\" Krish continued.</p>\n<p>Marie nodded along attentively, \"This process of attuning my body, what does it involve? Will I be ingesting potions of different kinds? Will it hurt? Will this take a lot of time?\"</p>\n<p>Krish raised his right palm to stop the gregarious girl in her tracks, \"No, maybe, yes, in that order. Before we begin-\" He ejected a pulse of mana causing the atmosphere to ripple, as the ritual formation activated effortlessly.</p>\n<p>\"I must warn you that whatever I am about to teach you can not, must not, ever, EVER-\" he exhaled loudly to calm his agitation. \"I cannot stress this enough, girl. What we are about to do here MUST NEVER BE PRACTISED OUTSIDE! No matter if it was unintentional, if you blurt out a single detail, even I cannot help you avert the wrath of the universe. Heck, I fear it may cause the whole of Gaea to fall into ruin spectacularly!\"</p>\n<p>\"That sounds scary, maybe we shouldn't be doing this,\" Marie said apprehensively.</p>\n<p>\"There is no other way. And no, it's not for the lack of trying,\" Krish denied.</p>\n<p>\"Why is it so dangerous anyway?\"</p>\n<p>\"It's because we will be dabbling with something that has long become extinct from this world. This means that it should not exist - it cannot exist, since its time has already passed. If we interfere with this and by some misstep cause it to resurface, it will irrevocably shift the natural sequence of events,\" Krish answered.</p>\n<p>Krish paused to let his warning sink in. He noticed his Disciple's face cycling from anxiety to assuredness, and back again. It would be amusing were the circumstances any different.</p>\n<p>\"The way to attune the body is by altering the laws that govern it. Selected beings that are fated with the Heavenly Eye can observe the waves of fate, that much is established. But to become one with it, we have to alter the natural laws that define our biological and magical limits placed upon us. After all, nothing is more raw and close to the basis of the way this world works than fate, it shouldn't be possible for higher-order beings such as us to become unified with it. This means that we need to bend these natural laws to our will. According to Guy, this can be achieved through magic, which is a lie we tell the world using mana as a medium since it can interact with everything. We can formalise these lies using diagrammatic representations, such as spell circles. Guy has optimised this and created his Modular Spellmaking method. Now tell me, what is another way to formalise these 'lies' to the world?\"</p>\n<p>\"By that, you must be referring to the ways people cast spells,\" Marie inferred. \"If we discount spell circles, then what remains would be chanting, right?\"</p>\n<p>\"Bingo! But chanting-based spells and magics are usually predetermined. There is little advancement made in developing new spells or magics. Most efforts result in either truncating sections of older chants or shortening them. For our use, we will need to formulate longer phrases, or more elaborate lies that are so close to the truth that it becomes impossible to differentiate between them,\" Krish continued.</p>\n<p>\"How would that be possible? In order to do that we will need to be proficient in Ancient Tongue. But Ancient Tongue is-\" Marie halted in her tracks. Her eyes started to widen in shock as a realisation dawned upon her. \"No...\"</p>\n<p>Krish smirked at the girl's vocalised disbelief.</p>\n<p>\"That's right,\" he confirmed. \"We will be learning how to converse using Ancient Tongue.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/vk25v1fontk397opj6gyndp\">Chapter 204 - Ancient Tongue</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/yj44qre1rma1wbkn4eg4rv3\">Chapter 202 - Covering all of the Bases</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}