{"pageProps":{"note":{"id":"nxunojxi7vcjodd3ci7v0n0","title":"Chapter 308 - Digging Out a Remnant From the Past","desc":"","updated":1683496031142,"created":1679894013380,"custom":{},"fname":"volume-5.chapter-308","type":"note","vault":{"fsPath":"vault"},"contentHash":"cc51d1353a549285fc9f0919af679382","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-308","id":"nxunojxi7vcjodd3ci7v0n0","vaultName":"vault"},"value":"volume-5.chapter-309","position":{"start":{"line":83,"column":3,"offset":11107},"end":{"line":83,"column":27,"offset":11131},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-309"}},{"from":{"fname":"volume-5.chapter-307","id":"rkka5xwk2tz7hvhtcu87ee6","vaultName":"vault"},"type":"backlink","position":{"start":{"line":79,"column":3,"offset":10999},"end":{"line":79,"column":27,"offset":11023},"indent":[]},"value":"volume-5.chapter-308"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-308---digging-out-a-remnant-from-the-past\">Chapter 308 - Digging Out a Remnant From the Past<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-308---digging-out-a-remnant-from-the-past\"></a></h1>\n<p>Shuri realised that her fears concerning the True World Sect were warranted. It was a metaphorical drug house of temptations tailored to Shuri's subconscious desires. Every time she tried to get out of the alluring path, she would be teased with the sweet nectar and drawn back in. It was frustrating to say the least, since her rationality had to constantly fight with her subconscious from getting drawn in by the bait hanging in front of her. Unfortunately, till now, all her attempts had led to failure. Shuri had never experienced so many continuous setbacks in her entire life!</p>\n<p>\"Back to the matter at hand though...\"</p>\n<p>She suspected that this whole \"Innovator Track\" nonsense was just another one of those baits meant to reign her in and control her. This was their strategy, after all. Shuri noted that every time she stumbled into a trap, it was of her own volition. She was offered a choice, and each time the logically better choice would draw her deeper into the trap. It was like playing chess against an opponent who already knew the ending and was cornering her towards that configuration with every step... Much like when she competed with Marie...</p>\n<p>A tired sigh escaped Shuri's lips as she collapsed into her bed. As there were very few people in the Sect, all new members had the luxury of sleeping in their own rooms. Of course, this could only be enjoyed until more members joined the sect. Shuri wasn't certain if she would remain here for that long. The way things were going, she pondered if she may have to bring forward her liberation date.</p>\n<p>Shuri closed her eyes and tried to get some rest, but sleep eluded her. Fed up with rolling about ceaselessly, she bolted up from her bed and began pacing around her room, lost in thought. However, her mind was too agitated to focus on a single coherent line of thought.</p>\n<p>Exasperated, she pulled out the chair from under her study table and collapsed onto it. She rested her head against the top of the chair and rolled it around in boredom.</p>\n<p>Unable to contain her thoughts, Shuri voiced her frustration, \"What do I do?\" </p>\n<p>She covered her face with both her palms and rubbed it vigorously, moving up and down whilst tussling with her hair as well. Her left hand then moved subconsciously towards the eerie pendant which hung from her neck and fiddled with it. Shuri's eyes were unfocused and looked around the room lazily. At that moment, as her pupils scampered over the empty walls, they hovered over the cloth bag Shuri brought with her.</p>\n<p>Shuri bit her lips as her wandering thoughts focused on something. With cautious steps, she approached the cloth bag and pulled out a bundle from within. Untying the ropes that bound it revealed a stack of books.</p>\n<p>\"Guide to Cross-Stitching for Single Men.\"</p>\n<p>\"Ten Easy Ways to Cook Common Tilapia.\"</p>\n<p>\"Six-Hundred and Sixty-Nine Jokes from the East.\"</p>\n<p>While suppressing a smirk, Shuri carefully opened the first book. She skimmed past the first six pages before another domineeringly large calligraphy jumped out.</p>\n<p>\"Golems, Automatons, and Magborgs.\"</p>\n<p>She'd read this book before. In fact, she'd read the other two as well: \"Farming Blank Mana Cores.\" and \"Core Forging.\"</p>\n<p>This was all that remained of the Yoruz Clan's most coveted and equally despised magical arts.</p>\n<p>No one likes necromancy. It is the process of splitting one's soul into small segments and inhabiting corpses, kind of like creating your own tamed beast. People don't like it primarily because the process tends to desecrate the bodies of the dead, which is generally seen as \"morally corrupt\". But the truth behind the hatred of this practice is that the cultivation method is a force multiplier. One can essentially create endless bodies as swords and shields to carry out their will without having to step foot onto the battlefield. Of course, doing so for a long time period can be damaging to the caster's soul, which is often why necromancers tend to go off their rocker and become a force for destruction.</p>\n<p>The Yoruz Clan did not practise necromancy, but their cultivation method toed that line. It was a force multiplier but without the downside of being \"morally corrupt\". Instead of splitting souls, the process called for the creation of multiple wills: golems or automatons. These contraptions had a predetermined purpose in life. Unlike reanimated corpses, they weren't soul bound to their creator, but as a result, there was no backlash from their destruction. Furthermore, unlike reanimated corpses, these manifestations of will could not grow stronger like an average mage since they lacked spirituality. However, they could be made strong from the very beginning as long as the blank mana core going into creating them was of a certain level.</p>\n<p>Ultimately, these contraptions were the perfect tools as they pursued their programmed task with persistence and efficiency unachievable by a sentient being. They excelled in groups, as long as their programming matched, and functioned seamlessly in any condition, provided that they were built with suitable materials. They did not fear or tire, nor did they have ambition. Their job was their life and their life was their job.</p>\n<p>Shuri ran her fingertips over the yellowed pages that had started to succumb to their age. This was all that remained of the clan her dearest mother fared from. These books, at first glance, contained cursory references about the many contraptions a Yoruz mage could unleash into the world and offered nothing deeper beyond that. However, for someone versed in the Clan's secret cypher, they would find a whole other book hidden within these pages.</p>\n<p>\"No one must ever know of these! Learn from them. Master them. Use them to survive,\" Her mother told her once as she stuffed them into her hands. It was a time when she still had a strand of sanity left. Shuri didn't like remembering those times. She would rather remember her mother as a desiccated, hateful, mad woman - it made sorting out her emotions that much easier.</p>\n<p>Shuri had already deciphered and memorised all of these books. At one point she even tried to secretly cultivate using the method. Unfortunately, she could not resonate with it. She couldn't even properly resonate with the Sol Clan's domineering Burning Sun Method. She understood it well, but she could not accept it at a psychological level. Maybe it was the subconscious hatred for anything to do with her lineage, be it her mother or her father. Or maybe it was something else - something deeper.</p>\n<p>She flipped through the pages, scanning the words with a dreary gaze. There was little enjoyment in rereading when the first reading still remained fresh in her mind. But it offered sufficient distraction to distract her from her thoughts.</p>\n<p>\"Wisps and slimes are, on paper, one of the most useless creatures in existence. They lack offensive and defensive capabilities and are weak to even the most basic attacks for the simple fact that their body is incapable of protecting their weakest point - their core. This brings us to the second point: a dead wisp and slime are, on paper, one of the most useful creatures in existence...\"</p>\n<p>\"...Wisps and slimes form when the concentration of mana in a particular region rises above a certain limit. Additionally, if the environment is dark, closed and pressurised, the conditions are perfect for the spawning of these creatures. Interestingly, the birth of wisps and slimes follows a drastic drop of mana concentration in the surrounding region as the spawning essentially creates a mana sink.\"</p>\n<p>Shuri lowered the book and started to mutter out loud, \"Mana sink... mana sink... mana sink...\"</p>\n<p>Why did that sound familiar?</p>\n<p>People assume that having an eidetic memory means that memory recollection could be achieved in a pinch. While true, there is a caveat. People tie their emotions with experiences, and sometimes it is true with knowledge as well. The knowledge that is ingrained and abstracted is separate from the experiences under which it was gained, but knowledge which is raw and memorised is often tethered to the instance where it took place. Shuri's mind could remember even the tiniest of details in passing, given that she could first recollect the macro-specifics of the passing instance. She could remember the exact shape of a person's toe as long as she could remember the fact that she saw it while playing football with the person that one time. It may sound counterintuitive, but the human mind had limitations.</p>\n<p>She had heard of mana sink before, in passing. However, she could not pinpoint that vague instance. The phrase repeated in her mind until sleep finally pulled her into its inviting embrace. Upon waking up, the process continued to repeat itself.</p>\n<p>On this day, her schedule had shifted. Instead of going to their regular classes, everyone was pulled out for an impromptu session of crafts in the Maker-Space. The session was led by Sect Leader Larks. The goal of the lesson was to weave a basket using wood and wood fibres. Shuri did not understand what the purpose of this exercise was, but she wasn't going to question it. On one hand, she'd rather not willingly paint a target on her back and on the other, the exercise had a strangely calming effect on her.</p>\n<p>The mundane chant of, \"fold, pull, fold, twist, fold, weave...\" kept repeating in her mind and drowned out the droning thoughts on \"mana sink\". Unknowingly, she had already successfully weaved a basket. She looked around, trying to hide her swelling pride, only to see that her peers had completed three within the same timeframe. It seemed that their upbringing had worked to their advantage.</p>\n<p>\"Good job, everyone! Since we're all able to wicker, we will be moving ahead to the next step,\" Sect Leader Larks declared, gesturing with his hands. Markus, Jean, and Marie then entered, each carrying large sacks of materials, followed by Kano and Dora who were carrying a locked wooden crate.</p>\n<p>\"Today is a momentous occasion for everyone since we will be crafting our own magic wand,\" Sect Leader Larks said with a beaming smile as he revealed the contents of the sack. \"A magic wand is made with these two primary materials: Illuminescent Banyan sinews and Menryl wood.\"</p>\n<p>One sack contained branches of varying lengths from the Menryl Tree while the remaining two sacks contained uniform sinews of the Banyan. Sect Leader Larks pulled out a wooden branch and placed it on the lathe machine. With a pull of the lever, the clutch moved the gears in the gearbox into place and completed the mechanical circuit extracting energy from the nearby flowing stream and pushing the lathe into a whirling movement.</p>\n<p>\"How many of you have partaken in the safety courses to operate the lathe?\"</p>\n<p>Shuri raised her hand with a handful of others.</p>\n<p>\"Those with their hands raised will be tasked with turning one for yourself and two more for your peers without safety certifications,\" Sect Leader Larks commanded after counting out the student. He then put on a transparent mask over his eyes.</p>\n<p>\"Glasses on for safety!\"</p>\n<p>Following that declaration, he got straight to work.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/jrr2hwauiw7cyb8kh3fz5x4\">Chapter 309 - Build Your Own Wand</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/rkka5xwk2tz7hvhtcu87ee6\">Chapter 307 - Innovator Track</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}