{"pageProps":{"note":{"id":"ohq8x61g9bv36g1cb6nj4el","title":"Chapter 298 - (Interlude) Getting Used to Loss","desc":"","updated":1679654008917,"created":1678001111410,"custom":{},"fname":"volume-4.chapter-298","type":"note","vault":{"fsPath":"vault"},"contentHash":"f8a76fdee8bc5bd214fc25074085bd82","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-298","id":"ohq8x61g9bv36g1cb6nj4el","vaultName":"vault"},"value":"volume-4.chapter-299","position":{"start":{"line":81,"column":3,"offset":11045},"end":{"line":81,"column":27,"offset":11069},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-299"}},{"from":{"fname":"volume-4.chapter-297","id":"w74owg9j0wsudvwknktolzh","vaultName":"vault"},"type":"backlink","position":{"start":{"line":83,"column":3,"offset":9675},"end":{"line":83,"column":27,"offset":9699},"indent":[]},"value":"volume-4.chapter-298"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-298---interlude-getting-used-to-loss\">Chapter 298 - (Interlude) Getting Used to Loss<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-298---interlude-getting-used-to-loss\"></a></h1>\n<p>Jean never thought she would miss the din within her mind-space. With the complete absorption of all of her counterparts, her messy thoughts had grown... centred. There were no more voices in her thoughts except her own. No arguments. No urgent calls for violence against herself or those around her. No constant outpouring of praises and annoyingly uplifting, naive words of encouragement. Just... silence...</p>\n<p>And it was depressing.</p>\n<p>There were people around her who cared for her and wished well for her, sincerely. Mister Larks, Dora, and Kili. They all offered her emotional support. But it just wasn't... enough to fill that strange emptiness in her heart. She felt the same when she lost her mother. Made sense. Josie WAS almost like a mother to Jean, even if her attendant kept calling herself a slave.</p>\n<p>Speaking of emotions. She never thought she would be able to experience them again. Though it was unfortunate that the first set of emotions she was forced to experience was so dour and sorrowful. But she couldn't show these emotions outwardly. She still had to do her job; she still had to heal. She was already far too young that adults apprehensively trusted her medical skills. If she carried a depressed aura with her, she would further dissuade them from seeking treatment from her.</p>\n<p>How much of her current trajectory was affected by her solemn vow? She did not know. And frankly, she did not care. Healing others offered a fitting distraction. After her advancement, a fact she didn't even get the opportunity to properly celebrate, the process of treating illnesses such as this particular virus became markedly easier.</p>\n<p>If her immune system could combat the disease, then her body could create the required antibodies for it. These antibodies were now being catalogued inside Jean's core rather than her lymphatic system. Jean's mana could now take on the property of the antibody already catalogued in her core and could be freely controlled and channelled to where she needed it to be. Through artificial stimulation, she could then train the immune system of the recipient (as long as they were willing) to adapt the antibody for its own purposes. This ability formed through the incompatible mixture of Kili's Universal Panacea Physique and the Rat King's disease-centric cultivation.</p>\n<p>On a side note, this came as a blessing in disguise. Jean could now go about curing this sequestered region without exposing Kili's existence to the world. Unless people really bothered to dig deeper into the events regarding the mortal folk's treatment, which Jean suspected wouldn't be the case, they wouldn't know that in fact, the first few patients cured were through her new little nurse's blood. But no, all the Empire really cared about was the fact that a beast with powers eerily similar to the Plague Emperor spawned within the sacred grounds of the Solar Empire! Jean had heard the news of a large-scale inquiry on this matter in the works, but no one bearing the Crown's orders had stepped foot in the area for days. It was all a smokescreen - a ruse. After all, the Empire needed someone to take the blame to distract the peasant folk. The Plague Emperor was just the right type of convenient boogeyman they needed to take the fall for their callous disregard for human life. And the peasant folk? Well, what could they do even if they knew that they were being manipulated?</p>\n<p>At the end of the day, the problem was nipped in the bud. It was barely a beast at the threshold of the Core Formation realm, and the only true loss was a squadron of trained soldiers conscripted with the Galen Duchy, and maybe a year's worth of revenue through trade in this region. To truly register as a threat to the Empire, the beast had to at least be in the Core Condensation Realm and threaten to dismantle a seat of power. Or, the loss should include the life of a scion from a storeyed clan or sect.</p>\n<p>It was all so bleak. Jean was disgusted and enraged. But what could she do? Threaten to dismantle an institution that has lasted for at least half a millennium?</p>\n<p>After all, her oaths did say: \"I will prevent disease whenever I can, for prevention is preferable to cure.\"</p>\n<p>If she could dethrone the Sol Clan and implement a far more humane administration, it would all become better. A dangerous thought. One that Jean was quick to dismiss.</p>\n<p>\"At what cost?\"</p>\n<p>Her oaths began with: \"I will first do no harm.\"</p>\n<p>To gain power, something must be lost. Jean did gain power. The power to heal. What did she lose? The power to fight for those that needed her. Did she regret it?</p>\n<p>She didn't disparage Mister Larks for what he had done for her. The gift - the oath - had saved her. The alternative would have been much worse, and many more would have suffered for it. To be essentially de-clawed and incapable of taking a life had ensured that Jean wouldn't walk down a path she would later regret. All the sincere smiles, the warm welcome, and the uplifting atmosphere that came with helping people were reward enough. Besides, fighting didn't necessarily mean picking up arms and storming a castle with an army.</p>\n<p>Jean leaned over and looked into the well before her. She had returned to the very first town she visited with Josie upon entering the quarantine. The burnt bodies had been removed. No rats either. The villagers were slowly returning to their homes, though there was a melancholy air about it. A lot of relatives, neighbours, friends and family were lost due to the disease. There were a lot of bitter memories here. A lot of horrific images were deeply ingrained into the minds of these folk too.</p>\n<p>There was trauma engraved within these folk. However, she couldn't heal the mind, not yet at least. Besides, she had only just herself healed through a harrowing psychological experience, who was she to attempt and heal these people?</p>\n<p>What she could do, was ensure that their lives hereafter would be devoid of sickness. Mortal folk suffered through an assortment of illnesses in their lifetimes - they lack the hardy immunity of mages after all. Most, if not all, of these diseases, could be treated. But as it was said: \"prevention is preferable to cure\".</p>\n<p>\"And prevent, I will,\" Jean circulated the replenished mana coursing through her core. She decided to test an interesting idea, which she had instinctively applied during post-advancement when trying to save Josie. Using the knowledge obtained through the cultivation of the Rat King, she instilled viral behaviour into her mana particles. These viruses born of her were completely subservient to her. There was little danger of them going out of control and doing something untoward since Jean was spiritually unable to do it herself.</p>\n<p>Nonetheless, what Jean was aiming to create here was an anti-autoimmune disease. The purpose of this disease was to hijack the lymphatic system to actively combat common and preventable diseases that have a high mortality rate. If all goes well, this \"disease\" would proliferate here and improve the overall health of the people of these parts and quite possibly spread outwards.</p>\n<p>Jean noticed that the mana cost to performance was steeper the more diseases she programmed into her virus. The cost also varied based on the complexity of the diseases she wished her virus to combat. The mode of transmission of her virus also became costlier the more resilient she made it. All in all, she could only install combat strategies against 13 illnesses, of which 2 were highly complex such as pneumonia (which tends to have a range of causes), and decided to limit transmission from person to person through liquid as a medium.</p>\n<p>In the end, Jean managed to secrete a concentrated droplet of mana from the tip of her right index finger that dripped into the well and dissolved into the dark waters. The whole process had drained her almost completely, leaving her at the cusp of mana exhaustion.</p>\n<p>Thankfully, she had Kili to assist her back. The girl was a diligent assistant - eager to learn, and quick to pick up new things. Jean used Mister Larks' teaching methods to bring the girl up to speed with her letters and numbers, and she assimilated them very quickly. She then moved on to reading books (and comics contributed by Dora). In her free time, she would help Jean in healing people and learning the basics of triage and emergency treatment. These activities would keep the two girls, Jean and Kili, busy and distracted, and would stop the two from dwelling on their losses.</p>\n<p>The duo arrived at the last remaining tent from the previous triage set-up, which also happened to be Jean's personal research station. Pushing aside the tent flap, Jean staggered in with an exhausted sigh.</p>\n<p>At that moment, she noticed an intruder. It was a large man, with his back turned towards her.</p>\n<p>\"This is Josie's, isn't it?\" The man spoke with a sorrowful voice as he carefully handled the roughshod journal that had the appearance of having survived multiple wars, three natural disasters, and an unfortunate burning incident of some kind. \"I remember this one. She always carried it with her. Said that it was the very first present Nyla ever gave her. It ran out of pages within a year, but she never threw it away. Kept adding more pages into it and scrunched up her handwriting to a point where only a mage with impeccable vision could read it.\"</p>\n<p>He then chuckled with a nostalgic intonation and added, \"She nearly killed me when I accidentally-\"</p>\n<p>His words were interrupted as Jean rushed forward and hugged her father by his waist.</p>\n<p>\"It's not your fault,\" Goran said while placing his palm on the back of Jean's head.</p>\n<p>\"I know,\" a muffled, sorrowful moan escaped from Jean. \"But it still hurts... So. Much!\"</p>\n<p>Jean descended into a full-blown wail within her father's warm and assuring embrace.</p>\n<p>\"It's all going to be okay,\" Goran repeated as he rubbed Jean's shuddering back as his own tears drowned his sight. He didn't believe Guy when the man said that Jean could express her feelings openly again. He never thought he would see his daughter emote again in her life! His greatest regret had been agreeing to that operation that robbed his daughter of her smile. He still wouldn't forgive himself even though Jean had returned to her past self, but at least now he would be assured in death knowing that his daughter would live an uncaged life.</p>\n<p>\"It's all going to be okay,\" he hummed as he exhaled in relief. \"We will be holding a funeral.\"</p>\n<p>\"I want her to be buried near Mother,\" Jean stated firmly.</p>\n<p>\"I agree,\" Goran affirmed. \"I will assign another protector-\"</p>\n<p>\"No,\" Jean denied as she extricated herself from her hug. She rubbed the tears from her face and looked up at her father with a gentle smile. \"I don't need one any more.\"</p>\n<p>With that, Jean pulsed out her mana, saturating her mana domain. At this moment, Goran finally noticed his daughter's cultivation realm. \"You... You broke through?\"</p>\n<p>A hearty laugh echoed within and without the tent, taking with it all the anguish that remained in Goran's heart.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/gk5vdd2in3bfckusic2ve0b\">Chapter 299 - (Interlude) Blindspots in Omniscience</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/w74owg9j0wsudvwknktolzh\">Chapter 297 - Parting Shot</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}