{"pageProps":{"note":{"id":"okV8GIQk9UYlBOtrZl1VR","title":"Chapter 099 - Prowling for Some Petals","desc":"","updated":1643657088253,"created":1643653970710,"custom":{},"fname":"volume-2.chapter-099","type":"note","vault":{"fsPath":"vault"},"contentHash":"e61379606bceccda528bed5d700e6f2d","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-099","id":"okV8GIQk9UYlBOtrZl1VR","vaultName":"vault"},"value":"volume-2.chapter-100","position":{"start":{"line":175,"column":3,"offset":11926},"end":{"line":175,"column":27,"offset":11950},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-100"}},{"from":{"fname":"volume-2.chapter-098","id":"YXtOGS0uN4njgdEPjZMQw","vaultName":"vault"},"type":"backlink","position":{"start":{"line":161,"column":3,"offset":12906},"end":{"line":161,"column":27,"offset":12930},"indent":[]},"value":"volume-2.chapter-099"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-099---prowling-for-some-petals\">Chapter 099 - Prowling for Some Petals<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-099---prowling-for-some-petals\"></a></h1>\n<p>\"The wheels on the cart go round and round, round and round, round and round. The wheels on the carriage go round and round, all day long!\"</p>\n<p>\"The hooves of the horse go \"Clop! Clop! Clop!\", \"Clop! Clop! Clop!\", \"Clop! Clop! Clop!\". The hooves of the horse go \"Clop! Clop! Clop!\", all day long!\"</p>\n<p>A melodious voice pierced through the eerie silence of the dark forest. Tiny animals all moved out from their hiding places and retreated further into the shadows as the thundering skips of the little girl navigated through the claustrophobic woods.</p>\n<p>Interestingly, the little girl didn't seem the least bit perturbed or unnerved by the growing eeriness and the unwitting threat that arose from exploring the unknown. Because this wasn't the first time Dora had made such a hazardous expedition into the forest, and it most likely wouldn't be her last.</p>\n<p>One must wonder, what was such an innocent and lovely little girl doing so deep in these necks of the woods? It was to search for different varieties of flowers of course! Having sourced a plethora of different daisies, roses, lotuses, lilies and tulips, Dora was out on the prowl for some wildflowers! The kind that grew in the most precarious of places.</p>\n<p>\"Humpty Dumpty sat on a wall. Humpty Dumpty had a great fall. All the King's horses and all the King's men, couldn't put Humpty together again!\" The girl yelped excitedly.</p>\n<p>\"Hmmm... Was Humpty the King? And how can you put someone back together again? Does it mean to heal him?\" The girl muttered with a pout as she skipped over a fallen trunk.</p>\n<p>\"Now! Last time I went...\" She inspected the trunk for any marks and noticed a few faded lines that seemed to have been scratched on by a rock.</p>\n<p>\"...that way! So let's go this way today!\" With a direction in mind, Dora resumed her bouncy skips while humming out tunes from the different rhymes Teacher Larks had taught her.</p>\n<p>It had been less than a week since her first personal lesson with Teacher Larks, and for the past few classes, all she and Teacher Larks had been doing was practising this freaky set of stretching exercises called Yoga.</p>\n<p>Dora's cheeks flushed in embarrassment as she recollected the event which transpired when she first attempted the Downward Dog Pose! That goodness Teacher Larks took the blame in her stead, otherwise, she would have been so ashamed to show her face in front of Big Brother Markus and Medium Sis Jean.</p>\n<p>Oh, right! Now that Dora had another elder sister, she had to come up with a new way to address this person. Dora already had a Big Sis - Marie - so she couldn't refer to her with that title, otherwise, it would confuse everyone. The only logical solution turned out to be Medium Sis since Jean was younger than Marie, yet elder to Dora.</p>\n<p>Dora really liked Medium Sis. She wasn't as talkative as Big Sis, but she would help Dora out a lot, especially when it came to selecting the right flowers. One time, Dora accidentally grabbed onto an Itching Lily and squirted the juice from its stem all over her hands and face. Thankfully Medium Sis was close-by and soothed the itching by using a powder made from the petals of the flower itself. After that day, Dora would often consult Medium Sis about different flowers she would find.</p>\n<p>Sometimes, Dora would ponder if it would be cool to take Medium Sis to Fancy's Garden...</p>\n<p>\"I should ask Fancy's permission first,\" Dora muttered to herself.</p>\n<p>Anyways, thanks to learning Yoga with Teacher Larks, Dora was experiencing certain changes in the way her mind worked. Although she wasn't mature enough to recognise the exact magnitude of these changes, she was perceptive enough to notice them.</p>\n<p>First, Dora could now voluntarily tune out and tune into the multitude of voices and sounds echoing around her. By focusing her mind on her breath, and the physical movement of her chest, Dora could filter out the different sounds assaulting her senses and incrementally negate their effects. It was an arduous process and required her to maintain her focus. However, according to Teacher Larks, it would become easier the more she practised it.</p>\n<p>Dora snapped her fingers and halted in place as she remembered something. She closed her eyes and started to take long and measured breaths to calm her quick heartbeats. </p>\n<p>'Inhale... Exhale...' Dora repeated internally. Little by little, the world around her started to grow sharper in her senses.</p>\n<p>\"HUT! TWO! THREE! FOUR! ....Hut! Two! Three! Four!.... hut! two! three! four!.... ...!...!...!...!\" The march of the insects beneath her feet quietened down gradually.</p>\n<p>\"MINE! MINE!... Mine! Mine!... mine! mine!... ...!...!\" The argumentative din of the birds in the tree branches became smothered incrementally.</p>\n<p>\"It stopped!... Smells healthy!... Flank!\"</p>\n<p>\"Huh?!\" Dora snapped out of her meditative state and swivelled her head around.</p>\n<p>\"Stop!... Did it notice?... Move low!\"</p>\n<p>\"Who?-\" Dora squinted her eyes and focused her senses as far as they could see.</p>\n<p>\"Converge slowly!\"</p>\n<p>\"That!\" Dora's eyes finally caught onto an undulating carpet of fur approaching her at a measured pace.</p>\n<p>Without wasting a second of thought, Dora grasped onto the trunk of the tree next to her and started to scramble up expertly. It wasn't her first time monkeying up such precarious trees after all - her search for beautiful flowers had carried her to even more dangerous heights.</p>\n<p>\"Quick! It is getting away!!!\" The low carpet of fur rose with a jerk, revealing rows of massive fangs capable of tearing through flesh and tendons, and crushing bones, and two predatory eyes that locked onto Dora's rising back.</p>\n<p>BARK! ROAR! BARK!</p>\n<p>Four more canines rose from equally spaced angles surrounding Dora's tree and converged towards her with massive leaps.</p>\n<p>\"Wolves!\" Dora exclaimed in surprise as she found a foothold at a split in the trunk sufficiently high so that the beasts below couldn't reach her.</p>\n<p>\"Get down here! Catch her! Jump!\" Five massive canines lead by a physically larger mutt bellowed towards her hungrily while each tried their best to leap towards her.</p>\n<p>Dora sighed in relief that she had taken the time to temper her mind, otherwise she feared that she would have missed these five killers stalking her. Internally, she thanked Teacher Larks a hundred times.</p>\n<p>The hungry carnivores didn't seem willing to let go of her just yet. The leader of the pack place its front legs over one of its comrades and started to reach higher by moving its hind legs on top. Fortunately, the subordinate collapsed under the added weight of the bulkier alpha, causing the mounted canine to fall unceremoniously.</p>\n<p>The splayed alpha snapped and condemned the failure of a subordinate and called on to the next member.</p>\n<p>\"Sit on your belly! You, sit on top of him! I will stand on top of your two and jump!\"</p>\n<p>Dora grew increasingly concerned at this outcome as the alpha was showing the capacity for complex thoughts and intelligence. Fancy had told her about such cases, and it was a clear sign that beast was about to evolve into a magical creature. Fancy had taught Dora the arcane process by which this change took place, but Dora couldn't recollect the exact details.</p>\n<p>Panicking, Dora started to scream at the top of her lungs, \"Fancy! Help!\"</p>\n<p>Her voice was immediately drowned out by the barks of the wolves underneath her. At this point, Dora was starting to get scared.</p>\n<p>\"Fancy! Please! Help!\" She tried again.</p>\n<p>However this time, the alpha beneath leapt up and snapped its maw shut, barely inches away from where her foot lay.</p>\n<p>\"Aaah!\" Dora shrieked as she retreated her appendage and tried to scramble higher up the tree. However, the trunk wasn't as segmented as the ones near the periphery of the forest. She couldn't reach higher!</p>\n<p>\"Fancy!\" Dora screamed again, tears brewing from her eyes and rolling down her scarlet cheeks.</p>\n<p>The alpha jumped again! This time, it managed to grasp at the hem of her skirt tearing off a small chunk.</p>\n<p>\"Aaah! FANCY!!!\"</p>\n<p>WOOOSH!</p>\n<p>A pleasant gust of wind, washed in a translucent coat of white, swept over the section of the forest. The flowing powdery smog barely rose above the ground level.</p>\n<p>The wolves snarling beneath the tree inhaled the powder and sneezed vehemently.</p>\n<p>One by one, the canines started to collapse like ragdolls.</p>\n<p>The bulky alpha was last to submit. It held out for as long as it could, trying to power through the drowsy feeling creeping over it that started from its spine. But ultimately, it was still too weak. It felt weak. It fell... asleep.</p>\n<p>Seeing the hungry beasts collapse, Dora released a sigh of relief amidst her tear-filled hiccups.</p>\n<p>\"Fancy! Hic! You came!\" Dora started to descend, however, she was stopped. \"Don't come down yet!\"</p>\n<p>\"Huh? Why not?\"</p>\n<p>Right as she asked, the wind picked up once again, and the powdery residues peppering the area were picked up and displaced. After a short minute, an elegant and vibrant insect fluttered from amidst the weaving treeline and settled atop the literal dog pile.</p>\n<p>\"You can come down now!\"</p>\n<p>\"Hic! Okay!\" The girl uttered and started to cautiously lower herself. After gaining firm footing on the forest floor, the girl rushed over to the insect and wept in relief.</p>\n<p>\"Huunn! Hic! Fancy! I was so scared....\"</p>\n<p>\"Then why are you in this part of the woods again? I told you to be careful!\" The insect reprimanded.</p>\n<p>\"B-But I came here searching for flowers for you,\" The girl reasoned as she rubbed her cheeks with her cuffs.</p>\n<p>\"<em>sigh</em> I have enough. You should stop getting into trouble, Dora,\" The insect said as she landed on top of the girl's head.</p>\n<p>\"Now go back. I will take care of this mess,\" The insect instructed.</p>\n<p>\"W-Wait! What are you going to do to them?\" The girl retorted with a cautious frown.</p>\n<p>\"I'm going to get rid of them.\"</p>\n<p>\"Don't... kill them,\" Dora pleaded in a low voice.</p>\n<p>The insect's wings fluttered in amusement, \"Why not? They tried to kill you.\"</p>\n<p>\"But they were just following their instincts. They were hungry, and I was-\" the girl smiled wryly and continued, \"-food.\"</p>\n<p>\"Besides! You won't eat them, so why kill them?\" The girl reasoned.</p>\n<p>The insect fluttered in place as though in contemplation, and replied, \"Fine. I'll let them go. But I will warn the big one after it wakes up... just to be safe.\"</p>\n<p>\"Okay!\" Dora smiled. \"Oh! How did you make them fall asleep?\" She asked.</p>\n<p>\"Sleep powder,\" The insect replied as it materialised a small mound of sparkling powder in one of its wings.</p>\n<p>\"Don't come closer!\" Fancy warned as Dora subconsciously brought her face closer to inspect the pile.</p>\n<p>\"Can I take some with me? Just for protection?\" Dora asked cautiously.</p>\n<p>After some hesitation, the insect complied seeing as the girl would never truly give up her adventurous spirit.</p>\n<p>Dora immediately reached into her bag and pulled out a phial filled with the itch-treating powder Medium Sis had made for her. She emptied the phial and scooped up a large mound of the sleep powder from Fancy's wings. After carefully closing it shut, Dora retreated the way she came with the same bouncy skip in her steps.</p>\n<p>After the girl was clear of the area, Fancy immediately materialised another kind of powder and splashed it over the sleeping wolves.</p>\n<p>WHIMPER!</p>\n<p>The group yelped as they gained clarity. The alpha staggered up with shaky steps and growled drowsily at the blurry image of a tiny insect.</p>\n<p>\"Who are you!\"</p>\n<p>\"Shut it!\" Fancy snapped back and splashed another powder over the pack.</p>\n<p>The alpha started to contort in pain after in inhaled this powder and squirmed like a worm doused in salt.</p>\n<p>\"Make it stop!\" The animal pleaded.</p>\n<p>\"I will... Just not yet,\" Fancy replied ominously.</p>\n<p>A harmony of whines, howls, whimpers and yelps resounded from the forest and painted the forest in an eery gloom, discouraging any new explorers from stepping in. </p>\n<p>The wailing sounds lasted through the entire night. Stopping only when the first sliver of sunlight made its way through the canopy and fell on the forest floor.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/nchwfnbotw2rcsib1xn1qas\">Chapter 100 - (Interlude) A Brewing Storm (Part One)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/YXtOGS0uN4njgdEPjZMQw\">Chapter 098 - Dora Reva</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}