{"pageProps":{"note":{"id":"opGtbJ6z7st3FN7Vrzzud","title":"Chapter 106 - Fate's Infuriating Machinations","desc":"","updated":1643657249892,"created":1643656111796,"custom":{},"fname":"volume-2.chapter-106","type":"note","vault":{"fsPath":"vault"},"contentHash":"581217d2388c91982998913ac788dfb9","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-106","id":"opGtbJ6z7st3FN7Vrzzud","vaultName":"vault"},"value":"volume-2.chapter-107","position":{"start":{"line":137,"column":3,"offset":11632},"end":{"line":137,"column":27,"offset":11656},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-107"}},{"from":{"fname":"volume-2.chapter-105","id":"Kqr9Ik4lQwdkRNz0NjjKb","vaultName":"vault"},"type":"backlink","position":{"start":{"line":159,"column":3,"offset":10011},"end":{"line":159,"column":27,"offset":10035},"indent":[]},"value":"volume-2.chapter-106"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-106---fates-infuriating-machinations\">Chapter 106 - Fate's Infuriating Machinations<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-106---fates-infuriating-machinations\"></a></h1>\n<p>\"Pffft!\" Marie burst into laughter upon hearing Krish's declaration.</p>\n<p>\"Hahahaha! Accept you as my Master?\" Marie covered her mouth as he chortled uncontrollably.</p>\n<p>But after a while, Marie realised that Krish's expression hadn't shifted one bit. The man was not joking!</p>\n<p>\"Are you serious?\" Marie coughed out while trying to suppress her mirth.</p>\n<p>Krish hummed and answered nonchalantly, \"Beyond the information I've already provided you lie secrets and insights related to the cultivation method I practice. If you really want to know more, I'm afraid that you'll have to devote yourself to my school of magic.\"</p>\n<p>\"So if I say yes, you would willingly take me on as your Disciple and teach me to cultivate?\"</p>\n<p>\"I would,\" Krish affirmed. \"I would take you under my wing and train you in my school of magic.\"</p>\n<p>\"And which school is that?\"</p>\n<p>\"The Heavenly Eye,\" Krish replied.</p>\n<p>Marie narrowed her eyes as she probed, \"I've never heard of it before.\"</p>\n<p>\"Which schools HAVE you heard of?\" Krish snorted in response.</p>\n<p>\"I've heard of plenty,\" Marie retorted immediately. \"There's \"The Incidiary Fist\", \"The Righteous Sword\", \"The Impenetrable Arts\" and \"The Loquacious Lightning\" schools of magic.\"</p>\n<p>Krish squinted in disbelief before blurting out, \"You just made those up!\"</p>\n<p>\"Whatever! What I implied was that obviously, your school of magic isn't popular seeing as I haven't heard of it before,\" Marie scoffed with a wry expression.</p>\n<p>\"So you're saying that you would readily become my Disciple if my school was more popular?\"</p>\n<p>\"No!\" Marie answered immediately while shaking her head. \"That would be even more suspicious. Why would practitioners from such famous schools of magic want me?\"</p>\n<p>\"Hah! There is no winning with you. Would there ever be a situation in which you wouldn't be sceptical?\"</p>\n<p>Marie clicked her tongue and retorted, \"There wouldn't be a single case in which I wouldn't be suspicious.\"</p>\n<p>She crossed her hands over her chest and expounded, \"The probabilities of such a situation taking place are infinitesimal for me to think otherwise. They are in decimals so small that if such an event did occur it would be pure coincidence. And, I don't trust coincidences. Anything that sounds too good to be true, is in fact too good to be true. There is always a caveat, you just don't see it yet.\"</p>\n<p>\"You say that, yet you willingly accepted Teacher Larks?\" Krish proposed while raising an eyebrow.</p>\n<p>\"That is different. When I sent Markus off to the Academy, it was within my calculation, albeit with a minuscule percentage, that a Teacher would take notice of him and pull him under their personal tutelage. Teacher Larks' arrival here wasn't a coincidence. Given sufficient time, I can trace a clear sequence of dominoes leading up to this situation.\" Marie paused before continuing with a bitter expression, \"Besides, even he isn't willing to teach me magic.\"</p>\n<p>\"That's only because you lack purpose,\" Krish responded nonchalantly.</p>\n<p>\"How did you know that?\" Marie jabbed back with a suspicious glare.</p>\n<p>\"You seem to forget who you're talking to, girl.\"</p>\n<p>\"Well...\" Marie muttered. \"That's all the more reason for me to be suspicious! Why would you be so willing to accept a student that lacks direction?\"</p>\n<p>\"It doesn't matter to me. You are fated with The Heavenly Eye. Ultimately, you are guaranteed to learn under me no matter how hard you try to fight it,\" Krish shrugged out with a cunning smile.</p>\n<p>\"You seem pretty confident about that. Now that you've revealed this information, what's stopping me from avoiding you altogether?\" Marie challenged.</p>\n<p>\"Because that's just how the world works. That's just how humans work. To borrow your earlier analogy, the dominoes have already been set. Knowing that they will fall won't change anything.\"</p>\n<p>Krish smirked as he continued, \"Of course your fate isn't truly set in stone. You can change it, but for that, you will need to be inducted into my school of magic.\"</p>\n<p>Marie snorted in response, \"You know that just now, you sounded exactly like a con-man?\"</p>\n<p>\"It's the truth!\" Krish said offhandedly. \"Anyways. Since you aren't ready to accept me as your Master yet, just return to what you were doing. But before you go, I want to give you one last piece of advice. For free, of course!\"</p>\n<p>\"A person's fate is unavoidable. Therefore, rather than becoming preoccupied with the what, evaluate the why!\" Krish enunciated.</p>\n<p>\"That sounds unnecessarily complicated. What are you even saying?\"</p>\n<p>Krish simply waved his hands and closed his eyes, \"Leave, girl! It's time for my meditation.\"</p>\n<p>Marie stood in place in disbelief at Krish's sudden shift in behaviour. 'Why isn't he following the script?'</p>\n<p>Marie still believed that Krish was trying to con her. Although she believed in his powers of foresight, the whole spiel about fate sounded so preposterous that she was confident it was just Krish's attempt to tempt her through a psychological gambit. She had heard of many such instances when unwitting girls were hoodwinked by hustlers dressed as mage experts with the prospect of learning magic, only to be captured and sold off somewhere else as a slave, or something worse.</p>\n<p>Although, in those stories, the hustlers were usually unparalleled hunks whose appearance alone overpowered the girls' rationalities. But Krish was just so... </p>\n<p>'Old... Maybe this is a new strategy. After all, looking older does evoke greater confidence.'</p>\n<p>People would be more inclined to believe an elderly individual than a younger one, especially when it came to magic. But Marie was certain that she wouldn't be fooled by Krish's appearance. She was prepared to test the man further.</p>\n<p>However, contrary to her expectations, Krish just stopped talking after stating his piece. Either the man was an inexperienced con artist or he was an unparalleled professional in the field who was confident that the \"seedling\" he had planted in her mind would definitely take root and influence her.</p>\n<p>But Marie wasn't having any of it! 'Hmph! He can't fool me!' She told herself as she left the premises of Krish's cottage.</p>\n<p>As she walked away, though, an intrusive thought shot out from the back of her mind. 'What if he was speaking the truth?'</p>\n<p>She shook her head to scrub the thought and continued walking. However, could her rationality allow such a thing?</p>\n<hr>\n<p>Krish exhaled out loud with exhaustion as he observed Marie's retreating figure.</p>\n<p>\"Why her?\" He muttered out loud. \"Of all people... Why her?\" He complained.</p>\n<p>After weeks of inactivity, the auspicious cloud hanging over the village had started growing clearer. Finally, after months of living with uncertainty, Krish was shown who the next torch-bearer for The Heavenly Eye would be.</p>\n<p>Lo and behold, it was Marie Reva.</p>\n<p>At that time Krish couldn't suppress the intense twitch afflicting his right eyelids upon witnessing this.</p>\n<p>\"Should I just not bother and let myself corrode over time?\" He contemplated out loud. In his mind, the prospect of nurturing the belligerent girl was almost equivalent to dying!</p>\n<p>\"Darn my luck!\" Yet there wasn't anything Krish could do about it. Those with an affinity towards The Heavenly Eye were fated individuals. If Krish didn't follow through with what fate had lined up for him, then he would have to suffer the wrath of the Universe. And the Universe never compromised with its retribution.</p>\n<p>Krish started lamentingly at his shrivelled right leg. If there was one thing Krish was proud of during his youth, as a mortal, it was his perfectly sculpted legs. All the women in his family had flawlessly curvaceous legs. The men in his village would line up outside his house every morning, just to get a glimpse of his sisters' legs as they went out to tend to the farm. Many even professed their readiness to die, crushed between those voluptuous thighs.</p>\n<p>As the youngest, and only son, of the family Krish was also gifted with this lineage. However, unlike his sisters, whose legs retained just the perfect amount of fat and muscle to maintain a sensual allure, his legs were prone to rapid muscle hypertrophy even with the minimum amount of exercise.</p>\n<p>His thighs would fill in his trousers, threatening to tear through them at any moment. His calves would bulge out invitingly with each step. The girls in his village would openly fantasize about laying their heads on Krish's muscled lap. Some would even sneak a peak when he bathed in the river nearby!</p>\n<p>The feature Krish was most attached to, and almost arrogant about, were his chiselled legs. And it was the first thing the Universe took away from him after his rampant use of The Heavenly Eye to change his family's fate.</p>\n<p>The Universe was extremely cruel in doling out its punishment. It didn't take away his legs altogether - they were still attached to his body. However, it attacked his right leg with a disease that impaired the mana channels weaving through them. No matter what he tried to do, the disease kept advancing. Every healer he consulted failed to track down a cure for the affliction due to its inherently elusive nature. It was as though the disease itself was sentient.</p>\n<p>Before he knew it, the disease stepped out from the magical realms and began eating away at his physical body. First, he lost all feeling in his legs as the nerve endings were disintegrated. Then, it started to eat away at his muscles, shrivelling the area up over time. Finally, it arrived at his bones, turning them as fragile as glass.</p>\n<p>One healer suggested amputating the leg and regrowing it through alchemical solutions. Seeing as it was the only option left, Krish went with it. He chopped off his husk of a leg and imbibed a regular dosage of highly-concentrated vitality and regeneration potions to regrow the stump.</p>\n<p>Within days, he had successfully regrown his right leg. However, the moment the regeneration effect stopped, the same affliction attacked the new leg, but this time with increased ferocity. While there was a lack of pain the last time, this time the disease didn't hold back in its assault. Krish suffered through an excruciating month that felt like a lifetime, after which he was left with the very same husk of a right leg he sought to cure initially.</p>\n<p>The worst part was that it didn't affect both his legs. Krish still had an intact and working left leg with equal, if not superior, musculature. However, due to its proximity to a shrivelled up mass, it pained Krish even more. Sometimes, Krish wished that the Universe had just taken away both his legs in one fell swoop. At least he wouldn't feel so horrible every day.</p>\n<p>Therefore, there was nothing Krish could do to contend against fate's machinations without accumulating additional damage upon himself. Based on his understanding of the Universe, it wouldn't attack his working leg. No, it could even take away something else he deemed precious.</p>\n<p>Krish subconsciously covered his crotch region in fear as a shiver tingled through his spine.</p>\n<p>\"But the girl is just so... argumentative!\" That was Krish's greatest peeve with his fated Disciple. He had never seen another person so willing to go up in arms about everything. The girl was sceptical about everything; she refused to believe anything at face value. She needed reason and explanation, irrefutable beyond doubt. Krish was getting a headache just thinking about their future together.</p>\n<p>\"How is anyone supposed to teach her if she intends to argue about everything?\" He exclaimed.</p>\n<p>But then Krish realised that there was in fact one individual who had penetrated through the girl's infuriating barriers and effectively taught her.</p>\n<p>Krish retrained his senses on the figure of that man in question at the orphanage.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/uu81tvfTyydSbjO7SWdOD\">Chapter 107 - Scepticism</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/Kqr9Ik4lQwdkRNz0NjjKb\">Chapter 105 - An Offer</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}