{"pageProps":{"note":{"id":"or7be4c82az17mbo3qj2ju4","title":"Chapter 412 - Finding Someone Your Own Size","desc":"","updated":1705593166516,"created":1705250476701,"custom":{},"fname":"volume-6.chapter-412","type":"note","vault":{"fsPath":"vault"},"contentHash":"865982391e2b604d1f6d1cc059289634","links":[{"type":"wiki","from":{"fname":"volume-6.chapter-412","id":"or7be4c82az17mbo3qj2ju4","vaultName":"vault"},"value":"volume-6.chapter-413","position":{"start":{"line":171,"column":3,"offset":13037},"end":{"line":171,"column":27,"offset":13061},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-6.chapter-413"}},{"from":{"fname":"volume-6.chapter-411","id":"qw47w660bubc9csjzu1kw31","vaultName":"vault"},"type":"backlink","position":{"start":{"line":77,"column":3,"offset":9849},"end":{"line":77,"column":27,"offset":9873},"indent":[]},"value":"volume-6.chapter-412"}],"anchors":{},"children":[],"parent":"24l34m2lf1dxtfcp94uyznb","data":{}},"body":"<h1 id=\"chapter-412---finding-someone-your-own-size\">Chapter 412 - Finding Someone Your Own Size<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-412---finding-someone-your-own-size\"></a></h1>\n<p>Kano woke up to the sound of heated discussion taking place. His consciousness remained murky, but it was enough to realise that he could not move at all - he was tied down. Kano's heart pounded in his ears, a mix of fear and confusion swirling in his mind as he strained against the coarse ropes binding him. Sweat trickled down his forehead, stinging his eyes under a thick blindfold. Thankfully his nose was free, though the air was thick with the scent of damp stone and the faint, lingering odor of fire and brimstone.</p>\n<p>As the seconds passed, the sounds grew clearer, which was a relief because he was starting to feel even more claustrophobic than when he was buried in that small rock prison. The voices spoke the common tongue, but with a much rougher accent that pushed out from the throat.</p>\n<p>\"It's a human, I tell you!\" A gravelly male voice, similar to the one he heard before passing out, declared from beside Kano.</p>\n<p>\"Nonsense! No human has walked these lands since the Age of Isolation!\" Another said from up front, from a higher elevation. This voice cracked like dry leather, each word heavy with the weight of years and a stubbornness born from a lifetime of unwavering beliefs.</p>\n<p>\"Then what in the name of Drebin's Hairy Ballsack would you call this thing?\" The voice by his side snapped.</p>\n<p>\"Mind your tone, whelp!\" A third voice spoke up with a dangerous hiss.</p>\n<p>\"Maybe its just a variant? A mutate?\" A feminine voice spoke. Unlike the others, it sounded smooth and melodious, cutting through the coarse tones of the others, suggested a presence of calm rationality amidst the heated debate.</p>\n<p>\"Haven't seen one so smooth in my entire life!\" The voice by his side argued.</p>\n<p>\"It can't be a girl either, the medics checked its nethers.\" A fifth voice said from up front. This sounded less emotional and was neither aged nor young.</p>\n<p>\"Why in the world did anyone have to check that?\" The feminine voice asked in disbelief.</p>\n<p>\"I don't know what goes on in those eggheads' noggin,\" the fifth stated. </p>\n<p>\"ENOUGH!\" A sixth voice boomed, carrying with it an air of finality and immense will. \"Our guest has awoken. Remove the blinders.\"</p>\n<p>Kano braced for a burst of blinding light. But was surprised to find out that the room he was in was dimly lit. He let his blurry vision grew clearer and the first thing that caught her gaze weren't the group of hair small people up front but the intricate interior designs. The room, dimly lit by flickering torches, cast long shadows over its interior. The walls, hewn from dark volcanic rock, were alive with intricate carvings depicting battles and myths of old, each etching telling a story of valor and ancient lore. He just couldn't keep his eyes off of them. At the room's heart stood a semi-circular dais, its surface rough and worn, holding the tribunal - each member seated behind a stone desk, their chairs resembling ancient thrones, carved with runes and symbols of power. But his attention was immediately called up by a sharp snap of fingers - the bulky, brown-haired short man at the centre of the five person tribunal at the highest seat in the room.</p>\n<p>The atmosphere was charged with a mix of suspicion and curiosity, an invisible tension that hung in the air like a thick fog, each member of the tribunal eyeing Kano with a blend of intrigue and caution. One thing Kano noticed was that all five individuals up front sported extremely long hair. The males, Kano assumed based on their overflowing facial hair, knotted their grand beards and mustaches elaborately. They sported so much facial hair that Kano could only see a stout nose and a pair of eyes on their entire face. The sole female in the crew was completely different. She had voluminous hair, similar to her male counterparts but to a greater extent, but he face was far smoother and child-like compared to the almost aged-looking males - in fact she looked closer to a young teen than an adult. Though Kano could feel that the woman was a lot older than she looked.</p>\n<p>\"Do you understand the words coming out of my mouth?\" The large (relatively speaking) male at the centre of the tribunal spoke.</p>\n<p>\"He speaks the common tongue, Lord!\" The short man by Kano's side affirmed. He was the same red-haired man who had defeated that salamander.</p>\n<p>\"We asked the human,\" the large man said pointedly while giving out a deathly glare. The red-haird man in turn retreated behind the standing stretched Kano was tethered to.</p>\n<p>\"I-I-I-I-\" Kano started, but his long lost stutter had returned with a vengeance.</p>\n<p>\"Damn it! It doesn't speak the common tongue!\" A much elderly looking man to the large man's right exclaimed angrily. \"Fetch the damn translator!\"</p>\n<p>\"Hush!\" The woman admonished. \"The child is clearly scared.\"</p>\n<p>\"We don't know if its a child!\" The elderly man snapped. \"We don't even know if its truly a human!\"</p>\n<p>\"For goodness sake, you're the oldest amongst us all!\" The one on the far left exclaimed. \"Have some sense! Just look at him!\"</p>\n<p>\"It's because I've longer than you that I hold such scepticism. For all we know, this could be a drake in a child's skin!\"</p>\n<p>\"ENOUGH!\" The man in the middle bellowed once again. \"Enough with all this bickering. You, boy, speak!\"</p>\n<p>\"I-I-I <em>cough</em> I. Am. Kano,\" Kano answered.</p>\n<p>\"And you are human, correct?\" The man followed up while narrowing his eyes.</p>\n<p>\"I. Am.\" Kano responded with an audible gulp. \"Umm, are you dwarves?\"</p>\n<p>\"Yes,\" the man answered.</p>\n<p>And then there was silence. The dwarves looked at the human, expecting him to spontaneously combust or something like that, while Kano looked back with awe. These were the same race of hardened warriors he'd read of in the novels. Although the women didn't look as the books said, the men were the split image - matching the description to the letter.</p>\n<p>\"So...\" The man at the far right said with a neutral tone. \"What now?\"</p>\n<p>\"Good question. What do we do with it?\" The red-haired man said. \"Do we send it back?\"</p>\n<p>\"How did you get here anyway?\" The woman asked Kano directly. \"No human has walked these lands for over six-thousand years.\"</p>\n<p>\"I-I don't know, I just-\"</p>\n<p>\"The Tear,\" the central dwarf declared. \"The cracks that spanned all accross the heavens. We thought it was the working of the Great Devourer, but it seems our conclusions were incorrect.\"</p>\n<p>\"The Great Devourer?\" Kano parrotted, but his question was left in the air as the adults continued their chatter..</p>\n<p>\"So there isn't a way to send him back, not unless the Tear occurs again,\" the woman affirmed.</p>\n<p>\"I say we kill it!\" The older dwarf declared righteously.</p>\n<p>\"WOAH!\" All the others in the room exclaimed in unison.</p>\n<p>\"What? I hope we aren't forgetting the atrocities humans have inflicted upon our kind in the past!\" The dwarf expressed while slamming his fist on the table.</p>\n<p>\"That was many millenia ago!\" The left most dwarf reminded.</p>\n<p>\"And he's just a child!\" The woman chimed in.</p>\n<p>\"Time and age change nothing! The whelp of a Felid grows into a Felid, no matter how cute it may look as a kitten. The damn thing will rip you limb from limb when given the chance, because it is in its nature. You can ask your grandfather if you don't believe me. That dolt thought he could tame a Felid if he raised it from birth, only to lose an eye and two fingers,\" the man said to the woman.</p>\n<p>\"We cannot convict someone of a crime that hasn't yet been committed,\" the right most dwarf said blankly. \"And we cannot foist the punishment of an entire race on a single entity.\"</p>\n<p>\"It will set a bad precedent,\" the central dwarf affirmed.</p>\n<p>\"What precedent? Humans have no rights here,\" the older dwarf said matter-of-factly.</p>\n<p>\"I have heard enough from you, Elder Bolin,\" the central dwarf declared with unwavering finality. \"Your thoughts on this matter have been received and recorded, and will be taken into consideration when it comes time to make the final verdict.\"</p>\n<p>\"You're just sidelining me again!\" The Elder accused.</p>\n<p>\"You let your emotions overwhelm your decision making time and time again, Elder Bolin,\" the woman interjected. \"This is a sensitive matter.\"</p>\n<p>\"Screw it!\" The man said while throwing his hands into the air before jumping off his seat. \"I know when my opinions aren't being valued. I'm going to walk the high road and leave. But let it be recorded that during any vote henceforth in this tribunal, my vote will always be against the majority!\"</p>\n<p>\"That's just petty!\" The left most dwarf said. \"And you can't leave, all members need to be present-\"</p>\n<p>At that moment, the woman reached forward and tapped the dwarf's hand. She shook her head, implying that he should shut up, and waited for the grumbling Elder Bolin to leave. As the old man left, he flourished his long gray robes angrily and shot Kano an enraged glare.</p>\n<p>\"The man's growing senile. The bottleneck in his cultivation has extended well beyond his estimation,\" the central dwarf explained. \"Anyways, back to the issue at hand.\"</p>\n<p>\"I think, rather there is value in listening to what the subject of interest has to say on this matter,\" the woman spoke up. \"What do you want, little Kano?\"</p>\n<p>As all eyes turned with interest towards Kano, the boy clammed up in stress. At that moment, only one thought popped out in his mind. \"I... I want to go home...\"</p>\n<p>Tears started to bubble up in his eyes as the weight of everything he'd learned started to fall into place like a horrid jigsaw puzzle.</p>\n<p>\"Now, now,\" the large dwarf in the centre said in a low voice. \"Men do not cry.\"</p>\n<p>\"I'm not a m-m-man!\" Kano cried.</p>\n<p>\"Men. Do not cry,\" the dwarf repeated with greater force, causing Kano's distress to amplify into a full blown bawl.</p>\n<p>\"Stop now! You are just scaring him,\" the woman said before stepping out from her seat and walking over to Kano. She quickly undid the ropes holding him in place before gently hugging the boy. Funnily enough, Kano was taller than her.</p>\n<p>A few minutes passed as Kano cries started to teeter off.</p>\n<p>\"Do not cry, child. You should look at the bright side! You're still alive. If you're alive, you can find a way back,\" the lady encouraged. \"Now give us a nice smile!\"</p>\n<p>\"T-Thank you, Miss Roland,\" Kano responded while returning a faint by beaming smile. Though he was caught midway upon seeing horrified looks being sent his way as all the members still on their seats remained frozen in fear. Kano looked down and noticed the woman vibrating visibly with rage.</p>\n<p>\"Which one of you bastards told him my Ex's name?\" She asked with palpable rage oozing out of her calm voice.</p>\n<p>\"Elder Bogum, w-we-\"</p>\n<p>\"Was it you, Durum?\" She snapped at the right most dwarf, who immediately ducked behind his desk and yelled, \"I swear it wasn't me!\"</p>\n<p>\"Elder Bogum, please. The boy only just gained consciousness, how could he have known such an intimate piece of information?\" The central dwarf reasoned. Upon hearing that, the woman snapped her head towards Kano and looked at him with red eyes.</p>\n<p>\"I'm sorry,\" Kano quickly apologised.</p>\n<p>\"Where did you hear that name?\" She asked while grabbing Kano by his collars.</p>\n<p>Kano raised a wobbling finger and pointed at her seat, \"It was written on your seat!\"</p>\n<p>\"Damn it, Raidon!\" She yelled at the central dwarf. \"I've asked a million times to change that stupid thing. Its been a century since I separated from that bastard, yet that name is still etched into every official document that comes my way! When will you-\"</p>\n<p>She paused and looked back at Kano with surprise. \"You read that?\"</p>\n<p>Kano nodded worriedly, \"I'm sorry-\"</p>\n<p>\"How did you read that?\" She asked while pointing at the intricate scribble of text on the stone block placed in front of her seat. She then pointed at the ceiling and asked, \"Can you read that?\"</p>\n<p>\"Justice,\" Kano said as he quickly deciphered the large scribble circling the ceiling.</p>\n<p>The dwarves exchanged surprised looks before the woman opened her mouth. But it wasn't her voice that escaped, but that of the Elder that left earlier. \"He was a dwarven variant after all!\"</p>\n<p>\"Elder Bolin!\" The red-haird dwarf (who had gone meek and stepped aside) exclaimed. The old dwarf ignored everyone and rushed up to Kano. He grabbed the boy's head and started to move it around, inspecting it thoroughly.</p>\n<p>\"You were waiting outside this entire time?\" Elder Bogum, the woman, murmured.</p>\n<p>\"Of course! I wasn't going to stay back and let you whippersnappers do something stupid,\" he said offhandedly. \"Thank goodness too, or we would have done something unspeakable to a fellow dwarf!\"</p>\n<p>\"You were the one-\" the right most dwarf started, but he was once again silenced by a rougher palm falling on his shoulder from the dwarf in the middle.</p>\n<p>\"I'm not a dwarf,\" Kano said with a muffled voice as the Elder started to inspect his mouth.</p>\n<p>\"Maybe not on the outside, but it seems dwarven blood runs through your veins,\" the woman corrected. \"How else can you explain your ability to read Dwarven Script?\"</p>\n<p>\"What-?\" Kano started, but he was instantly silenced as the brute of a central dwarf made a move from his position. </p>\n<p>\"Boy,\" the central dwarf called out as he stood up from his seat. \"Only Dwarves can read Dwarven Script.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/8pv31shg4tu5gd6bhq593wb\">Chapter 413 - The Council's Decision</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/qw47w660bubc9csjzu1kw31\">Chapter 411 - Better Yesterday, Today, or Tomorrow</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}