{"pageProps":{"note":{"id":"owgoslwf58y8j4nxz7zylrm","title":"Chapter 301 - (Interlude) Temptations","desc":"","updated":1680159914500,"created":1678606124494,"custom":{},"fname":"volume-4.chapter-301","type":"note","vault":{"fsPath":"vault"},"contentHash":"73e4e26a3b74a40005cb0f04cdb9164a","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-301","id":"owgoslwf58y8j4nxz7zylrm","vaultName":"vault"},"value":"volume-5.chapter-302","position":{"start":{"line":83,"column":3,"offset":10946},"end":{"line":83,"column":27,"offset":10970},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-302"}},{"from":{"fname":"volume-4.chapter-300","id":"gwi00oagfa6h8r51v649hhs","vaultName":"vault"},"type":"backlink","position":{"start":{"line":43,"column":3,"offset":9114},"end":{"line":43,"column":27,"offset":9138},"indent":[]},"value":"volume-4.chapter-301"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-301---interlude-temptations\">Chapter 301 - (Interlude) Temptations<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-301---interlude-temptations\"></a></h1>\n<p>Shuri tempered her expectations through the journey to \"her\" Sect. It was a strange development, to say the least. First off, she didn't have a solid \"plan\" after leaving the Capital. She knew she had to go far away - somewhere remote where the eyes and reach of the Emperor were weak. She would go there and live out the rest of her life as it came. She didn't have high-flying dreams or ambitions, or bone-chilling vows of revenge.</p>\n<p>But after being shown glimpses of a possible future - a better future - for herself, she was tempted. She suddenly wanted... more. Markus exploited this temporary surge of weakness on her part and roped her into the True World Sect. Was she suspicious? Definitely. But Shuri was left with no better option. Besides, was there a more treacherous place out there than the Palace of the Sun?</p>\n<p>The Sect and the Village where it was established were everything Markus described it to be. Shuri could not find a single discrepancy or lie based on a superficial survey of the place. After extricating herself from her escort, she managed to explore the region more thoroughly, and was satisfied to find that it fit her earlier definition of \"far away\" and \"remote\". Unless the Sect did something outrageous, the eyes of the Empire wouldn't grace this place for the next two years. That was sufficient time for Shuri to recollect herself, build her strength, and plan her next steps.</p>\n<p>Shuri wasn't interested in aligning herself with an organisation. Because from her knowledge there were only two types of organisations in the world. Ones that chopped off an arm to save the body, and ones that took the entire body down to avoid losing an infected appendage. The former wouldn't think twice before sacrificing a weak link, and the latter would be too \"righteous\" to even consider it. If this Sect was the former, then Shuri would eventually find herself on the chopping block as a sacrifice for the Sect, and in the latter case, she would find herself on the chopping block because of the Sect's inability to establish priorities. Regardless, Shuri was better off on her own.</p>\n<p>This did not mean that she couldn't take advantage of the hand Markus extended her way. But first, she had to test just how far this assistance reached and survey the state of her new environment.</p>\n<p>Her \"colleagues\" in the Sect were all members of the underprivileged class - refugees. Shuri could posit that since this Sect couldn't fill its quota, it decided to pull from a pool of easy catches. These kids were guaranteed additions, and easily exploitable. All it took was a thin rope that gave the faint signal of hope, which the Sect did by paying for their families' relocation. Was this decision purely out of kindness and goodwill, or was there a malicious intent hidden beneath it all? Shuri was definitely leaning towards the second option. She confirmed that she was now essentially surrounded by spies - die-hard loyalists to the Sect. She had to tread carefully and not attract the ire of the Sect's higher-ups.</p>\n<p>The Sect's premises were quaint, yet highly functional. Whoever designed this aimed to promote a sense of flatness in the hierarchical structure. Unlike other Sects, the aim here was to remove the social divides that separated people and create a more \"approachable environment conducive to growth\" (Markus' words). Shuri was certain that this was another strategy to make people lower their guard and cultivate a false sense of security. The less people had to worry about getting back-stabbed the more upfront they were. This would ensure that fewer secrets and subterfuge were occurring within Sect walls. It also meant that a person's weakness was common knowledge and readily exploitable by the Sect!</p>\n<p>And then there was the highlight that really sent Shuri's mental alarm blaring. The Library. Placed in a conspicuous location far above the rest of the Sect, this majestic work of architecture exuded an aura of splendour and awe. The tour that followed the innocuously orated speech of indoctrination reached a point where the group was guided towards the Library. Shuri assumed that it would be a simple peek, to whet the unsuspecting member's appetites and further tether them to the Sect. Markus promised complete freedom of the facilities; she was on the lookout for the \"but\" which would drop any moment now.</p>\n<p>But... it didn't. The Library truly was open to everyone. Shuri confirmed this, based on the fact that there was nothing barring entrance except for a port where the Sect's membership token had to be slotted allowing the magical barriers and alarms to lower.</p>\n<p>Was Shuri being excessively paranoid? Definitely! Her single lapse had overturned her life! She would never make that mistake again. She would take every step as if the floor would give way and reveal a pit filled with venomous vipers.</p>\n<p>The knowledge enshrined within the Library was profound and new. Shuri was confident that she had read everything freely available within the Solar Empire and then some. She could recite every book she'd read from memory at a moment's notice. Yet none of the books in this place was reminiscent of the ones she'd read before. Shuri approached the works with an open mind but primed with scepticism, as one should. She was willing to entertain the arguments presented in the books, but not accept them as gospel readily.</p>\n<p>There was a wide genre of books for her to peruse through. The Library's opening foyer provided charts and posters that offered a preferred sequence of reading for newcomers. Shuri used it as a guide, since it was better than stumbling around in the dark and followed the path of natural sciences. The initial few books came with illustrations that covered a vast array of topics at a superficial level. Some reinforced what she already knew, others provided explanations and derivations for what she knew from a more logical perspective, a few disproved and redefined what she thought she knew, and many more taught her completely new things that she had never thought to question before.</p>\n<p>While Shuri maintained her scepticism, she could not find a weak link in the reasonings written in these books. There were easy-to-follow and comprehensible explanations and examples that tied each claim into a neat bundle. She even figured out why Markus' |Fireball| was so cheap.</p>\n<p>\"The 'truth' and the 'lie'...\" an apt naming convention that simplified the arcane fundamentals of magic.</p>\n<p>Within three days, Shuri had devoured a vast assortment of books. A single thorough read was all it took for the information to find its permanent home in her mind. She not only followed the sequence defined by the posters, but she also sampled books from all over the Library to test the limits of her freedom in this Sect.</p>\n<p>One particular day, Markus showed up. Shuri anticipated the second shoe to drop. She had blatantly overdrawn on the boy's assistance, and now the debt had to be repaid. After all, it was best to know the enemy than to live in the shadow of an unknown.</p>\n<p>\"Are you enjoying the offerings of our Library?\" Markus probed. \"I've noticed that you're spending most of your time here. I can understand the excitement you are feeling, but I worry that you may burn yourself out too soon in your enthusiasm.\"</p>\n<p>\"Don't worry about it,\" Shuri responded with a \"warm smile\". \"I'm only casually perusing.\"</p>\n<p>\"We both know that isn't true,\" Markus said with a wry smile. \"I bet you can recite every single book you've 'perused' till now. Please understand, you need to unwind once in a while or else you will only hurt yourself. 'All work and no play makes Jack a dull boy.'\"</p>\n<p>\"Who's Jack?\"</p>\n<p>\"A boy who did what you're doing right now,\" Markus answered. \"It's an idiom. If all you do is work, then your mind grows numb. You need to cleanse and surprise it once in a while - work different parts of it - so that it doesn't happen.\"</p>\n<p>Shuri hummed while turning away. \"I've noticed that the Library is sorely lacking in cultivation methods. I found a few, but they seemed too common. Is this all that the Sect has to offer?\"</p>\n<p>\"Is this 'all'? I think you're misunderstanding something,\" Markus declared. He spread his arms wide and expounded. \"Do you not see all the cultivation methods available to you?\"</p>\n<p>\"Excuse me?\"</p>\n<p>\"What is cultivation? It is to improve the self, is it not? All these books are here. They all offer avenues for you to follow to improve yourself,\" Markus clarified.</p>\n<p>Shuri narrowed her eyes suspiciously, \"This all sounds like a confidence scheme...\"</p>\n<p>\"Of course it does. Everyone has been fooled into thinking that one can cultivate by following and internalising instructions provided in a book when it is known that cultivation is unique from person to person.\"</p>\n<p>He shook his head and said, \"Forget about all that for now. Look, there is a process to all of this. Do not skip steps in your excitement, as it will only be a detriment to your growth. Why don't you join a few of us in a game of Scrabble?\"</p>\n<p>Shuri once again evaded the offer and pointed towards something that she only discovered recently. \"I couldn't help but notice this separation. I thought all knowledge was open to everyone?\"</p>\n<p>What she was referring to, was a physically locked gate that closed off a section of the Library.</p>\n<p>Markus looked at Shuri for a few seconds before sighing in defeat. \"It seems that I cannot convince you to put a hold on your thirst for knowledge. No matter. Just be responsible.\"</p>\n<p>He looked towards the gate and added, \"Knowledge is like a building. One needs a sturdy foundation before building higher levels. Beyond this gate lies blocks that make up the true upper levels of knowledge. It is dangerous to dabble in it when one is still a novice and lacks the sufficient prerequisites.\"</p>\n<p>\"How do I get access to the other side?\" Shuri probed.</p>\n<p>\"You will need to confer with the Sect Leader for that. You must prove to him that you are ready for what lies beyond,\" Markus answered.</p>\n<p>\"I can't help but think it runs counter to everything you've told me till now,\" Shuri challenged.</p>\n<p>Markus walked up to the gate and bent the metal apart. \"If it was truly forbidden, then more stringent protection would be in place. What is the difference between feeding someone course by course, as opposed to placing them before a buffet? This gate is only there for you to know when to temper your appetite.\"</p>\n<p>He bent the metal back in shape, turned and walked away, leaving Shuri to gaze beyond the metal in thought. The sections ahead were draped in darkness. The books lining the multitudinous shelves called out to her, like a siren enticing dehydrated and malnourished sailors to a gruesome death. She understood the implications behind Markus' warnings, but the taste of what lay behind her was urging her to sample what lay beyond.</p>\n<p>\"I was mistaken...\"</p>\n<p>There WAS a place more dangerous than the Palace of the Sun, and she had voluntarily walked into it.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/x9xit5xf99buc5qiv4661pi\">Chapter 302 - Out of the Frying Pan...</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/gwi00oagfa6h8r51v649hhs\">Chapter 300 - (Interlude) Start of a New Life</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}