{"pageProps":{"note":{"id":"p2ssr345vvyhjznnsyfr5u6","title":"Chapter 215 - (Interlude) Conversation between Multidimensional Beings (Part Two)","desc":"","updated":1661110238613,"created":1659189701926,"custom":{},"fname":"volume-3.chapter-215","type":"note","vault":{"fsPath":"vault"},"contentHash":"5dca73bb10332afb1095d6a5f779dfb7","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-215","id":"p2ssr345vvyhjznnsyfr5u6","vaultName":"vault"},"value":"volume-3.chapter-216","position":{"start":{"line":79,"column":3,"offset":10733},"end":{"line":79,"column":27,"offset":10757},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-216"}},{"from":{"fname":"volume-3.chapter-214","id":"ih7almhd24difq2mxy550l2","vaultName":"vault"},"type":"backlink","position":{"start":{"line":125,"column":3,"offset":10880},"end":{"line":125,"column":27,"offset":10904},"indent":[]},"value":"volume-3.chapter-215"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-215---interlude-conversation-between-multidimensional-beings-part-two\">Chapter 215 - (Interlude) Conversation between Multidimensional Beings (Part Two)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-215---interlude-conversation-between-multidimensional-beings-part-two\"></a></h1>\n<p>[Why did you select this human- this... Guy?]</p>\n<p>(To provide a proper explanation, I will start from the very beginning when you hinted at the trouble you were facing with this world having reached a state of stagnation. Of course, this was after we learned of the invasion and assimilation taking place in your previous world,) Mast replied. (Thanks to the privilege you provided Moni and me, it was easy for me to grasp the crux of the issue. In your attempt to fuel development by creating the transient particle called mana, you forgot to place a hard upper limit on how powerful a mortal can become by harnessing its powers. You see, a mortal with strong control of mana and with the ability to manifest its true potential becomes inherently detached from his base species. By referring to your previous world, which is a lot closer to my own, even though certain mortals had greater power in terms of tangible and intangible assets, they were still relatable to their base species. There was still some incentive motivating them to assist those they considered beneath them. This connection is lacking in your current world.)</p>\n<p>[I can see that now.]</p>\n<p>(Through that discovery, I realised that the solution would be to shorten that gap between the weak and the strong. It would be difficult to motivate the powerful to sacrifice that hard-earned strength to help the weak, but it would be trivial to motivate the weak to grow stronger given sufficient assistance. Hence any assistance on my part should tackle the problem using this approach. Of course, there was only one way I could provide assistance to this world, and that was by introducing a soul that existed in my world. Therefore, I noted that the soul that should be introduced must have some expertise in assisting the weak.)</p>\n<p>[Acceptable conclusion.]</p>\n<p>(Now came the problem of how to provide power to the weak in this world. After understanding the base workings of the particle called mana, I found out that you created it as a quick way for mortals to tamper with the natural laws we program when building and managing a world without causing the world to fall apart. Thus, I posited that an easy method to get stronger would be to become more intimate with the natural laws of this world. The greater the mortal's understanding of how a certain phenomenon transpired, the easier it would be for them to harness the mana to replicate the same phenomenon. Hence, I added another requirement to my soul, which would be that they needed to have a strong grasp of the natural laws.)</p>\n<p>[That should have been difficult for you since your world is many millennia behind my original world. And the mortals in my original world barely understood 35% of the laws I had programmed into it.]</p>\n<p>(I would like to point out that the mortals in this world only understand 0.4% of the natural laws of this world, and this world has existed just as long as my own.)</p>\n<p>[Fair enough. But if this were the case, why would you select Guy? This mortal does not seem to have a thorough grasp of all the known laws of your world. If I am not mistaken, humans should only be privy to 5%.]</p>\n<p>(That was because, in addition to knowing all these laws, the mortal would also have to convey them to others with maximum efficiency. If I had transplanted a soul from my world with all the knowledge encompassed in that 5%, it would be useless if they lacked the skills to transfer it to others. The probability of finding a soul with all the knowledge, and the skill to teach was incalculably low. Instead, I opted for a soul with unparalleled ability to teach, but with a moderate grasp of the worldly knowledge known to his species. Because it is easier to bridge the weakness by appending an augment to the soul that acts as a repository of knowledge.)</p>\n<p>[Which is the trace of extraworldly energy I sensed in Guy's soul! It seems that Moni's mortal soul also has it in common?]</p>\n<p>(She found my idea intriguing and decided to follow suit. Except she seems to be siphoning the knowledge from your world, which I find counterintuitive.)</p>\n<p>[Moving back to our discussion, it makes sense why you chose this soul given his expertise in teaching, and his penchant to assist the weak and moderate intelligence. However, I am intrigued as to why you chose this soul in particular. Knowing your modus operandi, there must have been additional factors in play here?]</p>\n<p>(As a matter of fact, there were. You see, after applying the aforementioned filters as search parameters, I was left with 34201 possible qualified souls. However, this only applied when evaluated from a rational point of view. You see, no two mortal souls can be the same, even if their growth environments are identical, or if they are from the same biological mating pair. The growth trajectory of the newborn soul can deviate greatly after a certain point in time. Hence, my next challenge was to determine which of the 34021 possible entities stood a chance in accomplishing the task.)</p>\n<p>[That notion seems rife with uncertainties.]</p>\n<p>(You are correct in that statement. The behaviour of mortal souls never adheres to logic. This is why I spent a hefty portion of my time understanding the psychology of mortals. As multidimensional beings, the decisions that we deem most appropriate to specific scenarios may not match those of mortals, and if I am to rely on one to do my bidding I needed to understand the way its mind worked perfectly. After an in-depth dive into the subject, I came out with a few additional search parameters that narrowed the qualified souls to just 3.)</p>\n<p>[What were these new parameters?]</p>\n<p>(There were many, but I will provide a non-exhaustive list of the primary parameters. The mortal must be mature and rational so that they can evaluate their decisions before acting upon them. They must be non-confrontational so that they don't actively or unwittingly seek conflict and die before making a difference. They need to be kind and honest to be able to endear themselves to others. They must be hard-working and dedicated to their work, to be able to tackle tough situations. They need to be fulfilled and passive, free of wild hopes and dreams that can derail their purpose. And finally, they need to be mentally robust, so that they don't deflate when assaulted with adversities.)</p>\n<p>[Though I agree with some of those parameters, I don't see the importance of some such as 'non-confrontational' and 'passive'. It looks counterintuitive to your purpose?]</p>\n<p>(I needed my soul to be a clean slate so that I can mould them to my will. If a soul comes preprogrammed with a confrontational and active characteristic, they are difficult to reel in and control. They will often have their own opinions and perspectives that will conflict with mine.)</p>\n<p>[How did you narrow down the three finalists?]</p>\n<p>(The final eliminator was the environment. I had to evaluate the environment the souls were coming from and would be migrated to, to see whether they would assimilate well and if the conditions after assimilation would be favourable for us. Of the three, only Guy scored the highest, that too because of the probabilities lining up perfectly. He was set to die in my world with a single unfulfilled wish, and it just so happened that there was another soul in your world that could fulfil it. After that was decided, it now became a matter of setting up the pieces to fall into place. Finding the correct time to migrate the soul, the correct location, and the appropriate body for the soul to inhabit.)</p>\n<p>Mast proceeded to explain the innumerable additional details he had to take into consideration prior to migrating Guy's soul.</p>\n<p>(After bringing the soul in, my next task was to steer him in a particular direction. Due to the mistruths I fed him prior to transmigration, he already held a positive opinion about me thanks to his predisposition towards kindness. This helped me shape his perspective early on without much opposition. Then, I waited to see if the soul would be effective in solving our problems. After confirming that, I shifted my focus toward changing his passive and non-confrontational character and moved on to phase two of my operation. I found that the most optimal way to motivate humans to assume an active role is by introducing an antagonistic character that contradicts them. I chose to assume that role with Guy. By pointing out the folly of his weak mentality and his incapacity in his past life, I evoked a mental breakdown inside him. This was further exacerbated by a harrowing revelation from the mortal who he shares an emotional bond with. From this point onwards, Guy will function like a programmed machine.)</p>\n<p>[What are your predictions for his success?]</p>\n<p>(My calculations indicate 84.73%,) Mast answered. (But that was prior to the sudden anomaly in his soul. I initially introduced the repository of knowledge within a compartment of his soul to fill in his lack of knowledge. However, certain actions of his performed within that compartment caused it to split and introduced another compartment borne off of the extraworldly energy I used to create the repository. Since it was formed in this world, it is out of my control.)</p>\n<p>[It isn't within my control. I cannot peer into it either.]</p>\n<p>(That is concerning...)</p>\n<p>[How does it affect your calculations?]</p>\n<p>(Surprisingly, it has raised the probability of success.)</p>\n<p>[Explain.]</p>\n<p>(It seems that the anomalous compartment has spawned an alter ego of sorts that draws into the repressed characteristics of Guy's soul. Where he is calm and reasonable, the alter ego is wild and fanatical. What Guy lacks, the alter ego has in spades and vice versa. My updated calculations have shown that if used properly, the alter ego can increase the rate of advancement of this world by a few decades. I employed a tactic labelled reverse psychology to evoke a mystical and near-taboo nature to this compartment. In doing so, I am gently nudging Guy to rely upon it to a larger degree.)</p>\n<p>[I don't like uncertainties, Mast,] Tron warned with a stern voice. [You know that I cannot intervene with any soul living in my world.]</p>\n<p>(If the anomaly exceeds the bounds of my predetermined limits, I shall cull it immediately. I brought it into your word, I have the power to take it out just as easily,) Mast assuaged. (If this experiment fails, we shall start again. Although the next won't be as optimal as this one, it shouldn't be too difficult to stack the field in our favour.)</p>\n<p>Tron remained silent while considering everything discussed till this point before asking, [The downsides?]</p>\n<p>(Nothing for us to worry about. The mortal soul will fulfil its purpose. And once its purpose is achieved, it can be disposed of.)</p>\n<p>[Acceptable.]</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/wld5f4bvhgg1i03ld2gqqc0\">Chapter 216 - The First Sale</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/ih7almhd24difq2mxy550l2\">Chapter 214 - (Interlude) Conversation between Multidimensional Beings (Part One)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}