{"pageProps":{"note":{"id":"pp39nkujysxofng4hisuip4","title":"Chapter 211 - Deterministic Chaos","desc":"","updated":1660282412240,"created":1658039974598,"custom":{},"fname":"volume-3.chapter-211","type":"note","vault":{"fsPath":"vault"},"contentHash":"b3aefc143f490b0d1e4366b4a79fcf1d","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-211","id":"pp39nkujysxofng4hisuip4","vaultName":"vault"},"value":"volume-3.chapter-212","position":{"start":{"line":103,"column":3,"offset":11306},"end":{"line":103,"column":27,"offset":11330},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-212"}},{"from":{"fname":"volume-3.chapter-210","id":"nj0k3j168dqzri7yhz46tcq","vaultName":"vault"},"type":"backlink","position":{"start":{"line":101,"column":3,"offset":10478},"end":{"line":101,"column":27,"offset":10502},"indent":[]},"value":"volume-3.chapter-211"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-211---deterministic-chaos\">Chapter 211 - Deterministic Chaos<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-211---deterministic-chaos\"></a></h1>\n<p>Marie narrowed her eyes and gave her Master an affronted look.</p>\n<p>\"Why are you doing this, Master?\" She blurted out exasperatedly.</p>\n<p>\"Doing what?\"</p>\n<p>Marie pointed downwards aggressively and then waved her hands around her as she repeated, \"This! A week. I spent an entire week coming up with a solution, even an inkling of it, and finally gained some headway. But then you stumble along and just slap it away?\"</p>\n<p>\"I'm just trying to help...\" Krish muttered. \"Isn't it better to not have to go through a pointless path that leads to a dead end?\"</p>\n<p>Unbridled rage flashed across Marie's eyes, which started to radiate outwards, \"How do you know it will be a dead end? Have you tried exploring it?\"</p>\n<p>\"Well not personally,\" Krish shrugged. \"My Master's Master did, though. I heard from my Master that it was a wasted effort. His Master spent five years trying to find a viable connection between the contemporary seer arts and the Heavenly Eye.\"</p>\n<p>\"So it's hearsay?\" Marie reiterated.</p>\n<p>\"It's not hearsay,\" her Master said with a stern retort. \"I heard it from my Master, who learned from his.\"</p>\n<p>\"Yet there are no written records of this experiment,\" Marie pointed out. \"What were the testing criteria, and what was the methodology? Without answering these questions, and evaluating the evidence, how can I just trust this claim?\"</p>\n<p>\"I am your Master,\" Krish warned.</p>\n<p>\"And I am your Disciple, you should know the kind of person I am,\" Marie shot back with equal ferocity. \"And here I thought we were getting closer,\" she muttered disappointedly.</p>\n<p>Krish sighed audibly and inquired, \"I was only trying to help. I just...\"</p>\n<p>In truth, Krish was feeling left out. For the past few weeks, due to Guy's absence, he got to spend more time with his Disciple and perform his duties as a Master more extensively. He even got the opportunity to teach his Disciple some spells and magical theory. Although he was the one who preempted Guy's trip for his student's sake, he felt a little jealous after observing the two working together so cohesively. He could see that the two shared the same wavelength, something he'd been trying to achieve with his Disciple through an excruciating amount of effort. Now that he thought about it, Guy had this uncanny ability to connect with any child he taught. The man could shift his approach like a chameleon - it was a skill Krish sorely desired nowadays.</p>\n<p>\"This isn't helping,\" Marie responded solemnly, noticing the drop in her Master's expression. She wasn't an expert in reading body language and intent, but she could at least glean that her Master's current demeanour had more to do with himself than with her. He was being petty, completely unlike himself.</p>\n<p>\"Besides,\" Marie added. \"It's decided! Even if your Master's Master failed, I won't. I will MAKE SURE that I succeed, even if it is the last thing I do.\"</p>\n<p>\"But how?\" Krish asked.</p>\n<p>\"We'll find a way,\" she answered. \"We managed to come this far, let's see how much further we can go.\"</p>\n<p>With that said, Marie skipped toward the blackboards and started to jot down hypotheses as they popped into her head. Her mind was whirring constantly, forming connections and disconnecting pointless avenues at inhuman speeds. At a point, her hands could not keep up with her thoughts, and they started to visibly stutter in place.</p>\n<p>As Marie worked on the boards, Krish approached Guy and asked with a low whisper, \"How do you do it?\"</p>\n<p>\"Do what?\" Was Guy's knee-jerk response as he remained distracted by the convoluted mess being manifested on the board.</p>\n<p>\"Mesh with her so easily? I am yet to observe a single adversarial interaction between you and Marie. In fact, I am yet to observe such an interaction between you and ANY of your students,\" Krish inquired with a hesitating and ashamed tone.</p>\n<p>\"The answer is right in front of you,\" Guy pointed out. \"Marie is driven and intelligent when approaching topics she is informed about, and she is humble and deferring when it comes to topics she isn't so knowledgeable about. All you need to do is show her a path, and she will explore it to its entirety. What you did earlier was place a blockage in her path. In doing so, you intruded into her natural process and pushed her to do the exact opposite - since it is in her nature to be a contrarian.\"</p>\n<p>\"Okay, I'm stuck again,\" Marie declared as she stepped back with a pensive look.</p>\n<p>Guy mouthed, 'See what I mean?' to Krish as he approached his struggling student. \"Where's the issue now?\"</p>\n<p>\"It all feels like a cohesive system,\" Marie commented. \"The other cultivation methods use astrological positions as some sort of initial conditions that can be used to predict the state of the system in the future. However, what if there is an error in the initial state estimate? Is this why the other methods are inaccurate?\"</p>\n<p>As Guy absorbed Marie's words, an idea started to bloom in his mind. The whole explanation and her diagrammatic representation on the blackboard started to tug at a long forgotten memory of his from his past life. He'd read of something like this before.</p>\n<p>\"Chaos theory...\" Guy muttered. Although it wasn't explicitly stated on the board, Guy could make the connection to it.</p>\n<p>\"What's that?\" Marie asked with an intrigued expression.</p>\n<p>Guy's smile twitched. He knew what it was, or had a recollection of an example of chaos theory, but he could not formalise it with a definition - at least not with a definition Marie would be satisfied with. After pausing to think, Guy decided to make use of a resource accessible to him. \"I believe it will be easier to just show you what I mean.\"</p>\n<p>Marie's eyes shone with a cognisant lustre, and she nodded affirmatively. Krish could read between the line and immediately knew that Guy was about to perform his brand of |Soul Imprint|. He frowned bitterly since he could not follow his Disciple in her adventure.</p>\n<p>For the other two, entering the Church was a familiar and trivial task. Guy had perfected it through repeated use and Marie had got used to the disorienting sensation that deposited her into the ethereal chapel. With another set of practised motions, Guy brought forth the void-black screen hovering in front of the alter and pulled Marie's consciousness into it.</p>\n<p>Guy followed a minimalistic approach this time, opting for a simple cubed room with white all around. Without distracting details assaulting the senses, Guy could immerse Marie in what he was about to show. With a snap of his fingers, a rope dropped from the ceiling and a heavy circular mass attached itself at the free end - it was a simple pendulum.</p>\n<p>\"You should have seen a pendulum before, played around with it even. When you displace the pendulum's mass - the bob - from its rest position by a little and then release it, you can observe a familiar reaction of it oscillating. If we were to plot the pendulum's displacement from the centre, we receive a waveform with is a simple sinusoid,\" as Guy narrated, a moving graph appeared to his side with a black line snaking up and down, above and below the time-axis as the pendulum oscillated back and forth.</p>\n<p>\"Note that no matter where you release it from,\" Guy explained as he stopped the pendulum and raised it to a slightly higher starting point, \"the resulting behaviour of the pendulum is predictable, as you can see a similarly shaped graph forming.\"</p>\n<p>\"This is a property of linear systems. As long as this pendulum's initial displacement angle isn't too egregious, the resulting behaviour is predictable.\"</p>\n<p>Guy then snapped his fingers and caused another rope and bob to attach itself to the existing bob, \"This is a double pendulum. I have tightened the strings so that they neither compress nor extend - they can be likened to rods. This is a nonlinear system.\"</p>\n<p>Guy pulled back the lower pendulum and released it. \"This time, we will plot the displacement of the lower bob only. Observe its irregular behaviour. A nonlinear system is one where the change in output is not proportional to the change of its input. That is, if I displace the lower bob by a little, and if it were a linear system, I should expect a proportional increase in the magnitude of the outputs, however, that isn't the case as seen in this graph.\"</p>\n<p>On the graph in question, wild peaks and troughs were forming in seemingly random shapes. \"Now you would think that nonlinear systems are unpredictable, but that is not true since I am graphing it for you here. As long as the model of the system is known, we can plot the behaviour of the nonlinear system like a linear one. The key difference that I want to point out here is as follows.\"</p>\n<p>Guy clapped his hands and pulled them outwards. In doing so, the double pendulums multiplied; there were now ten identical double pendulums hanging off of the ceiling.</p>\n<p>\"I am now going to pull the lower bob back by the same amount for all ten, however before releasing them, I am going to slightly - by a negligible amount - change their displacement,\" as he finished, Guy released all the bobs together.</p>\n<p>\"Nonlinear systems are chaotic, but also predictable. They are predictable as mentioned before as long as we know their model. They are chaotic because just gleaning at their present behaviour through observation does not mean that you can determine their future behaviour.\"</p>\n<p>The ten graphs were displaying similar behaviour, with the same peaks and troughs. However, somewhere around the four-second mark, a small change started to materialise, the graphs started to deviate from each other. Guy let the graphs progress for a while longer before bringing them all together in the same set of axes. In doing so, Marie was able to clearly see how, while the graphs were similar in the beginning, they started to differ wildly near the later stage and, after a certain point, failed to look anything like each other at all.</p>\n<p>\"A small change in the initial condition of a nonlinear system can elicit unpredictable changes in the system's expected behaviour in the future, just like how a butterfly's wingbeat can cause a typhoon on the other end of the planet.\" Guy coughed mirthfully before adding, \"That last part was just an idiom, of course.\"</p>\n<p>Marie's eyes narrowed at the graph presented before her, \"The world is a nonlinear system... Having the incorrect initial conditions causes massive deviations. These deviations represent the Transients. But this should lead to instability... unless...\"</p>\n<p>Suddenly, Marie snapped her fingers as a breakthrough hit her. She rushed towards the graph and with her fingers, pinched the ten graphs at the twenty-second mark where they had completely deviated from each other. \"Constant events are fixed in the tapestry of fate. They exist to ensure that a butterfly's wing beat doesn't elicit a tropical storm. This is it! As long as I can model fate, I can find the constants at the points where each of the parallel transient behaviours of the universe merges into one.\"</p>\n<p>The location where Marie pinched the graphs started to shine with a golden hue, as a bounteous change took place inside her.</p>\n<hr>\n<p>Not half an hour passed by, before Krish was brought out of his sulking and bore witness to something that had never happened before, at least not successfully, in the history of cultivation. His dearest Disciple was undergoing another perfected resonance!</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/slsfmqfil1gh2fx3l0njovw\">Chapter 212 - Second Perfected Resonance</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/nj0k3j168dqzri7yhz46tcq\">Chapter 210 - Alternative to the Heavenly Eye</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}