{"pageProps":{"note":{"id":"pu10658yqkdicvtvotvnhkg","title":"Chapter 220 - Hitch-hiking","desc":"","updated":1662549649955,"created":1659860911723,"custom":{},"fname":"volume-3.chapter-220","type":"note","vault":{"fsPath":"vault"},"contentHash":"732e157ee19c400b12418f796305c7c4","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-220","id":"pu10658yqkdicvtvotvnhkg","vaultName":"vault"},"value":"volume-3.chapter-221","position":{"start":{"line":155,"column":3,"offset":12092},"end":{"line":155,"column":27,"offset":12116},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-221"}},{"from":{"fname":"volume-3.chapter-219","id":"onv2e24fy9v3ur7plx9fqp6","vaultName":"vault"},"type":"backlink","position":{"start":{"line":109,"column":3,"offset":10314},"end":{"line":109,"column":27,"offset":10338},"indent":[]},"value":"volume-3.chapter-220"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-220---hitch-hiking\">Chapter 220 - Hitch-hiking<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-220---hitch-hiking\"></a></h1>\n<p>East of Radiant City, the commerce capital of the Solar Empire, lay the vast and dense Green-Sky Forest. Its sprawling and undisciplined woods extended for many kilometres before facing their first obstacle in the form of the Serrated-Peaks Mountain Range which hugs the forest from its northern to its southern limits in a crescent shape. To pass through this mountain range, one must follow the path which cut right through its centre, leading into the Whispering-Woods Forest on the other side.</p>\n<p>The peculiarity of the mountain range stemmed from the fact that its lowest peaks were found right at the centre of the crescent while the highest was at its tips at the north and south. On the contrary, the mana density followed an inversely proportional trend, with greater mana concentration near the centre of the mountain range and decreasing as one moved north or southwards. Hence, one would find magical resources, and powerful and intelligent beasts in abundance at that centre, which also happened to be where most foot traffic fell, since caravans could only take this road to cut through the mountain range unless they decided to waste additional time to take the safer path around the mountains.</p>\n<p>Many had tried to start a sect in the strategically fortified inner regions of the Serrated-Peaks Mountain Range, yet none succeeded. This was because in trying to secure the most mana-abundant locations on the range, one would need to compete with other mages and sentient beasts that roamed in the Core Condensation Realms and above, such as the notorious Thunderbird couple and their offspring that practically ruled the mountain range. To that end, there were always a few eyes pasted warily on the range looking out for upstarts looking to establish a base there or harvesting some of the more arcane and rare magical resources that sprouted in the range and the surrounding forestry. After all, the world of cultivation was a crucible...</p>\n<p>Nonetheless, Marie had just stepped foot into this crucible, and she was giddy with excitement. The Master-Disciple duo had travelled from Twilight Village to their first stop, Wayward Town. Usually, this would take someone a day or two to complete via carriage or horseback, but the two had completed this journey by foot. Of course, pedestrian travel should have taken much longer, given the abysmal condition of the road connecting the village and the town, yet the duo took exactly a day and a half after a continuous trek.</p>\n<p>\"How do you walk so quickly with a messed up leg?!\" Marie exclaimed as she noticed her Master literally gliding over the ground while still walking with a limp. In response, he chuckled mischievously and overtook her.</p>\n<p>\"Try to keep up, girl,\" he joked.</p>\n<p>\"This Movement Art is extremely-\" she stumbled over her own feet, stopped to catch herself and resumed gliding forward just like her Master. \"-difficult! There are so many processes happening at the same time - breathing, muscle control, timing the steps... And it's so tiring!\"</p>\n<p>\"If you're already getting tired with this short trek, how do you expect to travel all the way to our destination?\"</p>\n<p>\"We're going to walk all the way there?\" Marie blurted out while stopping in her track. \"Nope! Not doing that! Nuh-uh.\"</p>\n<p>\"Then what's the alternative?\" Her Master shot back.</p>\n<p>\"We'll hitch a ride with a caravan or convoy,\" Marie responded matter-of-factly.</p>\n<p>\"Just so you know, I'm not going to involve myself in these shenanigans,\" Krish snorted while waving his hands. \"I can walk all the way there. I don't need a ride.\"</p>\n<p>\"Yeah, yeah,\" Marie evoked sarcastically and resumed the arduous yet hasty glide towards Wayward Town.</p>\n<hr>\n<p>Marie hummed contemplatively as her eyes scanned over the many caravans parked in Wayward Town.</p>\n<p>\"So many choices,\" she voiced out loud.</p>\n<p>\"Just pick one already,\" her Master sighed from behind her. \"They're all Eastward bound anyways.\"</p>\n<p>\"Patience, Master,\" Marie responded. \"Only one of the three here stands a chance to make it past the Serrated-Peaks Mountain Range and into Whispering-Woods.\"</p>\n<p>\"So? If the answer's clear, just pick it and go along with it,\" her Master retorted plainly.</p>\n<p>\"It's not time yet. They won't take us on if we go now. We must wait for-\" Marie elongated the syllable while observing the chosen caravan with increased vigour until eventually, a large procession of individuals started to leave the caravan and moved towards another. \"-that!\"</p>\n<p>Marie noted that the people leaving were the escorts originally hired by the caravan. Their leaving meant that either they weren't being paid enough or they were being paid an even greater amount by the other party hiring them. She looked on as the leader of the escorting group walked out briskly while a frantic figure of a merchant familiar to her jogged behind him and tried to convince him animatedly.</p>\n<p>\"Let's go,\" Marie called out to her Master as she moved toward the merchant.</p>\n<p>\"Jory! How are you?\" Marie greeted the troubled man with a smile. The person in question, Jory, was a stout middle-aged individual with a jutting belly. Although, the worry plastered across his face had scrunched his skin and exacerbated his age.</p>\n<p>The man jerked his neck to track the person calling his name, his hands instinctively twirling his thin and well-trimmed moustache.</p>\n<p>\"Marie? Is that you?\" He asked incredulously as his mind retrieved the name attached to the face before him.</p>\n<p>\"What was that all about?\" Marie asked while gesturing her head towards the now distant escort leader.</p>\n<p>The man sighed in defeat and said, \"Those bastards at Roving stole my escort by paying them an outrageous amount. Can't trust these new Sects, I tell ya! They'll leave you at the drop of a hat - no loyalty at all.\"</p>\n<p>\"So what're you going to do?\" Marie probed.</p>\n<p>\"What can I do?\" He groaned. \"We gotta get through the pass one way or another. And I can't delay the delivery. I guess I'll just have to bite the arrowhead and go at it without an escort.\"</p>\n<p>\"Isn't it dangerous?\"</p>\n<p>\"Of course it is!\" The man shrieked. \"But what can I do?\"</p>\n<p>\"You can take us along?\"</p>\n<p>\"'Us'? You and who else?\" The man shot back with a raised brow.</p>\n<p>\"Me and my Master here- Where is he?\" Marie craned her neck and bellowed. \"MASTER! Here!\"</p>\n<p>Jory noticed a destitute man hobbling over with a limp, responding to Marie's call.</p>\n<p>\"This is your Master? What is he teaching you?\" Jory probed.</p>\n<p>\"Magic, of course,\" Marie answered proudly.</p>\n<p>\"Really?\" Jory voiced his scepticism audibly. \"I don't know Marie-\"</p>\n<p>\"You said it yourself!\" Marie quickly interjected. \"You said that you have no other choice. Here, I just gave you one and that too for free. Don't be so stubborn and think about it. You know me! Do you think I'd throw my eggs into a cracked basket?\"</p>\n<p>Jory revealed a bitter smile and admitted, \"Fine. I'll let you come along. But no funny business, okay? And I ain't doing it for free either. Standard hitchhiking prices.\"</p>\n<p>\"I promise you that you will waive our fees soon,\" Marie declared mysteriously as she guided her Master into the front-most caravan.</p>\n<p>Jory sighed once again as the two walked away. He then continued to lament his misfortune internally and prayed dearly to the ancient spirits so that his trip would go without a hitch. Although, the current turn of events had definitely affected the sincerity of his prayers.</p>\n<hr>\n<p>\"Stop!\" Marie yelled out, loud enough that the entire caravan heard it. In doing so, the whole moving unit came to a sudden halt. Marie could see that the horses were unnerved, even before her call. They were simply moving forward due to the command of their masters, if given the opportunity they would have fled without thought.</p>\n<p>\"What?!\" Jory shot back instinctively. \"Hey! You don't order my caravan around!\"</p>\n<p>\"If you don't want to die, I recommend that you stop this very instant. Another step and your life is forfeit,\" Marie declared morosely.</p>\n<p>\"Are you threatening me?\" Jory growled.</p>\n<p>\"No, I'm trying to save you,\" Marie corrected. \"If you take another step forward from here, you will be in a condition where you can actually play with your guts.\"</p>\n<p>\"Huh?\" Jory exclaimed with a shudder.</p>\n<p>\"Let us wait here for... exactly two hours,\" Marie added.</p>\n<p>\"Two hours?! You can't just stop a caravan on the road for two hours like this. What if someone comes from behind? We're like sitting ducks here, what if beasts or bandits attack?\" Jory started to rattle questions one after the other, without pause. Marie raised her palm and stopped the man's rambling.</p>\n<p>\"If anything goes wrong, I will compensate you,\" Marie assured.</p>\n<p>\"How? You're just a poor orphan,\" Jory snapped instinctively, only to bite his tongue apologetically.</p>\n<p>\"Trust me one more time, why don't you? I haven't led you poorly before. Remember that time I caught the thief siphoning off money from your business?\" Marie reminded. \"Consider this stopping request as paying back for that.\"</p>\n<p>\"Paying back? I paid you handsomely back then for your efforts, our debt is cleared,\" Jory rasped.</p>\n<p>\"Stop arguing for a second and look around you,\" Marie said. \"Do you hear anything? Do you hear any birds? Insects?\"</p>\n<p>At that moment, Jory noticed the eerie silence lingering around them. Although it was broad daylight, the ambience was spine-chilling.</p>\n<p>\"Look at your horses! They're practically shaking,\" Marie said. At that instant, Jory could glean that there was definitely something fishy going around. Like any living being, his sense of self-preservation took hold, and he immediately ordered a two-hour break.</p>\n<hr>\n<p>\"W-What happened here?\" Jory gasped as he saw the gruesome massacre sprawled before him. After the two hours had elapsed the group continued their journey. Within half an hour, they stumbled upon a scenery that would agitate one's lunch to make a sudden exit through the oral cavity.</p>\n<p>\"Thunderbird attack,\" the old man who Marie referred to as her Master opened his mouth for the first time. \"Highly territorial and equally protective of their offspring. Sometimes even more so than Griffins.\"</p>\n<p>\"A Thunderbird did this?\" Jory pulled his eyes away from half a body of a man perched awkwardly on a branch with his intestines snaking downwards.</p>\n<p>\"Two to be exact,\" the old man corrected.</p>\n<p>\"Why would they do this? I thought they never attacked caravans passing through here?\" Jory inquired.</p>\n<p>\"That would be the case. But the caravan before you folk were transporting a Thunderbird egg,\" Krish answered.</p>\n<p>\"A fucking Thunderbird egg? Through Thunderbird territory? Are they insane?\" Jory scoffed.</p>\n<p>\"They were under orders,\" Marie chimed in with a dejected shake of her head as she levitated the body down from the branch and piled it up with a large mound of eviscerated, charred and crushed bodies of the casualties from the Thunderbird attack. Amidst the pile, Jory managed to pick out the distinctive attire of the Sect members who were initially part of his earlier escort group.</p>\n<p>\"Couldn't they have just travelled around the mountains?\" Jory asked.</p>\n<p>\"The egg was close to hatching, they wouldn't have made it in time. They couldn't risk the hatchling imprinting on a random person other than the tamer it was meant for,\" Krish clarified.</p>\n<p>Jory gulped audibly and probed, \"Is this why you asked us to wait back there?\"</p>\n<p>Marie nodded as she pulled out a piece of wood from her bag. She pointed at the pile of bodies and shot forward a steady stream of fire from the wooden stick's tip, engulfing all of them, \"The beasts were at Core Condensation realm. The range of their mana sense ended near that location. If we moved closer, we would have entered their radar and succumbed to their rampage.\"</p>\n<p>Jory instructed his caravan to move around the burning pile. \"Thank you.\"</p>\n<p>Marie walked back to the leading carriage and hopped on. Her morose face cleared up and revealed a sly smile. \"As thank you, why don't you waive our fees?\"</p>\n<p>Jory choked on his spit and descended into a coughing fit. \"You sneaky girl! Fine. But only on the condition that we make it to our destination in one piece.\"</p>\n<p>\"Deal!\" Marie declared as she pushed her palm forward for a shake.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/1zgvr903x78yt73xx0t10o8\">Chapter 221 - State of the True World Sect</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/onv2e24fy9v3ur7plx9fqp6\">Chapter 219 - Road to Upper Management</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}