{"pageProps":{"note":{"id":"q08v7xlng9pz9mogijd6251","title":"Chapter 404 - Two Worlds Collide (From the Inside)","desc":"","updated":1701600421217,"created":1701370481164,"custom":{},"fname":"volume-6.chapter-404","type":"note","vault":{"fsPath":"vault"},"contentHash":"62e306e6f9a3381ebbe22ced3e27613e","links":[{"type":"wiki","from":{"fname":"volume-6.chapter-404","id":"q08v7xlng9pz9mogijd6251","vaultName":"vault"},"value":"volume-6.chapter-405","position":{"start":{"line":127,"column":3,"offset":10959},"end":{"line":127,"column":27,"offset":10983},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-6.chapter-405"}},{"from":{"fname":"volume-6.chapter-403","id":"atbmajglkfq5x8us70djeog","vaultName":"vault"},"type":"backlink","position":{"start":{"line":157,"column":3,"offset":14351},"end":{"line":157,"column":27,"offset":14375},"indent":[]},"value":"volume-6.chapter-404"}],"anchors":{},"children":[],"parent":"24l34m2lf1dxtfcp94uyznb","data":{}},"body":"<h1 id=\"chapter-404---two-worlds-collide-from-the-inside\">Chapter 404 - Two Worlds Collide (From the Inside)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-404---two-worlds-collide-from-the-inside\"></a></h1>\n<p>Guy digested this startling revelation slowly. Although he knew that the underlying purpose for his transmigration was to help elevate this world and eventually give it a fighting chance against an enigmatic invader, he did not realise the magnitude of the entity he was supposed to put up a fight against. These were creatures capable of decimating universes in their entirety. What was one man like him supposed to do to combat that?</p>\n<p>It appeared as though Wei Zao was holding the same thought and said, \"How am I supposed to defeat this... THING?!\"</p>\n<p>[You cannot,] Tron declared. [The probabilities are completely against you. I have run over 1,000,000,000,000 simulations and in 999,999,999,999 of them you lose.]</p>\n<p>\"So there is one?\" Guy intercepted.</p>\n<p>[Nothing is truly impossible. That is one of the laws of every stable world. To account for the random chance of something outside standard happening we have to leave that singular instance untouched. It is purely a ceremonial victory. I cannot tell you the exact steps you need to take in order to achieve that victory,] Tron responded.</p>\n<p>\"So what even is the point?\" Wei Zao snapped back. \"Why was I even brought here? Clearly, it wasn't because I was being given a second chance. But again, how am I supposed to defeat whatever that was? A world much, much more advanced that this one failed to hold out against the invasion. How does this one stand a chance?\"</p>\n<p>Wei Zao suddenly squatted and started to breath heavily, his eyes bursting out of their sockets. Even in the ethereal (non-physical) state, the man was succumbing to a panic attack.</p>\n<p>(I ran a simulation and realised that the 1 out of the 1,000,000,000,000 scenario is only accessible if we introduce a variable that isn't originally present in the system. To put it in simpler terms, all the 999,999,999,999 incidents that failed did not have an entity in it that had the knowledge of the threat and the mechanism by which the threat attacks the world.)</p>\n<p>\"So you're saying that because we as transmigrants have knowledge of the enemy, we possibly stand in a branch of the probability tree that could potentially lead to a win?\" Guy rephrased, while eyeing Wei Zao who was slowly calming down.</p>\n<p>(That is correct. To know the enemy means that the battle is already half won,) Mast affirmed.</p>\n<p>\"It can't be that trivial,\" Guy negated.</p>\n<p>{Although we exist in higher dimension, world builders are rather predictable entities,} Moni joined in. {Our behaviour can be mapped through logical probabilistic reasoning. It makes us boring. The souls that exist in the worlds we build, however, live rather vibrantly. Their decisions don't follow logic all the time. Sometimes, I've seen people choose the world possible option out of handful of choices just because they either wanted it really bad. To us, sentient creatures offer a level of unpredictability that is unmappable. There is beauty in that chaos. And Mast and I believe that this beautiful chaos will give us a fighting chance against this invader.}</p>\n<p>[Though I do not agree,] Tron interjected. [But I have agreed to participate in this experiment because there is literally nothing left for me to lose.]</p>\n<p>\"I-I can't do this,\" Wei Zao finally blurted out. \"This is impossible- It's literally a suicide mission.\"</p>\n<p>{If you cannot do this, then there is no reason for you to stay in this world anymore,} Moni stated blankly. {Prepare to relinquish your body and soul-}</p>\n<p>\"Wait, what?! Are you going to kill me?\"</p>\n<p>{You were already dead,} Moni corrected. {Think of it like moving memory out of storage and into a buffer. I'm now just emptying everything in the buffer.}</p>\n<p>\"T-This is not fair!\"</p>\n<p>\"No, it is,\" Guy cut Wei Zao off. \"Neither you nor I are anyone special. Unless you literally cured world poverty in your past life, neither one of us is special enough to warrant a second chance. We got lucky. And the luck was on borrowed time.\"</p>\n<p>(Would you like to leave? Call it quits?)</p>\n<p>\"No,\" Guy declared with an assertive expression. \"There are a lot of people in this world that I have left to live for. Even if its just waiting it out till the end of days. I can't just abandon them.\"</p>\n<p>[Do what you wish. This world is doomed anyways,] Tron explained.</p>\n<p>\"Can I now reveal my past and the potential dangers accross the horizon to others?\" Guy probed.</p>\n<p>[As I said,] Tron repeated. [Do as you wish. I have prepared everything I can from my side.]</p>\n<p>And with that, the large wisp disappeared.</p>\n<p>\"It seems that your friend is dabbling with nihilism,\" Guy mumbled to Mast.</p>\n<p>(All world builders are nihilists in the end. We don't live so we have nothing to live FOR,) Mast responded. (Tron has accepted his imminent demise. I strongly urge you two to do the same.)</p>\n<p>\"I didn't think you would have such a negative point of view while still trying to help out?\" Guy countered. \"Didn't you bring us here hoping to make some difference?\"</p>\n<p>(Hope... Sure, I guess you can say that. I was hopeful, but I am also realistic.)</p>\n<p>\"So what else have you been hiding from me, huh?!\" Wei Zao bellowed interrogatively to the pink wisp. \"How come he gets such an interactive sys- whatever you are?\"</p>\n<p>{I wasn't really interested in this experiment. It was Mast's idea,} Moni admitted. {He was the one who did the analysis and research before picking Guy over there. You, on the other hand, were just a random pick from my side. You don't matter to me, at all.}</p>\n<p>Those words did a number of Wei Zao as he collapsed into the ground. It was painful to know that what you thought was special was just a fluke. Existential dread and panic attacks both inflicted him at the same time.</p>\n<p>Guy ignored the broken man for a minute and addressed Mast and Moni, \"I'd like to help. I'd like to do everything in my power to protect the world. But I will need your help and some contribution.\"</p>\n<p>(We cannot power you up without destabilising the world. You have to make do with all the resources available naturally and what has been assigned to you.)</p>\n<p>\"I figured that much. But I need information,\" Guy responded. \"Everything there is to know about the attacker and how the previous world fared. A granular log of everything, that's what I need.\"</p>\n<p>{That will be a lot of information,} Moni cautioned. {I don't think you can handle that influx.}</p>\n<p>\"Make it in book form. Mast can add it to the Church of the True World. I will sort through it in my own time,\" Guy explained.</p>\n<p>The two wisps pulse for a while before Mast said, (I will get it done. In the meantime, I will leave the two of you to discuss it out. You will be ejected from this place in exactly five minutes.) And then, the wisps disappeared, leaving Guy and Wei Zao alone in the void.</p>\n<p>\"I... I know that its alot-\" Guy started, but was interrupted by Wei Zao who spoke up with a blank tone.</p>\n<p>\"We've met before. Guy Larks. I remember. We were teaching apprentices together,\" Wei Zao explained. \"When did you come to this world?\"</p>\n<p>\"Around the same time as you,\" Guy answered.</p>\n<p>\"Did you know that I...\" Wei Zao mumbled the final word, but the question was obvious.</p>\n<p>\"I did,\" Guy said.</p>\n<p>\"And you didn't think it necessary to tell me?\" Wei Zao said with a hurt expression. \"You didn't think it was important to let me know that I wasn't alone here?\"</p>\n<p>Guy looked at the man without a ripple on his face. He had no answer to that question.</p>\n<p>\"You could have at least told me that it was all an illusion,\" Wei Zao groaned. \"That all of it was just temporary.\"</p>\n<p>\"I thought you knew...\" Guy answered apologetically. \"I wasn't aware that you were being kept in the dark like this.\"</p>\n<p>\"Yeah... Well... I wasn't as lucky as I thought I was,\" Wei Zao said before standing up. \"I thought that maybe this new opportunity would let me reinvent myself, give me the chance to become someone different - better, in my own perspective. Its clear that it did not. Beneath all that bravado, I am still the very same cowardly man who blamed his environment for his own failings.\"</p>\n<p>\"You see, I used to be a librarian before I died,\" Wei Zao admitted. \"But I barely remember a single book I read that was from the library. I constantly drowned myself in trash novels online written by other jaded individuals like I - I was content living in an echo chamber. And after coming here, I did the same. I indulged myself in the garbage that was going on around me, and my so-called system just helped aggravate that behaviour. People don't change.\"</p>\n<p>He then pointed at Guy and said, \"But you, you are different. This revelation didn't break you down. You still believe that there is a fighting chance. And I know for a fact that you brought over a lot of knowledge from your past life to this world. Verum Trading Company, the True World Sect... I've been following your steps closely, though I failed to locate you.\"</p>\n<p>\"I'll be honest. I didn't reveal myself to you because I was afraid of what you would do,\" Guy revealed. \"You were placed here with a much stronger starting hand. I could not risk my life by fraternising with you. I did not want to get swept away in the waves that you were making.\"</p>\n<p>\"That's understandable. Nowadays, I think a lot about how I used to behave - about some of my impulsive actions,\" Wei Zao said with a chuckle. \"You know, you can only complain about the world being unfair for so long, before you realise that maybe you are the problem all along. I've had to fight off SO. MANY. ENEMIES. It became exhausting. I defeat one, and three others sprout from the debris through some faint or nonsensical connection. I thought I was different from those idiotic characters from the trash novel I used to talk shit about in my past life. But evidently... I am not.\"</p>\n<p>He then looked straight into Guy's eyes and said, \"Guy Larks. I need your help. I like this new life of mine. I don't want it to end. I am useless against it, I can admit that much. I, personally, give up. But you haven't, and I admire that. So, I am deciding to place all my chips on you.\"</p>\n<p>\"What-\"</p>\n<p>\"From this point on, till the invasion either destroys all of us or disappears altogether, I am yours to command and use in any way you deem fit,\" Wei Zao declared.</p>\n<p>\"You're placing a lot of trust in me,\" Guy said with a bitter smile. \"We've only just me.\"</p>\n<p>\"I know. But what other option do I have?\" Wei Zao said with an unburdened laugh. And suddenly, he disappeared. It seemed as though the time had elapsed.</p>\n<p>Guy felt himself getting sucked though a chute again, and he finally found himself back in his body. He barely had enough time to collect himself before a voice nudged him out.</p>\n<p>\"What is that?!\" Grace yelled from his side as she pointed towards the sky. A tear had formed, revealing the same void Guy had just left. And like a lightning strike, it descended onto the earth somewhere in the forest nearby.</p>\n<p>\"T-The children!\" Grace mumbled in shock. \"G-GUY! Dora, Kano and Kili! T-They-\"</p>\n<p>Guy didn't need another word of explanation, as his feet burst forward through pure instinct.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/8uct65roo2vtc1hcog5dbtr\">Chapter 405 - Manufacturing Fate</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/atbmajglkfq5x8us70djeog\">Chapter 403 - End of the World</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}