{"pageProps":{"note":{"id":"qEo69pHIY4jtm3in2o599","title":"Chapter 117 - Same-Day Delivery","desc":"","updated":1643657498779,"created":1643655222916,"custom":{},"fname":"volume-2.chapter-117","type":"note","vault":{"fsPath":"vault"},"contentHash":"6c7a9494b160a1ac843a567b66c7fe5c","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-117","id":"qEo69pHIY4jtm3in2o599","vaultName":"vault"},"value":"volume-2.chapter-118","position":{"start":{"line":79,"column":3,"offset":10616},"end":{"line":79,"column":27,"offset":10640},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-118"}},{"from":{"fname":"volume-2.chapter-116","id":"pIgMOz5OH9thHBn1akX44","vaultName":"vault"},"type":"backlink","position":{"start":{"line":155,"column":3,"offset":12767},"end":{"line":155,"column":27,"offset":12791},"indent":[]},"value":"volume-2.chapter-117"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-117---same-day-delivery\">Chapter 117 - Same-Day Delivery<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-117---same-day-delivery\"></a></h1>\n<p>\"Mister Zola! It's good to finally meet you!\" Goran greeted the much leaner man before him by grasping his extended hands firmly and shaking them.</p>\n<p>\"Clan Leader Rasmus! The pleasure is all mine!\" The man replied with reverence and respect in his voice.</p>\n<p>\"Please take a seat. The steel weapons and armours sold at the Buring Forge were well received by the clan. Most of our retained warriors have switched over,\" Goran commented as he welcomed the man towards a seat in the salon.</p>\n<p>\"That's good to hear! But I don't deserve the full credit, it was primarily Teacher Larks' initiative in developing steel after all,\" Karmin replied with a humble bow, seamlessly switching the direction of the conversation towards a common ground.</p>\n<p>Karmin was a smart businessman. Ever since the debut of the miraculous alloy known as steel, his business had been growing at an unprecedented rate. It was an unbelievable phenomenon, well beyond his own estimates. It first started with the standard weapons and armour sales. It took some time, and a lot of early investment, in marketing and convincing the population of the strength and equivalency of steel to Dwarven metal - given how the guild basically washed its hands of the entire situation.</p>\n<p>But following the first few sales, things started to pick up organically. After all, quality always stands out, and steel was everything it was proclaimed to be. With the low cost of production, in both materials and manpower (thanks to Teacher Larks' magic-based streamlining), Karmin was able to transform nearly his entire iron backlog into steel in one fell swoop.</p>\n<p>As more and more people started to indulge in The Burning Forge's steel equipment, Karmin inevitably attracted the attention of the haughty enchanters from the Smithing and Enchanting Guild. While before, Karmin was starved for choices, he was now facing an abundance! Some of those clowns who berated him to his face and shoved him out were now lining up to meet him whenever he graced the halls of the guild. They had no choice! Thanks to his advantageous contract, Karmin held a monopoly on steel - for the time being anyway.</p>\n<p>After siphoning through a boatload of possible applicants, Karmin settled on three promising and innovative enchanters who offered interesting avenues of research and development during their interviews. Unfortunately, they were only 1-star license holders, but Karmin saw potential in them and decided that it would be worthwhile to bankroll their advancement and thus tie them down to The Burning Forge.</p>\n<p>And this gamble turned out to be successful, as not a month later, The Burning Forge released their first line of enchanted weapons and armours. Through some trial and error, the enchanters found out that steel tended to form mana channels quite easily. Through some gentle nudging during the forging process, they could very easily define the channels required to facilitate the enchantments. The qualities of these mana channels rivalled those of more expensive alloys that were more conducive to enchantment due to having this same characteristic.</p>\n<p>With this, The Buring Forge outputted a large quantity of low-cost high-quality enchanted gear that dominated the \"budget enchanted equipment\" market segment by a large margin. Karmin was satisfied with this because he knew that the high-end and bespoke market segments were where the bigger companies backed by years of history in their front pockets and one or more veritable mage powerhouses in their back pockets thrived.</p>\n<p>Karmin was infinitely grateful towards Teacher Larks. It was only because of his input and guidance that Karmin was able to bridge the empty gaps in his research and produce the revolutionary metal alloy. Luckily, Karmin recognised Teacher Larks' potential that day and formed an early connection with him. In fact, although Karmin was losing a significant percentage of profits to Teacher Larks, he wasn't the least bit affected or concerned. Karmin knew that Teacher Larks would go far. This was just a trifle amount to secure his own seat in Teacher Larks' coattail as he rose to the top!</p>\n<p>But that wasn't enough. Karmin recognised that in order to properly secure his position in this ride destined towards greatness, he needed to take additional steps to ingrain himself further. So, Karmin didn't waste any time in researching Teacher Larks' backgrounds and connections. Surprisingly, he ended up falling short! The man literally sprung out of nowhere, with no history or family anywhere in sight. In many ways, Karmin was reminded of himself.</p>\n<p>'A self-made man!'</p>\n<p>Hence Karmin expanded to the second degree - friends of friends. The only noteworthy connection Teacher Larks had was Teacher Jeeves. Even his student was an orphan from a far-off village. Teacher Jeeves never exposed himself to the public often, so Karmin wasn't left with many options chasing that lead. BUT, Karmin's highly effective network of agents did bring forward an interesting prospect. Apparently, the highly elusive Teacher Jeeves had an acquaintance with the current clan leader of the Rasmus Clan. It took some additional subtle probing and greasing a few hands with gold to substantiate this, but ultimately it was unearthed!</p>\n<p>Without wasting a moment, Karmin immediately took action to build a new bridge. He did so in the only way he could, by throwing money and hoping that it stuck! Admittedly, it was a nouveau riche strategy often relegated as crass, but what other options did Karmin have? Karmin wasn't so lucky to be born with generational wealth, or an influential and powerful family, to build traditional relations with the Rasmus clan. The fact that Goran was entertaining Karmin in his clan mansion's salon did not alleviate Karmin's stress either. This was because Karmin knew that Goran was knowledgeable of his attempts to entrench himself in the Rasmus clan's graces as a way to tie himself to Teacher Larks.</p>\n<p>Ultimately, this was the only option for Karmin. He knew that his life was limited, and unless he spawned a progeny sometime soon, The Burning Forge would disappear after his passing. And should such an event come to pass, if his company was tied to the much older Rasmus clan, then it would at least propagate albeit under the clan's seal.</p>\n<p>\"Speaking of, I recollect that Teacher Larks placed an order with The Burning Forge for a few crafting materials?\" Goran redirected stalled conversation.</p>\n<p>\"Right, I received Teacher Larks' mail for wood from the Menryl tree and sinews from the Illuminescent Banyan, as well as an assortment of mana-gems, enchanting tools, and some ink ingredients as well,\" Karmin affirmed.</p>\n<p>\"With regards to the cost-\"</p>\n<p>\"Please do not worry about that! Teacher Larks explicitly indicated to deduct the expenses from his account,\" Karmin interjected.</p>\n<p>\"I was worried about that...\" Goran muttered. \"I would like to pay on Teacher Larks' behalf.\"</p>\n<p>\"That...\" Karmin stuttered. This was going to be tough! For one, he wanted to respect Teacher Larks' instructions, but on the other hand, he couldn't afford to offend the leader of the Rasmus clan.</p>\n<p>\"Clan Leader Rasmus,\" Karmin said as he shifted slightly in his seat. \"Teacher Larks was adamant about this condition. He even went as far as to stress on it in his letter.\"</p>\n<p>Goran clicked his tongue in defeat and said, \"Forget it then.\"</p>\n<p>\"Teacher Larks did include something else with the mail!\" Karmin said and snapped his fingers multiple times as a discreet signal. Following a small pause, the doors to the salon opened and a large man bedecked in a pristine, fully-covered, enchanted armour walked in, carrying with him a jewel-crested metal box with four sets of locks and a series of both inconspicuous and blatantly visible locking and trap enchantments. Based on the bearing with which the object was carried in, Goran figured that it was probably something of high value.</p>\n<p>The metal-covered man gently lowered the container in front of Goran, leaving a sufficiently large gap between them, and proceeded to unlock the physical locks using a set of keys produced from an off-coloured bag hanging by his thighs. After opening the third lock, he turned towards Karmin, who jolted in his seat and retrieved the final key from a necklace hanging around his neck.</p>\n<p>\"Teacher Larks sent for this just yesterday. I commissioned a rapid-transit courier service to facilitate same-day delivery: Swiftus. I opted for the most secure and safe delivery categories too,\" Karmin added.</p>\n<p>The kneeling metal man grasped the extended key and unlatched the last lock. Following that, the man worked through the plethora of enchantments in seemingly random order. In actuality, there was a particular sequence that shifted at fixed intervals that only he knew. If the unlocking process didn't follow the set sequence, the box would not only combust and destroy the materials within, it would also destroy everything in a 500-metre vicinity. The man, however, worked without a moment of doubt or pause, or even fear of death!</p>\n<p>Once the last enchantment was lifted, the container's lid opened up from the centre, releasing a translucent mist of mana that gushed out. The armoured man then activated a simple |Levitate| cantrip, causing a cloth-wrapped stack of objects to rise from the container. The man directed the stack on top of the table and gently lowered it. He then followed it up with a flourish of his hands causing the cloth to unwrap slowly, revealing a magnificent stack of books.</p>\n<p>\"Teacher Larks told me that he recently recollected a few interesting books during his meditation, thanks to his 'inheritance'. He said that you and his ward, Kano Reva, would find it interesting?\"</p>\n<p>Goran's eyes sparkled as they fluttered over the titles on the bound books before him:</p>\n<p>\"Impressionism: Van Gogh, Monet and Many More\"</p>\n<p>\"Deciphering Expressionism\"</p>\n<p>\"Extending Realism\"</p>\n<p>Those were just a few of the many, many other books in the stack. As he observed the bindings and the covers, Goran finally recollected what they were! He had seen Jean reading through ones like these before. They were bound similar to Teacher Larks' standard textbooks!</p>\n<p>After reading through the first book to the halfway point right then and there, Goran's eyes widened in excitement, \"Such interesting theories on visual art! These books are truly priceless! You did a wonderful job in preserving them during transit, Mister Zola. Truly, thank you!\"</p>\n<p>Karmin pumped his fist internally, in celebration. He had made the right decision! Sure, commissioning the courier cost him a pretty fortune, but it was all worth it!</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/cjUTLLpZU2yEMddVN6CXr\">Chapter 118 - Family Troubles</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/pIgMOz5OH9thHBn1akX44\">Chapter 116 - Fated Master and Disciple</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}