{"pageProps":{"note":{"id":"qO2jYePbWzwJIXCJQb8oZ","title":"Chapter 015 - Modular Spellmaking","desc":"","updated":1643571993159,"created":1643568796926,"custom":{},"fname":"volume-1.chapter-015","type":"note","vault":{"fsPath":"vault"},"contentHash":"97c34a5be4e13f5aa62322dc96dd861d","links":[{"type":"wiki","from":{"fname":"volume-1.chapter-015","id":"qO2jYePbWzwJIXCJQb8oZ","vaultName":"vault"},"value":"volume-1.chapter-016","position":{"start":{"line":107,"column":3,"offset":11570},"end":{"line":107,"column":27,"offset":11594},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1.chapter-016"}},{"from":{"fname":"volume-1.chapter-014","id":"mIndx5mdVMVtshezhI3zL","vaultName":"vault"},"type":"backlink","position":{"start":{"line":110,"column":3,"offset":9313},"end":{"line":110,"column":27,"offset":9337},"indent":[]},"value":"volume-1.chapter-015"},{"from":{"fname":"volume-1.chapter-051","id":"oeEfhZPAqqm1MUWXmGMhi","vaultName":"vault"},"type":"backlink","position":{"start":{"line":89,"column":3,"offset":9105},"end":{"line":89,"column":27,"offset":9129},"indent":[]},"value":"volume-1.chapter-015"}],"anchors":{},"children":[],"parent":"YmDf44XQK0snHWr4HCNuj","data":{}},"body":"<h1 id=\"chapter-015---modular-spellmaking\">Chapter 015 - Modular Spellmaking<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-015---modular-spellmaking\"></a></h1>\n<p>Guy picked the first component shape on the list and tried to cast it in isolation. With circle-based magic, this was possible as long as the spell could be standalone. Some components had dependencies. For those spells, Guy would have to work backwards and cast the dependencies in tandem with it.</p>\n<p>While the RoK greatly amplified his rate of progress, it was technically considered an isolated space. His body was not physically present in here, only his consciousness was. Therefore, Guy had to alternate between the RoK and the real world when testing the spells. And so, Guy optimised the process by grouping up spells together and testing them in bulk to reduce the number of transitions.</p>\n<p>As Guy went through the process, he gradually started to understand the perspectives of the people indigenous to this world. For them, magic was an arcane process in which the end justified the means. With things that didn’t make any sense to them, they simply chose to overlook it since all they cared about was the outcome.</p>\n<p>“This spell creates fire…Why? Who cares! It makes fire, that’s all that matters,” was the common thought process.</p>\n<p>While there were groups that specialised in spell research and development, the way they went about it lacked generalisability and repeatability. Essentially, their methodology was unique to the school of magic they were trained in, and an outsider would not be privy to the process. This inevitably led to a regression in the rate at which new spells were developed.</p>\n<p>Unlike back in Guy’s original world, where knowledge was accessible at everyone’s fingertips, this world, which was still stuck in the middle ages, kept knowledge on a need-to-know basis.</p>\n<p>Ultimately, this problem was circular. Without dispersion of knowledge, there was a lack of varied perspectives, resulting in technological stagnation. And the advancements that did occur, happened at a snail’s pace.</p>\n<p>Thanks to Guy’s out-of-this-world experiences, and with the help of the RoK and the technology within it, Guy was able to approach the problem with a unique perspective.</p>\n<p>As a modern man who was initiated in the scientific process, Guy was able to systematically go through the decomposed component shapes and take pertinent notes on their purpose and effects.</p>\n<p>After a primary run through the components that worked in isolation, Guy realised that in each fire-based spell, there was a component that infused inflammable properties to mana. This produced what the locals called fire-infused mana or mana attuned to the fire element. There were additional properties to the mana such as conductivity to heat, which were implicit.</p>\n<p>What Guy realised was that the magic in this world went for a one-size-fits-all solution.</p>\n<p>“Want to make a fire? Well, first let’s change a part of your mana to become inflammable. And while we’re at it let’s make it conductive. Oh, and why not make it volatile. And I almost forgot, the fire needs to burn continuously, lets add an oxidising agent as well!”</p>\n<p>Guy felt that the whole idea was redundant. There were already inflammable compounds in the air, there was also oxygen to sustain it. Why bother changing mana if a resource is already available with all the required properties?</p>\n<p>The dependent components that followed added to this base infusion step and performed actions such as compression, dispersion, concentration, diffusion, repulsion, attraction, energising, de-energising, and so on. Those were the names Guy gave to those spells since their purpose was implicit in their effect. </p>\n<p>Guy decided to categorise these components as “Action Components”. They performed specific actions and were dependents. In order to gauge their effects, Guy used a basic spell called |Inspect|. It was considered a cantrip, but it was moddable to perform different tasks. Guy modified |Inspect| to observe the molecules of the substances in the area affected by the spells.</p>\n<p>He then documented those Action Components for later use.</p>\n<p>After that, Guy moved on to the less frequent component shapes captured by the decomposing algorithm. </p>\n<p>Most of them were duds and didn’t have any purpose in the grand scheme of things. But the ones that stood out, were dubbed \"Source Components\" by Guy.</p>\n<p>These Source Components were different from Action Components because they were independent. By design, they appeared similar to the fire-infusion component. But instead of sourcing mana, they sourced naturally occurring substances.</p>\n<p>For instance, one Source Component appeared to draw in a large quantity of air from the environment to increase the size of a |Fireball| spell.</p>\n<p>And so, Guy scoured through the folders and managed to gather a list of Source Components.</p>\n<p>This entire time, Guy had a particular goal in mind. When he worked as a teacher, he primarily taught kids who were in elementary school or middle school. While he did teach a few high-school courses, he preferred interacting with little kids over those hormone-fueled monsters. Furthermore, his charity efforts were geared towards increasing the base educational level and inevitably forced him into that speciality.</p>\n<p>As a teacher, Guy aimed to increase the approachability of knowledge to those that didn’t explicitly show any interest in learning. For little kids, going to school and sitting in classes was simply a chore. It was something they had to slog through.</p>\n<p>It was his job as a teacher to make them interested and capture their curiosity. To accomplish this, Guy would regularly scour various teacher forums and discussion boards to find novel ways to engage his students.</p>\n<p>One of the topics he found most difficult to teach kids was coding and programming. In the age of information, working with technology and automation had become commonplace. It was almost impossible for someone to survive in a competitive STEM industry without having some knowledge of how to code. So it was inevitable for the topic to enter the school’s syllabus.</p>\n<p>At first, it was only a high-school requirement. But over time, the topic began to breach into middle schools, and finally into some elementary schools.</p>\n<p>One can only imagine how hard it was for a teacher to get a child interested in printing “Hello World” on their monochrome consoles windows.</p>\n<p>To them, the conveniences provided by knowing a programming language were irrelevant. It just wasn’t exciting enough to learn. Guy blamed the media for glamorising the idea of programming for the layman. Typical coding sessions seldom involved flickering screens, lines of scrolling text, and intense techno music.</p>\n<p>In Guy’s experience, a typical coding session usually meant hours of cursing at his screen, downing cans of caffeine-filled energy drinks, sleepless nights, and frantic searches on StackOverflow.</p>\n<p>So the question at hand was: How to get kids interested in coding? </p>\n<p>Guy found that kids preferred it when their work displayed tangible results. Most of the time with coding, the results were abstract. Things happened on the screen, and lines of text were spewed out. They weren’t interesting at all.</p>\n<p>From various forum threads, Guy managed to find a coding framework perfect for kids called \"Scratch\". It was a programming language that was completely visual.</p>\n<p>It contained specialised blocks that performed specific tasks and could be chained to form a script or a function. The best part was that the result of running a script was automatically evident in a graphical user interface. It was also possible to program peripherals using this language.</p>\n<p>Introducing that kid-friendly programming language showed immediate results in his classroom. His students started to take initiative and came up with novel projects. The best part was that when those students reached a higher level and learned of the inherent limitations in the language, they were able to assimilate advanced languages more easily.</p>\n<p>Guy’s end goal in his current endeavour was to develop a method to create spells similar to the way Scratch worked. He already had “blocks” that performed actions, and blocks that were sources. He wanted to figure out a way to efficiently put these together and still have a functioning spell.</p>\n<p>Based on his observations, the spells had to have a circular construction to work. He didn’t know if it was a strict requirement, but it was a plausible conclusion given the lack of spells that suggested otherwise.</p>\n<p>So in his experiments, he started with a large circle. Next, he began to fill in the circle with the components for a simple spell that compressed air and rotated it into a ball in the palm of his hands.</p>\n<p>He first placed the components in a symmetric pattern inside the circle. He then tried to activate the spell, but it failed to even initiate. It was a complete dud.</p>\n<p>After pondering on it for a bit, Guy hypothesised that a specific ordering was required. Just placing the components didn’t provide a proper sequence for the components to activate. It didn’t make sense for air to compress before actually sourcing it.</p>\n<p>And so, he connected the components using straight lines and achieved some success. Although a ball formed in his hand. It was unstable. It would frequently flicker and would disperse intermittently.</p>\n<p>After activating the spell a few more times, Guy found out that the result was because of a sudden interruption in the influx of mana. Compared to published spells, this construct would often sputter. If the spell construct was equated to a long and winding length of tubing, it was as if there were sudden knots in between causing the water pressure to build up and disperse irregularly.</p>\n<p>Guy wasn’t knowledgeable enough to figure out the nitty-gritty details of the whole spell casting process. His current methodology was purely led by his preconceived logic and concepts. So after getting stuck at such a critical juncture, he began to push his mind to come up with a suitable solution.</p>\n<p>“The components work. The spell circle works. Then what is causing the mana flow to choke? It most likely has to do with the interconnects between the components…”</p>\n<p>As he spoke out loud, Guy was struck by a sudden thought! “Is it because the connections aren’t closed?”</p>\n<p>This idea sprouted from his understanding of modern electrical circuits. Guy equated the spell components as electrical components in a circuit, mana as current, and mage as the energy source. With that analogy, it made sense to him that the lines which connected the components must form a closed-circuit. The existing set-up left everything open; there wasn’t a line joining the last component with the first component.</p>\n<p>With that in mind, Guy redrew the spell circle. Before placing the components, Guy drew a star with the same number of corners as the number of components being placed. When drawing it, he never lifted his writing utensil; it was drawing in a single line. He then placed the components on the heads of the star and activated the spell.</p>\n<p>Eureka! It worked!</p>\n<p>Guy congratulated himself and performed an impromptu dance solo in the confines of his RoK.</p>\n<p>After a quick 5-minute dance break, Guy calmed himself and started to create a |Fireball| spell using his newly developed method.</p>\n<p>But Guy faced a roadblock. In nearly all the Source Components, there were fragments of Ancient Tongue that provided targeting. If Guy wanted to source oxygen from the air, he would need to include it in the Source Component. But the problem was he didn’t know what oxygen was called in Ancient Tongue as it was a dead language.</p>\n<p>\"What to do now?\" Guy muttered solemnly.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/5sxwl5rw0nlcp8tdi3iy0kf\">Chapter 016 - Bane of Students... Maths</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/mIndx5mdVMVtshezhI3zL\">Chapter 014 - Giving Up</a></li>\n<li><a href=\"/TGT/notes/oeEfhZPAqqm1MUWXmGMhi\">Chapter 051 - Spellcasting in HD</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}