{"pageProps":{"note":{"id":"R8Qvpi58K6esp1Ojm9mc9","title":"Chapter 096 - Learning by Teaching","desc":"","updated":1643657017413,"created":1643653697831,"custom":{},"fname":"volume-2.chapter-096","type":"note","vault":{"fsPath":"vault"},"contentHash":"a794410885e2fe9e0aca254ca421b224","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-096","id":"R8Qvpi58K6esp1Ojm9mc9","vaultName":"vault"},"value":"volume-2.chapter-097","position":{"start":{"line":183,"column":3,"offset":12692},"end":{"line":183,"column":27,"offset":12716},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-097"}},{"from":{"fname":"volume-2.chapter-095","id":"QMEaQXgNgPUbAcElwm2Rx","vaultName":"vault"},"type":"backlink","position":{"start":{"line":111,"column":3,"offset":9889},"end":{"line":111,"column":27,"offset":9913},"indent":[]},"value":"volume-2.chapter-096"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-096---learning-by-teaching\">Chapter 096 - Learning by Teaching<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-096---learning-by-teaching\"></a></h1>\n<p>Guy's intention with a preliminary assessment was to understand the breadth of his student's basics. Without a standardised curriculum for education, Guy needed to understand how much Jean and Marie knew already, and to what extent their prowess was in those topics. While Guy didn't mind teaching them only on an individual basis, the strategy wasn't scalable. As his class strength increased it would be more efficient to first establish a baseline as a starting point and then build up from there.</p>\n<p>\"The first topic I want to test everyone on is Mathematics. I am sure that both of you must have already covered basic arithmetics. I want to know how far your knowledge extends beyond that. Attempt as many questions as you can. The questions grow increasingly harder as you progress, so stop if you can't go any further,\" Guy instructed.</p>\n<p>The two girls nodded seriously and turned open the first page of the workbook. Marie went to work on the question quickly, without a moment of thought. Jean on the other hand worked at a measured pace. By the time Marie started on the second question, Jean had just begun answering the first.</p>\n<p>Guy didn't bother micromanaging the two, and let them go about their business. He sat down at his desk up front and began compiling the test for the next set of subjects for the girls. Markus pulled out a book Al had brought with him about \"Multidimensional Spellcasting\". It was a relatively recent publication that talked about spells that consisted of multiple layers of individual spell circles that worked in conjunction.</p>\n<p>The pleasant sound of two quills scratching against paper emanated from the open-air classroom. Through the variations in the sounds, Guy could decipher two distinct natures. One sound was mechanical and rhythmic. There were frequent, yet minute pauses between them, but the sound would resume with a square cadence without a misstep.</p>\n<p>The other sound was flowing, yet measured. There was no frivolity, however, there was a distinct lack of uniformity. Yet even with its fluid nature, there was conciseness in it. This sound also had more frequent and increasingly longer pauses compared to the first one. Guy could feel a growing sense of uncertainty and frustration as time progressed.</p>\n<p>Guy lifted his gaze and followed the source of the second sound, which was Jean. Even through her unflinching facade, Guy could feel rising anxiety and distress radiating out from her. Her free hand was becoming increasingly fidgety, with her fingers clawing away at the skin adjacent to her thumb.</p>\n<p>\"Is there a problem, Jean?\" Guy asked, causing Jean's head to jerk up in shock.</p>\n<p>\"Huh? I... ummm,\" Jean muttered under her breath while averting her gaze.</p>\n<p>\"It's alright, you can tell me,\" Guy said in a calm voice with a warm smile.</p>\n<p>Jean bit her lips and spoke up, \"I'm stuck... I can't seem to answer any more questions.\"</p>\n<p>Her shoulders dropped in defeat, her eyes boring down on the workbook which was barely a quarter of the way in.</p>\n<p>Guy nodded and assuaged her by saying, \"That's okay! I didn't expect you to answer all of them.</p>\n<p>He then called out to Markus, \"Markus! Can you help Jean out? I want you to teach her everything properly and bring her up to speed. She should be thorough with the contents covered in that workbook. If you need any more resources or practice questions, then let me know, alright?\"</p>\n<p>Markus' head jolted up from his book. He absorbed his Master's complete instructions and nodded affirmatively. He moved up next to Jean's seat and dragged it closer to her.</p>\n<p>With the boy barely an arm's length away, Jean suddenly grew flustered. It was her first time being near a person of another gender who was of her age.</p>\n<p>Before her mind could dwell on that thought any further, Markus' voice pierced through, \"So where did you get stuck?\"</p>\n<p>Jean shook her wandering thoughts and quickly shuffled through the pages. Although she had made it thus far, Jean suspected that some of her earlier attempts weren't completely correct. And her guess was proven true when her Senior Brother clicked his tongue, \"Tsk, you've used a roundabout method here. Because of this additional step, you've opened yourself up to unnecessary errors such like over here.\"</p>\n<p>He then proceeded to correct Jean's mistake and rushed through the partially correct question, stopping at her last attempt.</p>\n<p>\"So you don't understand this question?\" Markus asked.</p>\n<p>\"This question deals with a topic in maths known as Algebra. It is basically a method you can use to solve problems where you don't know the value of all variables present,\" Markus rattled on.</p>\n<p>\"A variable is a symbolic representation of the unknown. It doesn't hold any numerical significance. The main goal with Algebra is to isolate this variable on one side of the equation so that we can determine its value.\"</p>\n<p>In the beginning, Jean nodded along as Markus explained the nuances of Algebra. However, after a point, her nods became infrequent until they stopped completely.</p>\n<p>\"So let's try an example: 3x+2 = 5, solve for x,\" Markus instructed as he quickly jotted down the equation on a free page.</p>\n<p>Jean stared at the question for while, her hand growing increasingly fidgety.</p>\n<p>\"Ummm,\" she murmured while biting her lips.</p>\n<p>\"Tsk, you need to isolate the x! How do you do that?\" Markus shot out with a trace of irritation.</p>\n<p>\"Let the girl think, will ya?\" Marie's voice responded with an equal amount of irritation laced within it.</p>\n<p>Markus ignored Marie's outburst and kept his focus on Jean.</p>\n<p>After another minute of inactivity, Markus interjected with a more stern tone, \"You subtract 2 from both sides...\"</p>\n<p>\"Right...\" Jean chimed in as she hurriedly jotted it down on the page.</p>\n<p>After half a minute of inactivity, Markus growled, \"What next?\"</p>\n<p>\"Stop it with the badgering! You can't expect her to answer the question right away. If I remember correctly, it took you at least a week to properly understand these types of questions,\" Marie retorted.</p>\n<p>\"Marie!\" Markus bellowed.</p>\n<p>\"Did you just call me by my name?!\" Marie barked.</p>\n<p>The two descended into a heated argument, with poor Jean stuck in the middle.</p>\n<p>\"ENOUGH!\" Guy hollered while slamming his hand on the desk. \"You two! Out with me! NOW!\" He followed up with a firm tone.</p>\n<p>Markus and Marie shrank back into their bodies at Guy's sudden shift in temperament. They fearfully stood up and followed Guy out of the confines of the area, and went behind the orphanage wall.</p>\n<p>Guy drilled his stern gaze at the two culprits and started, \"What are you guys doing? Huh?\"</p>\n<p>\"Master, she keeps interrupting me when I'm trying to teach Junior Sister Jean,\" Markus replied.</p>\n<p>\"Teach? Is that what you call teaching? You're just screaming at the poor girl!\" Marie responded.</p>\n<p>Before the two could break out into an argument once again, Guy interrupted them, \"Enough!\"</p>\n<p>After a long sigh, Guy explained, \"Markus. Do you know why I asked you to teach Jean? It's not because I'm lazy, or because I'm unwilling to teach her. I want you to think back to your interaction with her, but take a step back and thoroughly criticise your approach. Do you think you think you were teaching her effectively?\"</p>\n<p>\"But Master, I explained the concept to her properly-\"</p>\n<p>\"Did she understand it when you explained it?\"</p>\n<p>\"She did, right?\"</p>\n<p>\"How do you know? Did you test her understanding? Did you confirm that her comprehension was proper and thorough?\"</p>\n<p>Markus hesitated, and shook his head, \"I did not.\"</p>\n<p>\"My purpose in letting you take the lead here was to cultivate an important value in you. Patience,\" Guy added.</p>\n<p>\"We've covered a lot of ground in the span of a single year. At the pace we are going, we can cover even more distance. However, it isn't sustainable! If we continue like this, we will be building upon a shaky foundation, and it will open us up to disastrous consequences in the future. Therefore, we must first shore up our concepts thoroughly before moving ahead. The best way to do that is by conveying the knowledge we've gained to another party. By breaking down your insights and moulding them for the other party to understand, we can further enhance our comprehension of the topic.\"</p>\n<p>Markus vocalised a hum in affirmation as an epiphany struck him.</p>\n<p>\"I want you to go back, and start again. Your goal is to make Jean understand everything. She should have such a strong grasp on the topic that she should be able to teach it to another person with equal efficacy!\" Guy commanded amidst Markus' vehement nods.</p>\n<p>\"And you, why do you keep interrupting Markus when he is doing the task I assigned him?\" Guy resumed as he turned his gaze to Marie who had a smug smile on her face.</p>\n<p>Her grin quickly dissipated as she fielded the interrogating question, \"I was agreeing with your assessment. Markus wasn't teaching properly-\"</p>\n<p>\"That's not the task I gave you, was it?\"</p>\n<p>\"But-\"</p>\n<p>\"Marie! By interrupting Markus and undermining him constantly, you are effectively lowering his authority in front of Jean. Would she feel compelled to listen to Markus if you're building up such a poor image of him in her eyes?\"</p>\n<p>\"I...\"</p>\n<p>\"I understand that you have a sense of responsibility for everyone here, but while you're in my classroom, I need you to act like a student. That means to respect everyone and treat everyone equally. Rather than diverting your attention and preoccupying yourself with other people's business, I need you to focus on your work. Can you do that for me?\" Guy added.</p>\n<p>Marie nodded affirmatively and quickly replied, \"I'm sorry. I won't do that again.\"</p>\n<p>\"Good. Now you two, let's go back and continue with our work.\"</p>\n<p>\"I've already completed all the questions,\" Marie commented as they returned to the class.</p>\n<p>\"All of them? So quickly? Do you want to recheck them?\" Guy asked to clarify.</p>\n<p>Marie shook her hand and said, \"No need.\"</p>\n<p>Guy affirmed with a hum and collected her completed workbook. After glancing at a few intermittently spaced questions, Guy nodded with an impressed expression. All of them were attempted properly and answered correctly. Even the final question, which was supposed to be the toughest, was answered fully and without a single error.</p>\n<p>\"You're good!\" Guy commented.</p>\n<p>\"Thank you, I've had some practice,\" Marie answered humbly.</p>\n<p>\"I can see that! Would you like to continue? I have another set with a few topics that might be a bit new to you,\" Guy asked.</p>\n<p>\"Sure!\" Marie responded with visible excitement.</p>\n<p>While the two conversed, Markus returned to his seat next to Jean and spoke apologetically, \"I'm sorry about earlier. I realised that my approach was incorrect.\"</p>\n<p>\"N-No, that's okay...\" Jean blurted out subconsciously while waving her hands.</p>\n<p>\"Let's start again from the beginning, okay? I believe I skimmed through a few sections before. If we shore our concepts from there, you may find Algebra much easier to digest.\"</p>\n<p>Markus turned to the page he had skimmed through earlier and contemplated on his next approach.</p>\n<p>\"Negative numbers are... Right! Think of numbers as the state of your stomach! When you eat too much, you feel bloated. When you eat too little, you feel starved. The feeling of bloat is analogous to positive numbers. The feeling of starvation is analogous to negative numbers. When you're feeling starved, as you keep eating food, you feel more and more full, until you feel neutral. That's like starting on the negative number on the numeric scale and adding positive numbers to it, till you reach zero,\" Markus said with a trace of unsurety near the end.</p>\n<p>\"Does that make sense?\"</p>\n<p>Jean snorted good-naturedly at Markus' humorous explanation and answered, \"It makes sense.\"</p>\n<p>Markus smiled with elation as he exclaimed, \"Great!\" and instinctively raised his hand towards Jean for a high-five.</p>\n<p>Jean stared blankly at Markus' open hands.</p>\n<p>\"Tap it!\" Markus instructed.</p>\n<p>\"Huh?\"</p>\n<p>Markus sighed and grabbed onto Jean's hand, causing the girl to flush beet-red almost immediately. He then proceeded to clap her hand against his own.</p>\n<p>\"Like that! It's a high-five! You do it to celebrate an accomplishment,\" He explained.</p>\n<p>\"Y-Yes, Senior Brother,\" Jean muttered.</p>\n<p>\"Woah! Your face is all red! You're heating up-\"</p>\n<p>\"I'm going to drink some water!\" Jean exclaimed as she immediately rushed out of the classroom while covering her face.</p>\n<p>\"What did you do to her now, you brat?\" Marie said jokingly after observing their interaction in its entirety.</p>\n<p>\"I-I didn't do anything! She just went to get some water!\"</p>\n<p>\"Whatever,\" Marie snorted with amusement. \"Anyways, don't grab women's hands like that so brazenly the next time, you dense little boy,\" Marie retorted offhandedly.</p>\n<p>\"Huh? Did I do something wrong?\" Markus muttered while scratching his head in confusion.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/WOdRTMUbiCIWbvxCT5dII\">Chapter 097 - A New Addition</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/QMEaQXgNgPUbAcElwm2Rx\">Chapter 095 - Meaningful Purpose</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}