{"pageProps":{"note":{"id":"rv4wwarc576ln7cgzlip92e","title":"Chapter 324 - (Interlude) Undercurrents (Part Two)","desc":"","updated":1686588760215,"created":1684262448465,"custom":{},"fname":"volume-5.chapter-324","type":"note","vault":{"fsPath":"vault"},"contentHash":"a21835482cf1c246a08fa50fec2d8cca","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-324","id":"rv4wwarc576ln7cgzlip92e","vaultName":"vault"},"value":"volume-5.chapter-325","position":{"start":{"line":101,"column":3,"offset":11256},"end":{"line":101,"column":27,"offset":11280},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-325"}},{"from":{"fname":"volume-5.chapter-323","id":"bpztef9wuuyswa83s4dfiio","vaultName":"vault"},"type":"backlink","position":{"start":{"line":99,"column":3,"offset":12022},"end":{"line":99,"column":27,"offset":12046},"indent":[]},"value":"volume-5.chapter-324"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-324---interlude-undercurrents-part-two\">Chapter 324 - (Interlude) Undercurrents (Part Two)<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-324---interlude-undercurrents-part-two\"></a></h1>\n<p>\"The business is in a state such that it is its own entity,\" Ghon hinted. \"The owners, which are all the shareholders, have what is known as limited liability. This means that in the worst-case scenario, let's say that the business suffers from bankruptcy, the owners (who are essentially all the shareholders) only lose what they invested into the business and nothing more. The liability to pay back any debts stops at the business, thus ensuring that the owners are immune.\"</p>\n<p>\"But that is extremely risky, economically speaking. Debtors incapable of paying off their debts are turned into debt slaves to work off the overdue amount. But a business can't be turned into a debt slave; it effectively becomes a pit that devours money at this point!\" Jing exclaimed.</p>\n<p>\"Ah, but a business isn't a human. It can be gutted for parts and sold off,\" Ghon rebutted. \"If another investor wishes to take over, it can be handed off and start anew.\"</p>\n<p>\"While all of this sounds interesting, aren't we moving away from the crux of the conversation?\" Jing interjected while waving his hands.</p>\n<p>\"As it stands, the business model is heavily monitored in its trading. In order to facilitate trade, the shares need to be sold to the government and then purchased from the government. As it stands, the government has the power to, to a certain extent, regulate the price of purchasing shares. But as you correctly predicted, there is a movement now to make trading more public with the government acting as a barebone regulator. Now when that happens, well, that is when the true fun starts,\" Ghon hinted.</p>\n<p>Jing hummed audibly as he thought over his son's words.</p>\n<p>\"The government won't take a step back so easily. But I figure the allure of profits will urge the masses, including the large businesses and clans, to take action and force the government's hand,\" Jing narrated his thoughts out loud. \"When that happens, the public will have greater power over influencing the state of the Duchy's economy. And when word spreads and this model takes hold across the entire Empire...\"</p>\n<p>A pregnant pause took hold as nodes started to connect in Jing's mind.</p>\n<p>\"But that won't happen. No one in their right mind would just let something like that grow out of control!\" Jing reasoned.</p>\n<p>\"They already have,\" Ghon responded with a shake of his head. \"Radiant City is the first to allow regulated share trading among the general public without having to sell and buy from the government. Any business registered there can subscribe to this feature. Within this year, over 112 new businesses have spawned in the Maika Duchy, of which 45 are still functioning and 14 are generating sizable profits and handing out dividends to the shareholders. Another interesting fact: of the 45 still functioning businesses, 33 were started by low-skilled labourers who were uneducated and, in some cases, illiterate. This wouldn't have been possible before, where the barrier of entry to start your own business was skewed in favour of those with a more reputable background and higher levels of learning.\"</p>\n<p>\"I can't believe it...\" Jing muttered.</p>\n<p>\"The banks are having a field day. They've even gone as far as to start lending money they don't technically own to fund small startups, which may sound crazy but has actually been providing steady results,\" Ghon explained.</p>\n<p>\"That's illegal!\" Jing exploded. \"It isn't their money to use.\"</p>\n<p>\"They have created a new Savings option, where the deposited commodity money (as in gold, silver, and copper coins) is forfeited to the bank while the amount is still present on paper and owned completely by the depositor. This 'theoretical money' is locked in place and isn't liquid. To withdraw within a set time period after depositing incurs a fee. Now that the commodity is forfeited, though, it becomes the bank's to use for their purposes. The draw towards putting money towards savings is that the bank will pay interest against the saved amount for letting them use it for their purposes,\" Ghon elaborated.</p>\n<p>Ghon waited for a minute to let his father stew on the revelation before saying, \"So many revolutionary changes that have already changed the economic environment of a region and can potentially barrel out and affect the entire Empire. All of it started with a single business that sold machines that could output printed text.\"</p>\n<p>At this point, Jing mourned over his aged mind that had gone number over years of being entrenched in dull bureaucracy. He knew that his son hoped that he could make the connections given all the information provided, but Jing just couldn't. Luckily, his son could read his face and didn't push any further, allowing Jing to save the last bit of face and dignity he held as a father.</p>\n<p>\"To be able to influence such drastic changes without shedding a drop of blood or offending anyone implies that whoever is responsible for it is an extremely capable person. It is even more commendable that the person responsible was hands-off for a good portion of the process,\" Ghon highlighted.</p>\n<p>\"Who is this person?\" Jing inquired.</p>\n<p>\"I have a name and affiliation, but no face or past to attach to it,\" Ghon answered with a disappointed shake of his head. \"But, I do have a contact. It was difficult to get in touch with them, and even tougher to book a meeting. But I succeeded.\"</p>\n<p>Ghon shuddered as his blank gaze recollected the meeting with the blond-haired, faintly orange-skinned, hefty teen who carried an aura of a gluttonous tiger shark.</p>\n<p>\"Son?\" Jing interjected Ghon's thoughts while snapping his fingers. \"Son?!\"</p>\n<p>\"Huh?\" Ghon returned to himself and coughed to clear his discomfort. \"Right. Well, I believe that the future of the Solar Empire is dire. I know that this is all treasonous talk, but let's be real, Father. The Empire won't last past the current Emperor's reign. His early laxness in exhibiting the Crown's martial prowess, and his reliance on using marriage to strengthen the loyalty held by the four Duchies towards the Crown has resulted in heavy splintering. He isn't the strongest Emperor, nor is he the most intelligent. Mediocrity does not a successful ruler make. His offspring are even worse in that regard. The Empire has stagnated and will only deteriorate from this point onwards, so we must get ahead of things and make a move to secure ours and the Nation's future.\"</p>\n<p>\"What's the endgame, son? To put this mysterious man on the throne?\" Jing voiced his disbelief and doubt.</p>\n<p>\"Why assume that there will BE a throne in the future?\" Ghon scoffed. \"No, Father. I am aiming even higher. There is no point in trying to prevent the Empire from falling apart, as it is a lost cause. It's the same as trying to preserve a necrotized foot. No, I intend to be there when, after it perishes, a renewed Phoenix is born from the ashes.\"</p>\n<p>Jing gulped down a dry mouthful of air as he receded into his chair's backrest. He could see fiery ambition exuding from his son's animated eyes. It was his first time seeing the boy so excited and charged up about something. Jing wanted to open his mouth and discourage his son from walking down the perilous path he'd chosen for himself, but the words just didn't make it past his lips. He didn't have the heart to say it. What was the point? The extermination of his Lorath Family was only an eventuality as long as he stayed the current course. Taking the side of any of the princes would only bring the eventuality closer. So what fault was there in walking down a completely different path, as his son envisioned?</p>\n<p>\"What do you intend to do, son?\" Jing asked cautiously.</p>\n<p>\"Nothing, as of now. I haven't even met the mysterious stranger orchestrating all of this, only his public voice and face. The way his Voice described things, the stranger doesn't have treasonous intentions and just wants to 'make the world a better place',\" Ghon threw a speculative look Jing's way.</p>\n<p>\"They're being cautious with their words,\" Jing agreed with his son's unspoken assessment. \"But the implied meaning is clear. They intend to make a play at the rulership in some way.\"</p>\n<p>\"Exactly!\" Ghon exclaimed as he clapped in agreement. \"Which is also why I have invited the Voice for dinner.\"</p>\n<p>\"You did what?!\" Jing sputtered as his body sprang up from his seat. He fought through the sudden disorientation as the blood left his brain and slammed his hands onto the table for support. \"Are you out of your mind, boy? What if word gets out? Our heads will be on stakes before we even have an opportunity to play our hands!\"</p>\n<p>\"Do not worry, father,\" Ghon spoke with a calming tone. \"The Voice, who is named Furion of the Stoll mercantile family, has simply been invited with the agenda of brokering an investment agreement for the Verum Trading Company's new venture to establish what has been described as a hardware store.\"</p>\n<p>\"A hardware store? You mean a shop that sells tools?\"</p>\n<p>\"Tools, building materials, building and landscaping services, and other retail options,\" Ghon elaborated. \"I told him that you, the Minister of Finance, are interested in diversifying your portfolio and are looking for new investment opportunities. He caught the implied meaning when I made sure to enunciate your name and position very slowly.\"</p>\n<p>\"Smart,\" Jing praised. \"So when did you plan the dinner for?\"</p>\n<p>\"Today,\" Ghon answered with a wry smile. \"I'm sorry for springing it on you so suddenly, Father. I met him just today and he said that he was only going to be in the capital for a few days. I had to act fast.\"</p>\n<p>\"It's okay,\" Jing said while exhaling to calm his agitation. \"We can prepare while-\"</p>\n<p>At that moment, a series of knocks resounded from his door.</p>\n<p>\"Master, the guest Mr Furion Stoll has arrived.\"</p>\n<p>Jing bit back a curse, cleared his throat, and said, \"Guide the guest to the salon. Serve him the freshly imported Hindaan Zahafraani Schaai.\"</p>\n<p>Ghon flashed a thumbs up to commend Jing's decision to wine and dine the guest with the rarest and most expensive of teas in the Lorath Household.</p>\n<p>\"Let's go,\" Jing declared before walking out of the room, with his son in tow. His body shuddered with anticipation and excitement as his steps drew him towards the mansion's salon. As he stood before the doors leading into the salon, he paused and took a long breath. His son patted him on the back as encouragement. And then the doors swung open.</p>\n<p>\"Mr. Stoll,\" Jing said, to draw the seated teen's attention. \"It's a pleasure to host you today.\"</p>\n<p>The blond-haired boy looked up from taking a sip of the tea with a colour that faintly matched the boy's skin and revealed a welcoming smirk...?</p>\n<p>\"The pleasure is all mine,\" the boy spoke with an enthusiastically... sarcastic tone?</p>\n<p>\"I must say, the Verum Trading Company is quite an impressive venture,\" Jing continued, doing his best to maintain a friendly and accommodating demeanour.</p>\n<p>\"Thank you, Minister,\" the boy responded with a hint of genuine appreciation. \"But I'm sure you didn't invite me here just to compliment my business.\"</p>\n<p>\"No, indeed,\" Jing said as he took his seat at the head of the long table. \"I believe we have some matters to discuss, matters of mutual benefit.\"</p>\n<p>The boy's eyes gleamed with mischief as he leaned back in his chair, his voice dripping with anticipation. \"I'm all ears, Minister.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/cbg3rge1pc7sz2xu8ivnk9c\">Chapter 325 - (Interlude) Undercurrents (Part Three)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/bpztef9wuuyswa83s4dfiio\">Chapter 323 - (Interlude) Undercurrents (Part One)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}