{"pageProps":{"note":{"id":"t0q1a5gxhv98zvi3hmx2y7s","title":"Chapter 280 - The Abomination","desc":"","updated":1675659272668,"created":1673800809171,"custom":{},"fname":"volume-4.chapter-280","type":"note","vault":{"fsPath":"vault"},"contentHash":"9ea5737e706f0378bc707d4e190e2ce3","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-280","id":"t0q1a5gxhv98zvi3hmx2y7s","vaultName":"vault"},"value":"volume-4.chapter-281","position":{"start":{"line":83,"column":3,"offset":11608},"end":{"line":83,"column":27,"offset":11632},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-281"}},{"from":{"fname":"volume-4.chapter-279","id":"7adxaiiwxu1wziz6q90zqe8","vaultName":"vault"},"type":"backlink","position":{"start":{"line":103,"column":3,"offset":10263},"end":{"line":103,"column":27,"offset":10287},"indent":[]},"value":"volume-4.chapter-280"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-280---the-abomination\">Chapter 280 - The Abomination<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-280---the-abomination\"></a></h1>\n<p>Jean could only see the sea of rodents from afar. Just observing the undulating mass discomfited her - she didn't want to be anywhere near that mess. But a question popped into her mind at that instance.</p>\n<p>'Why are there so many rats here?'</p>\n<p>Maybe it was because of all the carrion. Rats were omnivorous to the extreme, even going as far as eating rotten meat should the need arise. With the abundance of corpses from the deceased infected, the rats were having a field day. They were everywhere, moving from one building to the next as if they were performing a thorough search.</p>\n<p>'But why are they so coordinated?'</p>\n<p>She couldn't find an answer to that question. Although rats were swarming creatures, they maintained a certain degree of autonomy within the swarm unlike ants, bees, or even sheep. In this scenario, however, the rats moved in a cohesive unit. It looked like they had turned into tentacles based on their movement patterns and behaviour. If they were acting like limbs, where was the body, and who was controlling it?</p>\n<p>These were valid questions, though Josie wasn't the least bit interested in knowing the answers to them. All she saw were targets to be eviscerated and turned into dust - a motherload of them. She burst into action quicker than Jean's senses could register.</p>\n<p>Josie arrived close to the swarm and leapt forward, positioning herself above the centre of one cluster. She then spun her arms in a wide circular arc.</p>\n<p>|Wind Blade|</p>\n<p>Two blades of compressed air exploded outwards centred at her person and, in the process, mowed through the entire cluster of rats in one clean cut. Jean had never seen such a horrific attack before. Though it didn't appear evident at a cursory glance, the |Wind Blade| was comprised of smaller micro-eddies of air that decimated the target at a cellular level. The rats didn't just get cut, they exploded like a confetti of blood and gore.</p>\n<p>The sudden loss of an appendage jolted the \"creature\" out of its ravenous stupor. Three more tentacle-like appendages were redirected from their frantic search and whipped in Josie's direction. Their trajectory lacked subtlety and speed - Josie could track and predict their motion with her human senses closed off. She bobbed and weaved through the triple attack before releasing another |Wind Blade| that deleted the three rat-made tentacles.</p>\n<p>This seemed to have enraged whatever was controlling the appendages, as an eardrum-shattering roar reverberated all across the forest.</p>\n<p>The ground vibrated vigorously with increasing periodicity and intensity.</p>\n<p>The trees shook and swayed.</p>\n<p>The tremors crescendoed... then silence.</p>\n<p>.</p>\n<p>.</p>\n<p>.</p>\n<p>BOOM!</p>\n<p>The ground burst open and ten more tentacles slithered out. They planted themselves on the ground and applied force. The hole through which they originated widened aggressively, and through this new aperture, ascended a grotesque abomination of furry flesh. The \"thing\" was massive - Jean estimated the misshapen central body to have a diameter of at least five times Josie's height. On top of that, it also had semi-elastic tentacles that extended for many metres. The thing was made entirely out of rats, all stitched and glued together, and lacked any distinctive form. If Jean had to describe it, the thing looked like a Beholder. A deep-sea predator that is endemic to the extremely deep oceans of the Fae Realm. The Beholder has one massive eye and a mouth filled with rows upon rows of teeth the size of bastard swords. It lacked arms but made up for it with tentacle-like appendages extending outwards from all around its bloated, spherical body. Each of these tentacles housed another smaller eye capable of wielding arcane magicks. This creature looked a lot like the Beholder, except instead of smaller eyes at the tip of its tentacles, it had rats. Instead of one large eye, it had rats, and instead of a gaping maw filled with teeth the size of bastard swords, it had a gaping maw filled with innumerable teeth the size of pins (which brought new meaning to the phrase \"death by a thousand cuts\").</p>\n<p>The thing's maw widened and a bellow that sounded like the layering of hundreds upon hundreds of rat shrieks thundered outwards.</p>\n<p>Jean was shaken by the sudden appearance of such a grotesque and unknown creature. What exactly was this thing?!</p>\n<p>Unfortunately, the thing wasn't one to communicate, nor did Jean expect it to. After all, Josie had just amputated four of its appendages rather brutally. The thing catapulted forward, its maw agape, ready to devour Josie. Its speed was staggering, though not fast enough to match Josie who flashed out of its path and appeared behind it.</p>\n<p>Just as she was about to summon another |Wind Blade| three tentacles zoomed in her general direction, moving in a more erratic pattern thus avoiding direct damage from her attacks. Once again, Josie was moved to dodge and reposition.</p>\n<p>The key to fighting any large beast is finding its blind spots and exploiting them. Even with the ability to use their mana sense, every sentient being automatically reverts to using their natural sensors first in an intense situation. A mindless beast is especially more vulnerable to having its blind spots exploited since they lack the discipline and self-control to voluntarily change sensing priorities compared to a more intelligent magic user.</p>\n<p>This creature was mindless, that much was evident. But Josie quickly found out that the thing lacked a blind spot. This was proven by the fact that millions upon millions of tiny beady eyes embedded everywhere on the thing constantly followed her every move regardless of where she was. There were eyes all over its body!</p>\n<p>A rather annoying inconvenience, since lacking a blind spot in conjunction with its tentacle appendages afforded the monster infinite attacking trajectories. The tentacles moved erratically and would often accelerate midway through action by either slowing down, speeding up or even changing directions. It was quick and unrelenting, making it hard for Josie to concentrate and initiate spells. If she created distance, the monster would cover it by catapulting itself towards her. She could not engage it in melee, since the tentacles blocked her advancement.</p>\n<p>Josie's initial plan was to wait and tire out the monster before going for the attack. Usually, in a fight between entities of different sizes, it was the larger one that tired out first since energy expended by the entity correlated to their size. This also translated to mana consumption. Unfortunately for her, the monster was barely using any mana in its attack and defence and was not tiring out physically either. In terms of physical movement, Josie could observe that it had optimised energy use by distributing the load over the multiple rats making it up. This had to be an instinctive behaviour since the monster didn't seem to have the required mental capacities to make those calculations. The monster worked like an amalgamation of different agents working together AND as a single body, both at the same time. Furthermore, the monster was learning quickly as it fought her.</p>\n<p>An evasive tactic Josie employed twice was intercepted the third time. The fourth time it was followed up with a counterattack. The monster wasn't intelligent, but its instincts were sharp! It even learned to predict Josie's attack patterns and defensive manoeuvres.</p>\n<p>Josie expected this fight to go more smoothly, given how her initial scan of the beast showed that it was only at the cusp of breaking through to the Core Formation realm. However, a magical beast's cultivation realm wasn't a sufficient basis for comparison to determine if a confrontation was favourable or not like it was with other sentient humanoids. With humans, a mage in the Foundation Establishment realm wouldn't stand a chance against another in the Core Formation realm. On the other hand, a Foundation Establishment realm magical beast could hold its ground against a Core Formation realm mage up to a certain limit.</p>\n<p>This was the case in the current fight. The creature was maintaining a sturdy defence while pressing the attack effectively. However, Josie was also holding her power output to about 75% of her maximum. It was never logical to go all out from the start unless defeat was assured from the beginning. Noticing that the fight was going nowhere, Josie decided to ramp up her output. She gradually increased her speed until she was certain that she had hit the creature's reactionary ceiling, that is until it could barely keep up with her movements.</p>\n<p>The first hit from Josie connected at an unreinforced section of one of the creature's tentacles. The appendage disconnected cleanly. An enraged shriek echoed as the creature recoiled, in the moment of distraction, Josie called a |Wind Blade| and decimated the falling appendage, killing all the rats comprising it in the process. The creature quickly displaced more rats from its main body and regrew that limb, but while it did so, Josie zoomed past its defences and deleted two more of its tentacles.</p>\n<p>The creature realised that it could not afford to wait for its appendages to grow back - it had finally registered the threat Josie posed. Nothing is more dangerous than a cornered animal, because when they know that there is nothing left to lose except for their life, they will readily put that on the line without a second thought. The creature started to vibrate in place, causing an ominous drone to permeate the atmosphere.</p>\n<p>Josie recognised this behaviour as its preparation to unveil one of its signature moves. She could not let that happen. She quickly summoned more |Wind Blade| spells and thrust them towards the creature. The spells all connected and started to tear and eviscerate the creature, causing clouds of blood and gore to spew out of its body. But the creature did not relent - its vibrations grew in intensity.</p>\n<p>While the spells were effective on the creature's tentacles, it was not the case when attacking the body. The area seemed far denser and more reinforced by the passive mana coursing through it. Josie realised she would have to close the distance and resort to piercing melee attacks.</p>\n<p>Within split seconds, Josie covered the distance, but she was already too late. The creature stopped vibrating, expanded, and deflated causing a noxious black gas to rush out through the pores between adjacent rats adorning its entire body. The gas gushed out like an explosion that flooded the area aggressively, discombobulating Josie in the process.</p>\n<p>Jean observed the approaching gas and turned tail and ran for cover. She did not know what was within this gas, but she wasn't keen on quenching her curiosity with her life on the line. The gas moved quickly, like the lahar from a volcano, and was approaching her position. In passing, she noticed a boarded-up house that was fairly intact. Without wasting a minute, she beelined for it and burst through the door with her shoulders. She immediately pushed against the door and covered her entrance with her full body weight.</p>\n<p>The gas shook the house as it moved over it. Even the boarded windows and the propped-up door did not stop some of it from entering. Jean was confident that her personal protective equipment could keep her safe against this much exposure, as long as the gas contained only a strain of the illness that ran rampant in this place.</p>\n<p>At that moment, Jean heard a light cough somewhere in the back of the house followed by a low and scared whimper.</p>\n<p>\"Who's there?\" Jean announced before moving cautiously towards the source of the noise.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/7m3h2ywgsl1h1h51q4rigra\">Chapter 281 - Lose an Arm to Save the Body</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/7adxaiiwxu1wziz6q90zqe8\">Chapter 279 - For the Sake of Survival</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}