{"pageProps":{"note":{"id":"thmcL7cRljFpI6zoj2HZ0","title":"Chapter 103 - Goran's Philanthropic Heart","desc":"","updated":1651421722632,"created":1643656103125,"custom":{},"fname":"volume-2.chapter-103","type":"note","vault":{"fsPath":"vault"},"contentHash":"a35e3d0509d4439a199883d44af4f605","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-103","id":"thmcL7cRljFpI6zoj2HZ0","vaultName":"vault"},"value":"volume-2.chapter-104","position":{"start":{"line":113,"column":3,"offset":11082},"end":{"line":113,"column":27,"offset":11106},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-104"}},{"from":{"fname":"volume-2.chapter-102","id":"2frg75lgm4e7ynxms9b1crz","vaultName":"vault"},"type":"backlink","position":{"start":{"line":113,"column":3,"offset":12689},"end":{"line":113,"column":27,"offset":12713},"indent":[]},"value":"volume-2.chapter-103"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-103---gorans-philanthropic-heart\">Chapter 103 - Goran's Philanthropic Heart<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-103---gorans-philanthropic-heart\"></a></h1>\n<p>\"So tell me, Mylo. How long do you estimate it will take to construct the additions I asked you about?\" Goran inquired the elderly man with a slight hunch following him.</p>\n<p>The man's wrinkled face crumpled with a bitter expression as he responded hesitantly, \"Mister Rasmus, that's a little difficult to say. When you called me in and commissioned the project, I assumed that it was somewhere close to the city. But this place...\"</p>\n<p>The man still shuddered when he recollected the gruelling, backbreaking carriage ride from the city to this out-of-the-way village. Being of advanced age and lacking the robustness of a mage's physique, Mylo had to sit through a torturous ride whose after-effects were still reverberating through his bones. </p>\n<p>\"Constructing the Young Miss' living quarters will take a bit longer than the initial estimate. This orphanage is a fairly complete structure, so I think it would be advisable to build a separate building for the Young Miss as opposed to a simple attachment,\" Mylo continued. \"Furthermore, I didn't anticipate just how secluded the location would be when I provided the ambitious estimate of three weeks. If I'm being optimistic, the work can be finished within a month.\"</p>\n<p>Goran nodded and added, \"I understand. If you need anything, anything at all, don't hesitate to let me know. The construction must be finished as soon as possible, money isn't an issue. Also, I hope that we can keep this under wraps.\"</p>\n<p>Goran gradually exuded more pressure on Mylo as he stressed a point, \"We wouldn't want news about Jean's new arrangements circulating amongst unwelcome crowds now, would we?\"</p>\n<p>Mylo suppressed the sweat threatening to trickle down his back and answered firmly, \"I wouldn't dare! We at Saga and Sons Constructions pride ourselves in our privacy and confidentiality.\"</p>\n<p>That was the truth. The only reason Mylo's homegrown family business managed to thrive amongst the upper echelons of society was due to its ability to compartmentalise information within the organisation.</p>\n<p>It was an insane idea brought forward by his eldest son - to pivot the thriving construction business to cater purely to the rich. Mylo nearly flogged his son with his shoes right then and there! Thankfully, the boy had the presence of mind to elaborate upon the pitch and brought forth data to corroborate the profitability of the venture.</p>\n<p>Sure, Mylo had to sacrifice a few metaphorical limbs of his business to enter this market, however, the results more than made up for it. Surprisingly, this new market happened to be a lot stabler than he had anticipated.</p>\n<p>Before, he'd have to scramble to different private and public bids and grovel at various government officials to secure projects for his company. Although the projects were long-term and high-paying, economically they weren't efficient.</p>\n<p>However, after pivoting to the more bespoke construction markets, while the projects were often short-term the payout was immense!</p>\n<p>As the rich got richer, and as more families and organisations rose above the dividing line that separated the average folk from the upper class, the demand for more elaborate and decorative construction projects kept coming in. Mylo didn't have to offer much except for exclusivity, quality, and secrecy.</p>\n<p>Exclusivity, because the rich never liked to see a copy of an item they owned with another. Be it clothing, jewellery, or even housing. Mylo had already seen many cases when large portions of mansions were torn down just because a neighbour or relative happened to share the same style of interior decoration. Heck, one customer even asked to change all the lightings in their house by a minor shade because it resembled the lighting at their neighbour's front entrance!</p>\n<p>The rich valued quality in their purchases for the same reason as everyone else. No one would want their hard-earned money to be siphoned into a shabby purchase. It was even more important when the purchase happened to be a long-term investment like a house or a structure. Although the rich sank their funds into such ventures more often than the regular folk, they did so with the goal to raise their prestige. To that end, Mylo had to change his mindset a little bit when approaching these projects. Because not only did the structure have to maintain its high quality, this parameter had to be evident at a cursory glance as well. The product had to advertise itself, without the need for someone to point it out.</p>\n<p>Finally, the rich valued secrecy for a multitude of reasons. The first, and most important, was to protect themselves against physical attacks from those that sought to hurt them. No one would like the blueprints of their households floating around in the market for everyone to see. It was especially the case for the rich since enemies were an inevitable byproduct of amassing wealth. The second was to protect themselves from damage caused by \"subtler\" means.</p>\n<p>For instance, if a certain patron had particular sexual proclivities that couldn't be disclosed to the general public, they could commission for a subterranean attachment to their household that was secluded from peeping eyes. Of course, if this information happened to leak out, it would be truly unfortunate for both the party in question and Mylo himself who would have to bear the complete wrath of the party.</p>\n<p>To that, Mylo practised the \"Don't ask, Don't tell,\" line of thought. The organisation also had to go through serious restructuring to ensure that such sensitive pieces of information weren't shared haphazardly.</p>\n<p>Anyways, Mylo was grateful to his most loyal patrons, the Rasmus clan. Not once did they ask him to build a truly degenerate sex dungeon, secret housing for a hidden family, or barracks for a secret army to rebel against the crown. All three of which his competitors were commissioned to do, and were subsequently annihilated after the information was brought to light.</p>\n<p>This particular project, while simple in technicality, was actually quite difficult to undertake. After all, it would be truly impossible to keep the movement of various building resources and workforce occluded from peeping Toms. Be that as it may, Mylo had taken on this job and now it was his responsibility to carry it to the end.</p>\n<p>As Mylo and Goran walked and discussed the particulars, they happened to reach the location of the classroom.</p>\n<p>Goran subtly changed the topic of the conversation and asked, \"Have you also looked through what I asked? About improving this orphanage?\"</p>\n<p>\"I have. As I've said before, this orphanage is a fairly complete structure. And interestingly, its architecture is quite advanced and well-established. It is completely out of place compared to the village. While old, it's extremely robust and resilient. To make changes to this house without damaging it, we will need to be meticulous.\"</p>\n<p>Goran interrupted Mylo's explanation and asked with slight impatience, \"So what about my request?\"</p>\n<p>\"For that, I will need to inspect the section in person before making a judgement,\" Mylo answered.</p>\n<p>The two happened to turn the corner and were surprised to find another individual gazing intensely at a wall.</p>\n<p>\"Al!\" Goran greeted.</p>\n<p>\"Goran,\" Al replied casually, without averting his gaze.</p>\n<p>Mylo put two-and-two together, and quickly bowed with respect, \"T-Teacher Jeeves! I am honoured to make your acquaintance!\"</p>\n<p>Al simply hummed and waved his hand in acknowledgement. He completely refused to look away from the painting of the Red Dragon called Smaug from the wall.</p>\n<p>His forehead furrowed with a frown as he said, \"I don't see it!\"</p>\n<p>\"<em>sigh</em> You need to learn how to appreciate art, my friend,\" Goran replied.</p>\n<p>Al harrumphed and retorted, \"I'll have you know that I have a 2-star license in the field of visual arts!\"</p>\n<p>\"Oh please! You rushed through it all for the sake of earning the license. Did you actually sit down and study the works wholeheartedly?\"</p>\n<p>Al showed a wry expression and retrained his gaze on the painting. He took it as a challenge when he was unable to observe the intricacies of this seemingly arcane work painted by a child. He'd spent hours in front of this wall, like an idiot, and still failed to glean anything. Right now, Al wanted to take out his license from the Artists' Guild and throw it into the sea!</p>\n<p>\"This wall here,\" Goran said to Mylo. \"Can you remove it without damaging the painting?\"</p>\n<p>\"Huh?!\" Mylo voiced in confusion.</p>\n<p>\"I want to remove this wall as it is and transport it to a more secure location. Is it possible to do so without damaging the painting on the wall?\" Goran repeated.</p>\n<p>Mylo observed the wall, and the painting on it, and tried to make sense of the request. Although architecture was a technical field, there was an underlying sense of artistry and aesthetics to it. Hence, Mylo was receptive to other works of art. Yet, he couldn't find anything of importance in the piece of work before him. It looked unrefined and lacked precision.</p>\n<p>However, he didn't voice those thoughts out loud. It wasn't his place to do so, after all.</p>\n<p>Mylo approached the wall and tapped around the edges with his ears plastered against the surface. After a few more inspections, he declared with certainty.</p>\n<p>\"It is possible. It shouldn't be too difficult. However, it will be a more complicated task to source the same materials used to make this wall when we plan to replace it.\"</p>\n<p>\"That's not an issue. I want to secure this wall from the environment as soon as possible,\" Goran repeated.</p>\n<p>\"Did you ask Guy's permission for this, though?\" Al commented.</p>\n<p>\"I did. But then Teacher Larks said to ask the matron. So I asked her, but she just kept nodding to everything I said. I don't think she was even listening to me. She had this tuned-out look on her face the entire time,\" Goran reasoned.</p>\n<p>\"It doesn't seem right to take advantage of her kindness like this.\"</p>\n<p>\"Of course! That's why I'm having Mylo here make improvements to this orphanage as a whole. Improving the stairs to the village, building better paths, refurbishing the rooms. Jean even told me that the Matron tends to a garden - Mylo's company has an excellent landscaper. I've asked him to work on that as well,\" Goran responded.</p>\n<p>As he was doing so he noticed a little boy, Kano, walk over shakily with a large pail of water in his hands.</p>\n<p>Initially, he assumed that the boy was just passing by, but Kano never turned away. He kept approaching them while carefully carrying the pail.</p>\n<p>The boy stopped a foot away from the wall and placed the pail on the ground, causing droplets of water to spill over.</p>\n<p>The boy heaved out loud and threw the water towards the wall.</p>\n<p>\"Boy, what are you doing?!\" Gavin bellowed. With a frantic wave of his palms, he materialised a large spell circle, suspending the mass of water just millimetres away from colliding against the wall.</p>\n<p>He exhaled in relief and immediately jerked his hands back in a throwing motion, propelling the blob of water at an extremely high velocity in the opposite direction.</p>\n<p>Kano gazed innocently at the agitated Goran and said, \"I'm cleaning the wall.\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/tE7x6mxZ9oxlKcN4xSeI1\">Chapter 104 - Kano's Request</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/2frg75lgm4e7ynxms9b1crz\">Chapter 102 - (Interlude) A Brewing Storm (Part Three)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}