{"pageProps":{"note":{"id":"u1xli3tz1e6qnm3zpvdi8gu","title":"Chapter 305 - Losing Streak","desc":"","updated":1698870384317,"created":1679288920320,"custom":{},"fname":"volume-5.chapter-305","type":"note","vault":{"fsPath":"vault"},"contentHash":"6a933823e979ede282e65668705a36e6","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-305","id":"u1xli3tz1e6qnm3zpvdi8gu","vaultName":"vault"},"value":"volume-5.chapter-306","position":{"start":{"line":135,"column":3,"offset":10973},"end":{"line":135,"column":27,"offset":10997},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-306"}},{"from":{"fname":"volume-5.chapter-304","id":"8o8bps9gncpt8gv40udfgr7","vaultName":"vault"},"type":"backlink","position":{"start":{"line":129,"column":3,"offset":9562},"end":{"line":129,"column":27,"offset":9586},"indent":[]},"value":"volume-5.chapter-305"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-305---losing-streak\">Chapter 305 - Losing Streak<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-305---losing-streak\"></a></h1>\n<p>“And that's Blackjack!\"</p>\n<p>\"You don't have to call out 'Blackjack' EVERY time you win!\" Shuri exclaimed with a voice brimming with exhaustion, exasperation, irritation, and defeat.</p>\n<p>\"Where's the fun in that?\" Marie sputtered as she released an offended gasp. \"Now, do you want to add another deck to the mix or do you want to run two more games parallelly?\"</p>\n<p>Shuri slinked back into her chair as her eyes glossed over the enormous card deck laid out before her. It had tripled in size, encompassing at least twelve standard decks, and both Marie and she were playing five hands simultaneously. Probability-wise, Shuri should have increased odds of victory, and yet she lost!</p>\n<p>\"Impossible...\"</p>\n<p>\"Counting cards isn't hard, you know,\" Marie explained.</p>\n<p>\"What are you talking about?\" Shuri snapped back.</p>\n<p>\"You're tracking the cards being played and calling based on the assumed advantage,\" Marie summarised. \"You're good. But unfortunately, I'm just better.\"</p>\n<p>\"I can see that,\" Shuri admitted gruffly.</p>\n<p>\"Though it's surprising that you figured it out all by yourself in such a short time,\" Marie commented. \"See? Gifted, I tell ya'!\"</p>\n<p>\"Enough,\" Shuri proclaimed as she shot up from her seat. She reached forward and began collecting all the distributed cards. \"This is useless.\"</p>\n<p>\"You still have a few more days left,\" Marie tempted the girl as she walked away in a huff.</p>\n<hr>\n<p>\"I challenge you to a game of chess!\" Shuri declared as she dropped the wooden box with white and black checkered boxes painted on it. She quickly picked up the pieces and arranged them in their proper place. \"I'm playing white.\"</p>\n<p>\"What about the task I assigned you?\" Marie reminded again, which was turning into a knee-jerk action on her part every time she spotted Shuri within the Sect's campus.</p>\n<p>\"It will be done before the deadline,\" Shuri growled. \"Are you playing or what?\"</p>\n<p>\"Alright, what are the conditions?\" Marie inquired as she observed Shuri move the first pawn.</p>\n<p>\"No conditions. Just a simple game,\" Shuri retorted with her face scrunching up in concentration.</p>\n<p>\"Alright, so I'm allowed to use everything in my arsenal?\" Marie probed. The phrasing of the sentence caused Shuri to arc her brows.</p>\n<p>\"What are you implying?\" Shuri paused, and looked up from the board.</p>\n<p>\"Well, everyone in the Foundation Establishment realm and above in this Sect specialises in something - as every Foundation Establishment mage is meant to. You should be aware of Markus' and Jean's speciality by now. My speciality is something different,\" Marie drawled. At that moment, she snapped her fingers and said, \"How about this? If you can defeat me in anything without forcing me to suppress myself in any way, I will not only relinquish you from the assistantship position, but I will also owe you a favour 'no-questions-asked\"!</p>\n<p>\"This does not void our earlier agreement, correct?\" Shuri confirmed, to which she received a decisive head shake. \"In that case, deal. Now please, make your move.\"</p>\n<p>\"Since that is the case, you should know that you have already lost this match,\" Marie expressed while moving a pawn from her own side.</p>\n<p>\"Your mind games won't work on me,\" Shuri mumbled.</p>\n<hr>\n<p>Shuri knew that she could not beat Marie in magic or combat. The gulf between a mortal and a Foundation Establishment realm wasn't so easily bridged. Therefore, victory had to be achieved through alternate means - games. These games couldn't be physical as, once again, it would place the mortal, Shuri, at a disadvantage. Games that tested a person's mind though, that was a whole different ball game. A battle of the mind was the only contest where Shuri knew she could stand a chance against Marie. Of course, there was the disadvantage of competing against a Foundation Establishment realm mage's superior mental capacity and processing power, but Shuri was hopeful that her 'gift', as Marie put it, would help alleviate that gap.</p>\n<p>Now, although Shuri acted haphazardly, she had a plan. It is often easiest to defeat an opponent who is laxer than one whose attention is dialled to the maximum level. The easiest way to achieve this is by getting the enemy to underestimate you. Shuri knew that Marie would win in Blackjack. Even if the girl hadn't nerfed her mana senses, Shuri entered the contest with the express purpose of losing. By showing a fumbling attitude outwardly and losing so magnificently, Shuri hoped to lower Marie's guard against her. This way, the subsequent matches would be lowered in difficulty. After the set-up, it was time for Shuri to gradually work towards her victory. And to do this, she chose the game of chess. The game shared similarities with Hindaan Shut'Raanj, a game originating from the Hindaa Union within the Jehakan Confederacy beyond the Vast Blue Expanse, except it was more concise and involved more variations in its pieces' actions. Because of this, Shuri was able to create parallels and adapt strategies to the new game from the one she was familiar with.</p>\n<p>Shuri was certain that with time, as Marie slowly dulled her edge, she would be able to secure a victory. The first loss was guaranteed, and Shuri wasn't pushing herself too hard in that game. In the second, she kept an eye out for any opportunity to secure a victory, though none revealed themselves. From the third onwards, she played offensively and tried to apply every strategy she could think of. Yet victory still eluded her. This happened again, and again, and yet again. At this point, Shuri's attention left the game and focused on Marie. If it was difficult to win a game, play the opponent instead. If she could observe any tells on Marie's face, she could exploit it for victory.</p>\n<p>It was at this moment, Shuri started to notice something odd. Infrequently (that is to say once or twice per game), Marie would close her eyes for a few seconds, open them and make a move that made absolutely no sense. Sometimes it would be sacrificing a key piece voluntarily, other times it would be to revert an advantageous move. However, even with such idiotic plays, the outcome remained the same.</p>\n<p>\"This again!\" Shuri interrupted Marie's move by banging her fist on the table. After wasting four games like this, it was starting to truly grate at her sanity.</p>\n<p>\"Again... what?\" Marie responded innocently as she placed her bishop dramatically and directly in the line of sight of the enemy queen.</p>\n<p>\"You're making a nonsensical sacrificial play,\" Shuri pointed out. \"There is literally no benefit to this move. There is no immediate benefit or any foreseeable benefit down the line. If anything, You will be at a severe disadvantage.\"</p>\n<p>\"From your point of view, you are correct,\" Marie agreed nonchalantly.</p>\n<p>\"And this isn't even the first time! In the last two games, you did something similar too! But why?!\" Shuri evoked.</p>\n<p>\"Yet I won those two matches,\" Marie reminded smugly.</p>\n<p>\"BUT HOW?!\" Shuri exclaimed with an angry bellow.</p>\n<p>\"This was the only way I could guarantee my victory,\" Marie said cryptically. \"Actions have consequences. I'm simply guaranteeing that the consequences lean more in my favour.\"</p>\n<p>Shuri scowled in disbelief.</p>\n<p>\"Alright, I'm amending the rules!\" Shuri declared. \"Every turn can only last for ten seconds.\"</p>\n<p>\"Okay. Reset?\"</p>\n<hr>\n<p>The next game went more quickly. Shuri was suspicious that something fishy was taking place during the times when Marie closed her eyes. Wanting to test this hypothesis, she imposed a time crunch within the game. Luckily, Marie was amicable to Shuri's demands and followed through.</p>\n<p>'There it is!' Marie's eyes closed. Due to the time crunch, though, the duration was shorter. But the move that followed was different. It wasn't so blatantly asinine for it held a purpose.</p>\n<p>The purpose? To throw a wrench into Shuri's game plan! As a veteran player and 'gifted' genius, Shuri was able to see multiple steps into a game and plan ahead. This was how she beat her usual opponents. For every move there were very few logical reactionary or actionary moves the opponent could make. Taking those into consideration, one could possibly see five or six steps ahead depending on how well their minds could conceptualise a game. For Shuri, she could foresee seven steps. Unfortunately, Marie's single move had targeted this exact seventh step and overturned the entire sequence.</p>\n<p>As soon as Marie's finger left the piece, she looked up and shot a challenging smirk.</p>\n<p>Shuri stumbled, new plans had to be made, and she had to redirect her entire attention to the game. But alas, the brief moment cost her and she was cornered.</p>\n<p>\"Checkmate!\" Marie chortled.</p>\n<p>\"Five seconds!\" Shuri challenged.</p>\n<p>\"It's almost midnight,\" Marie reminded. \"You should get some sleep.\"</p>\n<p>\"No! We play again,\" Shuri demanded.</p>\n<hr>\n<p>Shuri suffered defeat after defeat, even with the new format. However, she also noticed something interesting: the interception range had narrowed. Instead of seven steps into the future, she was now being intercepted at the fourth step. Although this meant that she could more easily react to changes, the tougher time limit was also working against her.</p>\n<p>But a trend was observed, which warranted further investigation. Unfortunately, she could no longer continue playing as Marie insisted that Shuri get her sleep. Night had passed and the sun was nearly peaking over the horizon. She wouldn't be able to get her full eight hours, but Shuri wasn't planning to retire anyways. She was so close, she could feel it on the tip of her fingertips.</p>\n<hr>\n<p>\"Today's the last day, isn't it?\" Marie inquired, as she noticed Shuri walk in with a confident smirk on her face. \"Have you finished the task I handed you?\"</p>\n<p>Shuri side-stepped the inquiry and got straight to the point and said, “I challenge you to a game of chess.”</p>\n<p>\"Just like yesterday?\" Marie sighed.</p>\n<p>\"Yes, but with a surprise twist,\" Shuri said, retrieving a silver coin from her jacket pocket and placing it on the table. \"Before each turn, the player moving their piece must first call heads or tails and shuffle this coin. There is a time limit of two seconds for calling and shuffling the coin. If the person wins the call, they can move a piece. If they don't then their turn is forfeit. Every time a piece is captured, the owner of the losing piece is allowed to call a coin shuffle. If they win the call, the captured piece survives, and the capturer dies instead.\"</p>\n<p>Marie propped up her left brow, \"That's a lot of rules for a simple game.\"</p>\n<p>\"I will win this time,\" Shuri affirmed.</p>\n<p>\"How can you be so sure?\" Marie asked.</p>\n<p>\"It's because it is no longer just two people playing; there is a third person,\" Shuri raised her finger and tapped the silver coin. \"If the third person wills it, then I shall win. Luckily, they are fair and unbiased.\"</p>\n<p>\"Alright, shall we begin?\" Marie said while cracking her fingers in anticipation.</p>\n<p>\"No casual declaration of victory this time, huh?\" Shuri mocked.</p>\n<p>\"I can't declare that what I cannot know,\" Marie responded, smiling back at her.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/p2yk7luke2yloaomcjmldks\">Chapter 306 - Suspicious Conclusion</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/8o8bps9gncpt8gv40udfgr7\">Chapter 304 - Getting Out of a Forced Commitment</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}