{"pageProps":{"note":{"id":"van5o8bwwa4o2klaofrgt60","title":"Chapter 261 - (Interlude) Pride or Death","desc":"","updated":1671602571836,"created":1668947357789,"custom":{},"fname":"volume-4.chapter-261","type":"note","vault":{"fsPath":"vault"},"contentHash":"9b0e76d4371a6607d9abd4a9e9c954d9","links":[{"type":"wiki","from":{"fname":"volume-4.chapter-261","id":"van5o8bwwa4o2klaofrgt60","vaultName":"vault"},"value":"volume-4.chapter-262","position":{"start":{"line":133,"column":3,"offset":11588},"end":{"line":133,"column":27,"offset":11612},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4.chapter-262"}},{"from":{"fname":"volume-4.chapter-260","id":"1cioeuukx3qjg2kuud6kmma","vaultName":"vault"},"type":"backlink","position":{"start":{"line":63,"column":3,"offset":10908},"end":{"line":63,"column":27,"offset":10932},"indent":[]},"value":"volume-4.chapter-261"}],"anchors":{},"children":[],"parent":"enpadrm33suumrdjl5t6gt2","data":{}},"body":"<h1 id=\"chapter-261---interlude-pride-or-death\">Chapter 261 - (Interlude) Pride or Death<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-261---interlude-pride-or-death\"></a></h1>\n<p>\"Your Highness, please let me!\" An eager-to-please voice approached.</p>\n<p>Shuri ignored the girl and continued to pick up the broken ceramic scattered across the marble floor. Some of it had fallen into the pond nearby, she'd have to pick that up later, unless-</p>\n<p>A loud splash of water signalled the girl's dive into the pond to retrieve the debris from within. Shuri suppressed her irritation, measured her breath and continued her scrap retrieval endeavour.</p>\n<p>\"Why must they do this to Your Highness...\" The girl murmured, loud enough for Shuri to hear. \"This is totally unfair! Your Highness is also a Princess of the Solar Empire. Why must Your Highness have to suffer through this?!\"</p>\n<p>Her voice radiated with sincere righteousness - it burned Shuri at a spiritual level.</p>\n<p>\"Your Highness...\" The girl pleaded as she waddled out of the pond, her hands filled with the rest of what remained of the ceramic plate. She slipped and accidentally nudged Shuri, causing the debris already in Shuri's hand to scrape a bit of flesh causing blood to leak out.</p>\n<p>\"OH NO! Your Highness, please forgive this slave!\" the girl pleaded and banged her head against the ground. Her skull elicited an audible crack as it hit the hard marble floor, there was no doubt the apology was sincere.</p>\n<p>\"Stop. You are attracting attention,\" Shuri growled albeit in a collected voice. Her attention did not leave the drop of blood fleeing the faint cut. With an audible sigh, she lowered her hand and looked at the prostrated figure of her most recent maid. It was a young girl, probably about Shuri's age. She had an innocent face, plump with baby fat. Her hair was common brown and tied into a neat braid - standard palace maid protocol.</p>\n<p>\"I-I just don't understand. Why did the Third Princess lie and inflate the value of the ceramic plate? Your Highness wasn't even the one who broke it, it was one of the Third Princess' maids!\" The girl complained with indignation.</p>\n<p>Shuri remembered exactly what the girl was talking about. It was extremely difficult for her to forget things, unpleasant interactions were especially so.</p>\n<p>She had no idea what came upon her that urged her to leave the safe confines of her courtyard and roam around the large pond at the centre of the Inner Court. Deviation from the norm was a surefire way to get killed. And boy oh boy was it a close shave this time.</p>\n<p>Shuri's younger sister, the Third Princess, was seated in the gazebo overlooking the pond, enjoying a spot of tea. She invited Shuri in for some, and she complied - better to roll with the punches. Shuri sat on pins and needles and barely managed to enjoy the wonderful blend from beyond the Vast Blue Expanse, as her entire attention was focused on the words leaving the Third Princess' mouth, honed to catch any verbal traps that came her way. Shuri managed to sidestep four such jabs all masked under layers upon layers of subterfuge: two poking at her insane and now-deceased mother, one aimed at her inability to cultivate, and the last one she wasn't so sure about - the intonation implied mockery, but it was vaguely uplifting. Nonetheless, disasters were averted, but Shuri celebrated too soon.</p>\n<p>A crash reverberated across the serene landscape. Although it was just a ceramic plate colliding against a marble floor, the noise was like a hundred explosions setting off all at once in Shuri's ears.</p>\n<p>\"Oh no!\" The Third Princess evoked. The girl tried, but her acting barely made the cut. Then again, there was little reason for the girl to try, people would believe her regardless - such is the power of the Imperial Favour. \"Elder Sister! You broke my most cherished plate. Consort Mother bought it for me from a renowned merchant from beyond the Vast Blue Expanse.\"</p>\n<p>A faint smirk flashed past the Third Princess' face. Shuri was about to release a sigh but caught the movement of her newest maid as she moved to refute the claim. Shuri quickly shot to her feet and said, \"What to do? Younger Sister, do not fret. I shall fix it in no time. As long as all the pieces can be retrieved, the plate can be put back with magic.\"</p>\n<p>\"B-But Elder Sister, you can't do magic,\" there was evident mockery in that jab. But since Shuri did not react, the Third Princess continued, \"W-Will Elder Sister really collect all the pieces.\" There was no rise in tone at the end to indicate a question, that was a statement.</p>\n<p>\"Of course,\" Shuri said with a smile and proceeded to lower herself and collect the pieces one at a time. As the Third Princess' entourage left, the servant who tipped the plate over kicked some debris into the pond while walking past her.</p>\n<p>\"Younger Sister has the capital to flaunt her power,\" Shuri explained to her maid. \"She intends to show me my place.\"</p>\n<p>\"B-But that is so unfair!\"</p>\n<p>'Naive,' Shuri thought and internally shook her head. \"Such is the Palace. The Emperor dictates what is fair, and His Majesty's fairness is fickle - it comes just as easily as it goes.\"</p>\n<p>The girl was taken aback for some reason. Her expression indicated a sense of disillusionment. Shuri could decipher the cause almost instantly. The girl was probably one of those starry-eyed folk who looked at the Palace and the Royal Family as the pinnacle of humanity. She probably volunteered to enter the Palace, unlike the vast majority of servants who were sold into the Palace by their families for a pretty price.</p>\n<p>\"But Your Highness-\"</p>\n<p>\"Earlier,\" Shuri interrupted. She had little patience for simpletons. \"Don't ever speak up on my behalf, EVER. If you do, then you must be prepared to face the consequences because I, for sure, won't take them on your behalf.\"</p>\n<p>Shuri did not wait for the bumbling brat to work through those words. Because she knew best how her younger sister's mind worked. The ploy of foisting nonsense claims and leaving immediately after was a tactic to induce a lapse in execution borne of anger. Her sister would return! Thus, Shuri was on a tight timer. Without wasting a moment, she started to speed walk away from the scene with the ceramic debris still in hand. Alas, today wasn't her day.</p>\n<p>Not a minute away from the gazebo, Shuri's advance was halted by a blockade of maids. They exuded an aura of danger - she surmised that they were probably all mages. It wasn't uncommon for maids to have such cultivations in the Inner Court, since a large portion of them were brought in with the Consorts and Concubines (before entry they would be the personal protectors and servants to those women).</p>\n<p>\"If it isn't Second Princess Shuri,\" A saccharine voice snaked its way through the blockade. Shuri grimaced as the voice matched a name from her memories.</p>\n<p>\"Consort Nuri,\" Shuri bowed respectfully.</p>\n<p>\"I happened to notice my daughter- the Third Princess fleeing in tears,\" Consort Nuri said. Although the statement implied further explanation from Shuri's end, the tone had a sense of finality to it. Shuri's sentence was passed well before the charges were even read. \"She refuses to tell me what's wrong, so I brought her along to settle all differences. As Princesses and sisters, it is your duty to live in harmony and promote peace in the Inner Court.\"</p>\n<p>From behind Consort Nuri, the Third Princess' head peeked out meekly. Shuri grit her teeth and awaited judgement.</p>\n<p>\"Is that the plate brought in by Merchant Rih-Yaz from beyond the Vast Blue Expanse?\" Consort Nuri said with a raised voice while nudging her nose towards the tightly gripped pieces in Shuri's hand. The woman feigned surprise, when in fact it was all an elaborate script. \"What happened? How did this break?\"</p>\n<p>\"M-Mother it was my fault! It slipped from my hand and shattered. Elder Sister was just covering up for me...\" her \"younger sister\" offered. The girl shivered and mumbled continuously while glancing fearfully at Shuri. Her words indicated that she accepted all the blame, but her body language spoke otherwise.</p>\n<p>\"This girl-\" Consort Nuri snapped. \"Are you speaking the truth? Do not cover up for others' mistakes! That is not how a Princess acts.\"</p>\n<p>Shuri held back a tired sigh. The plot was predictable. The younger Princess would tug back and forth before revealing, without saying a word, that it was Shuri's fault. There would be some demeaning punishment meted out to test Shuri's resolve and willingness to fight for the Emperor's favour. They would eventually give up after humiliating her a little, nothing Shuri couldn't handle.</p>\n<p>But a deviation in the plotline ensued the moment the Third Princess assigned blame upon Shuri.</p>\n<p>\"The Second Princess did not break the plate, it was that maid over there!\" Her daft maid shrieked with righteous fervour. This time, Shuri couldn't stop her palm from slapping her forehead.</p>\n<p>\"Who are you?\" Consort Nuri's head jerked sideways and a scrutinising gaze nearly folder the main in half.</p>\n<p>\"Y-Your Highness,\" the maid collapsed onto her knees and repeated. \"This slave can attest that the maid standing behind the Third Princess was the one to push the plate. This slave asks for justice, it wasn't the Second Princess' fault.\"</p>\n<p>What did the girl expect?</p>\n<p>\"Are you saying that the Third Princess is lying?\" Consort Nuri questioned with a cocked brow.</p>\n<p>\"Wha-?\"</p>\n<p>\"Did you just accuse the Princess of Lying?\" The Consort snapped back forcefully.</p>\n<p>\"I did-\"</p>\n<p>\"Did you lie?\" Consort Nuri asked the Third Princess, who shook her head innocently.</p>\n<p>\"It seems that my daughter did not lie,\" Consort Nuri scoffed. She then gazed nonchalantly at Shuri and asked, \"Was it my daughter's maid who broke the plate?\"</p>\n<p>Shuri's eyes caught the kneeling maid's gaze. Her eyes pleaded and her expression was hopeful. The girl was hoping that Shuri would attest to her claims and support her. Maybe then, true justice would be served, order would once again be returned to the world, all wars and famines would cease, people wouldn't get murdered, poverty would become a thing of the past, and everyone would just live happily ever after.</p>\n<p>How pathetic.</p>\n<p>\"It is true that I broke the plate. I beg for your forgiveness, Consort Nuri. I shall compensate the loss in any way possible,\" Shuri responded with a solemn tone.</p>\n<p>\"Make sure you do,\" Consort Nuri shot back with a harrumph. \"As for this one-\"</p>\n<p>\"It is a crime to slander the Royal Family,\" Shuri reminded.</p>\n<p>\"You must be aware of the punishment, then?\" Consort Nuri probed maliciously.</p>\n<p>The kneeling maid's face paled in shock.</p>\n<p>\"S-Second Princess-\"</p>\n<p>\"Do as you see fit,\" Shuri responded. She turned and met the maid's quivering eyes filling up with tears. \"After all, actions have consequences.\"</p>\n<p>Shuri turned and walked away, just as the buffed-up maids ganged up and grabbed the kneeling girl by her limbs. Another held open the girl's mouth and before the girl could react, she pulled out the tongue in one fell swoop.</p>\n<hr>\n<p>Shuri was brought out of her unconsciousness by a gaggle of gruff voices.</p>\n<p>\"<em>tsk</em> I thought he'd have something valuable after seeing so much gold in his pockets! It's all just clothes. What a waste!\" One voice rasped out.</p>\n<p>\"Can we even sell these?\" A second one asked rhetorically.</p>\n<p>\"Who knows! <em>huff</em> Why's this so heavy? Hey, you lot!\" The raspy one called out. Shuri could feel her surroundings tremor.</p>\n<p>\"Just roll it over!\" A third entry demanded.</p>\n<p>Then, Shuri's world started to spin. A sudden sense of weightlessness, then- CRASH!</p>\n<p>Light broke through the torn seams of the basket, and Shuri rolled out, battered and shaken senseless.</p>\n<p>\"Boys! We got a live one,\" The second voice joked lecherously.</p>\n<p>Shuri, whose sight cleared up, saw seven bloodthirsty and licentious faces targeting her.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/2jts1hbg535hufj59l7fdp9\">Chapter 262 - Evil of Man</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/1cioeuukx3qjg2kuud6kmma\">Chapter 260 - Moving Planets with My Mind</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}