{"pageProps":{"note":{"id":"vlfbRPCPYMVdb9Z5S8wkH","title":"Chapter 123 - Explaining Compartmentalisation","desc":"","updated":1643657633459,"created":1643655626368,"custom":{},"fname":"volume-2.chapter-123","type":"note","vault":{"fsPath":"vault"},"contentHash":"d1a3d2e50e246d5617fc00a5a03513c4","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-123","id":"vlfbRPCPYMVdb9Z5S8wkH","vaultName":"vault"},"value":"tags.Tsk","alias":"#Tsk","position":{"start":{"line":38,"column":1,"offset":3564},"end":{"line":38,"column":5,"offset":3568},"indent":[]},"xvault":false,"to":{"fname":"tags.Tsk"}},{"type":"wiki","from":{"fname":"volume-2.chapter-123","id":"vlfbRPCPYMVdb9Z5S8wkH","vaultName":"vault"},"value":"tags.Whatever...","alias":"#Whatever...","position":{"start":{"line":42,"column":1,"offset":3631},"end":{"line":42,"column":13,"offset":3643},"indent":[]},"xvault":false,"to":{"fname":"tags.Whatever..."}},{"type":"wiki","from":{"fname":"volume-2.chapter-123","id":"vlfbRPCPYMVdb9Z5S8wkH","vaultName":"vault"},"value":"volume-2.chapter-124","position":{"start":{"line":97,"column":3,"offset":10341},"end":{"line":97,"column":27,"offset":10365},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-124"}},{"from":{"fname":"volume-2.chapter-122","id":"aG2TZ00SzcR9vkxupvSkf","vaultName":"vault"},"type":"backlink","position":{"start":{"line":137,"column":3,"offset":13247},"end":{"line":137,"column":27,"offset":13271},"indent":[]},"value":"volume-2.chapter-123"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-123---explaining-compartmentalisation\">Chapter 123 - Explaining Compartmentalisation<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-123---explaining-compartmentalisation\"></a></h1>\n<p>Jean's face failed to betray her elation, as she held her own wand in her hands. She had only witnessed it a few times in her Senior Brother's possession and only observed it in use once during the combat between him and Gaige Bori in the recording artefact. Now that one lay in her hands, especially one that belonged solely to her, she couldn't wait to brandish it.</p>\n<p>\"Yours is a little shorter, compared to Markus',\" Teacher Larks explained. \"I felt it would feel more comfortable given your shorter arm length.\"</p>\n<p>Jean nodded in affirmation, \"It's perfect.\"</p>\n<p>\"I know that you're probably excited about getting your own wand,\" Teacher Larks continued, reading her mind. \"So, let's cancel today's session. I'll leave you with Markus.\"</p>\n<p>Teacher Larks turned to Senior Brother, who was inspecting his updated wand with a much larger mana gem at its base and instructed, \"Markus, I want you to take Jean through the basics about how to use the wand. Cover the basics only. We will expand on the intricacies together, just get her up and running for now. Go to the clearing in the woods, and avoid excessively damaging spells, okay?\"</p>\n<hr>\n<p>\"Let's recap. Can you explain the base concept of magic?\"</p>\n<p>\"Magic is the process of twisting the truths of the world to fit the mage's need.\"</p>\n<p>\"What are these truths?\"</p>\n<p>\"The established facts, laws and principles that govern the way in which the world works.\"</p>\n<p>\"How can we determine these established facts, laws and principles?\"</p>\n<p>\"In a system without the existence of mana and magic, it is the way the world operates. In this condition, we use the scientific method to determine these facts, laws and principles through deductive or inductive reasoning.\"</p>\n<p>\"Wonderful! A spell is analogous to a lie. A lie told to the world with the use of mana and the will of a mage, which artificially modifies these established facts, laws and principles. By extending this analogy, the closer the lie is to the truth, the less mana and exertion of a mage's will is required to uphold it,\" Markus concluded.</p>\n<p>The duo was currently in an artificial clearing in the woods far away from the orphanage, neighbouring the stream. It was an area designated by Guy, who wanted to create a region where his mage students could practice their magic without damaging the uninitiated populace residing in the village and the orphanage.</p>\n<p>\"The process of modular spellmaking pushes this methodology to its limits by breaking down the 'lies' into self-contained modules, or phrases, that can be chained sequentially or parallelly to formulate a more concise sentence. Through this, we essentially reduce the unnecessary flourishes that go into sustaining the 'lie' thus reducing the mana consumption AND the stress on the mage's will. This is why you and I were able to cast more advanced spells at a lower realm,\" Markus continued. \"The spell can be further optimised by replacing the mana transmutation steps with physical 'fuel'. Such as using physical carbon for |Fireball| instead of transmuting internal mana to carbon, or redirecting atmospheric water vapour for an |Ice Lance| instead of transmuting internal mana to water.\"</p>\n<p>Markus paused before declaring, \"While spellmaking is optimised through modularisation, it is possible to optimise spellcasting through compartmentalisation.\"</p>\n<p>He wore a proud expression and said, \"This was a strategy I developed through experimentation, which was further advanced with the assistance of Master and Teacher Jeeves.\"</p>\n<p>Jean looked at Markus with sparkling eyes, 'I knew that Senior Brother was awesome!'</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Tsk (Private)</a>! What a show-off!#</p>\n<p><em>It isn't showing off if he is capable.</em></p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Whatever... (Private)</a>#</p>\n<p>Markus waved his jacket aside to reveal a leatherbound book with a metallic frame and a blue mana gem embedded at its centre. Jean's eyes sharpened as she immediately recollected its appearance from the recording. In fact, it hadn't changed at all or showed any signs of wearing. Clearly, it had been well taken care of.</p>\n<p>The grimoire was hanging by a looping chain, perfectly secured, which Markus unlocked with a key hidden in his handsfree belt satchel which he carried with him at all times. Jean only recently found out that her Senior Brother carried a myriad of basic ingredients that he referred to as 'fuels' for his spells. She wondered why he did so ALL THE TIME, to which he would say, \"A mage must always be prepared!\"</p>\n<p>As soon as the grimoire was separated from the chain, the blue gems lit up, activating the first set of enchantments that allowed it to hover before Markus. Markus internally called out to his section of interest, causing the pages to flip rapidly. Once it stopped, Markus glanced at the page and nudged it gently towards Jean.</p>\n<p>The grimoire hovered at a level and arrived in front of Jean. \"That right over there is a compartmentalised version of the modularised |Fireball| spell.\"</p>\n<p>\"This seems... complicated. Why are there two spell circles?\" Jean asked while analysing the familiar, yet unfamiliar, spell circles on the page.</p>\n<p>\"I will show you what it means soon. But first, can you tell me if anything stands out?\" Markus asked.</p>\n<p>Jean squinted slightly and spoke in a steady stream of consciousness, \"Based on my understanding, the spell circle on the right is the most similar to the |Fireball| spell, considering that it has the pertinent Source Components for the carbon fuel and oxygen. But then... Wait a minute!\" Jean hummed quietly and drilled down on the spell circle on the left with increased aggression.</p>\n<p>\"This... seems to contain the targeting and projection components. But it's unstable, right?\" She spoke out loud.</p>\n<p>\"Technically it should be. But here's the interesting bit,\" Markus commented as he gestured for her to look towards him.</p>\n<p>\"This right over here is the spell circle for the regular |Fireball| you and I know.\" As he said this, a familiar purple ethereal projection materialised starting from the base of the wand held in Markus' right hand, where the mana gem was attached. He activated it slowly, causing it to propagate along the length of the wand.</p>\n<p>\"Now, you may notice that I am relying on a transmutation Source Component here, instead of using a physical Source Component,\" Markus pointed out.</p>\n<p>He then finalised the spell by directing his mana into the circle, causing a ball of fire the size of an apple to form in at the wand's tip, and then ejected it with a short flick. The ball hurtled at a breakneck speed and collided against a protruding rock outcrop near the bank of the stream. It exploded unimpressively, leaving a black sooty mark on the rock.</p>\n<p>\"But now, I'm going to apply the compartmentalised version of the spell. So keep a close eye!\"</p>\n<p>Markus initiated the new spell. This time, two different, spell circles materialised. One originating from his shoulder, while the other originated from the large, now illuminated, white mana gem at the base of the wand. The circle from his shoulder descended towards his hand at a faster rate, while the one from the base of the wand moved much slower.</p>\n<p>\"You would expect for these two seemingly incomplete circles to collapse, but-\" right then, the two circles collided against each other and like two jigsaw pieces meshing together, they formed a complete diagram that assumed a magnificent purple hue signifying a stable activation. \"-they come together to form the |Fireball| spell!\"</p>\n<p>The circle once again followed the earlier sequence of rotation, formation of a ball of fire, and projection, ending with the ball colliding at the same location on the rock outcrop.</p>\n<p>\"Did you see that?\" He asked Jean, to which she nodded vehemently with an unusually serious expression.</p>\n<p>Markus revealed a faint smile and said, \"Master told me to only teach you how to form the standard spells using the wand. As projectile spells are usually beyond the Middle stage of Mana Condensation realm, you will notice that with the wand this becomes possible. BUT, I don't want you to take my word for it. First, try to form the |Fireball| spell circle without the aid of the wand.\"</p>\n<p>Jean nodded affirmatively and followed the standard steps to activate a spell circle. She materialised the circle's geometry in her mind and exercised her will to form the spell circle on her right palm. The purple construct start to develop slowly and finally assumed the targeted circle. Jean then moved on to the next step: activation. However, right as she channelled her mana into the circle, it wobbled and flicked unstably, before collapsing.</p>\n<p>\"As expected,\" Markus said lightly. \"Now, I want you to do the same, except with your wand. A point you must remember: when forming the circle, you need to sense out the mana gem in the wand. Project the spell circle formed through your will onto the mana gem, and let it handle the rest.\"</p>\n<p>Jean followed Markus' instructions and produced her wand. She followed the earlier steps, except she now transmitted her intended mana circle onto the mana gem with resonated within her senses. Slowly, the spell circle materialised from the mana gem and propagated towards the tip of the wand. Once in position, Jean channelled her mana towards the circle, which surprisingly didn't collapse like last time and followed the same visual sequence of an activated and successful spell.</p>\n<p>\"Notice here that you are using a transmutation Source Component as well. However, it isn't failing!\" Markus accented, which surprised Jean further. Usually, at this stage, she would have to rely on a carbon substitute for ignition. But this time, without a problem, a ball of fire formed at the tip of her wand which she then flicked like Markus towards the rock outcrop.</p>\n<p>The ball hurtled in a flat parabolic path before falling a short distance in front of the outcrop and fizzled out with a light pop.</p>\n<p>\"Well, at this stage I think you should still rely on a physical Source Component. There was insufficient burning fuel and oxygen concentration to sustain the fire,\" Markus said with a wry smile. \"We aren't finished yet though! Although Master plans to cover the compartmentalised spellcasting at a later stage, I want to show you the added benefits of the wand to help you understand the value of the tool in your hand.\"</p>\n<p>Markus excitedly approached Jean and started to explain the nuances of the compartmentalised process with increased vigour.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/nB7lGOAd7kCMof7T8oRDG\">Chapter 124 - Do Not Try This At Home (Redux)</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/aG2TZ00SzcR9vkxupvSkf\">Chapter 122 - Moving On</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}