{"pageProps":{"note":{"id":"vuhrl21c8i583dfblglx24q","title":"Chapter 386 - Prodigy Among Us","desc":"","updated":1699468903447,"created":1696846135948,"custom":{},"fname":"volume-5.chapter-386","type":"note","vault":{"fsPath":"vault"},"contentHash":"6fc5eb56dd70e9dc306cc25a9d4d8d3c","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-386","id":"vuhrl21c8i583dfblglx24q","vaultName":"vault"},"value":"volume-5.chapter-387","position":{"start":{"line":137,"column":3,"offset":11680},"end":{"line":137,"column":27,"offset":11704},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-387"}},{"from":{"fname":"volume-5.chapter-385","id":"npc2lxlesihalriqd6rm796","vaultName":"vault"},"type":"backlink","position":{"start":{"line":81,"column":3,"offset":9681},"end":{"line":81,"column":27,"offset":9705},"indent":[]},"value":"volume-5.chapter-386"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-386---prodigy-among-us\">Chapter 386 - Prodigy Among Us<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-386---prodigy-among-us\"></a></h1>\n<p>Jean's return to the True World Sect kind of dissolved into the background, overshadowed by the more imminent concern (the state of Revian's cultivation) that occurred at the same time as her arrival. She didn't expect a grand welcome or anything fancy of that sort, but it did sadden her that her eventful trip did not receive recognition of any kind. Of course, there was also the fact that she couldn't share her monumental accomplishment with many people. Of course, Marie knew already even before Jean left the Sect. And the first conversation she had with her was something out of a covert operations novel.</p>\n<p>\"So, did the bug get repelled?\" Marie asked casually.</p>\n<p>Jean scrunched her face and looked into Marie's eye. In return, the girl wiggled her eyebrows, giving a knowing look. Jean's lips twitched. She then coughed to clear her throat and said, \"It's been repelled and the fields have been sprayed with pesticide so that it never returns again.\"</p>\n<p>\"Congratulations! Did Kili help you out in... distributing the pesticide?\" Marie followed up. \"Did you hit a snag in determining the exact concentration?\"</p>\n<p>At this point, Jean wasn't certain if the talk was still about the Plague or if Marie was actually talking about pesticides. Nonetheless, Jean stuck to the theme as well as she could. In the end, she received a congratulatory pat on the back and a sincere thumbs up. It was nice. But Jean still felt incomplete. Not to brag, but her accomplishment of eradicating the Plague wasn't trivial! But as the week passed after her arrival, she found her day returning to the usual grind.</p>\n<p>In the following week, she was called in for a special meeting of all mages in the Foundation Establishment realm and above. After going through her morning rounds and completing the check-up of two members who were on her docket, she departed from the clinic and made her way towards the staff room. As she approached the location, she noticed a light barricade made of wood and red rope blocking off the path.</p>\n<p>\"This is new,\" one of the Sect's members said while nudging the rope. \"Do you know what this is?\"</p>\n<p>\"I saw Senior Brother Markus pass through just now. He said that only Foundation Establishment realm mages are allowed. There's some meeting going on,\" the member's companion said from beside her.</p>\n<p>\"A meeting? I get the exclusivity, but doesn't this rope just make it a little obnoxious?\" The first responded vexedly.</p>\n<p>\"I get what you mean. The Sect isn't usually this overt in blocking off access,\" her companion said.</p>\n<p>\"I thought the Sect was support to be open and free,\" the first argued. \"This goes against everything the Sect Leader talked about in the welcoming speech!\"</p>\n<p>\"Calm the heck down!\" Kevan said as he approached the duo arguing loudly. \"Organisations need to make decisions all the time. This one is probably something very sensitive which may destabilise the peace if others know about it.\"</p>\n<p>\"Who gets to decide what is sensitive and what isn't, huh?\" The first snapped back, while her friend slowly grabbed her and and started to pull her away. \"Easy does it, tiger! Sorry Kevan, she lost her weekly allowance in a game of Hover-Sack against Casey-\"</p>\n<p>\"I didn't lose! It clearly touched my leg before it fell on the ground,\" the first clarified angrily.</p>\n<p>\"We all saw what happened,\" Casey snorted as she walked into the scene. \"Don't try to spread lies.\"</p>\n<p>\"It looks like you woke up today and chose to get beaten into a pulp,\" the first berated.</p>\n<p>\"Really? But I wasn't the one who got beat,\" Casey snapped back.</p>\n<p>At this instance, Jean stepped in and said, \"Need I remind everyone of the Sect's rules on conflict resolution? Or do we need another assembly with people reading off their letters of apology to jog everyone's memory?\"</p>\n<p>Everyone swallowed a mouthful of saliva in fear before revealing a twitching smile and escaping from the scene.</p>\n<p>\"Good morning, Senior Sister Jean!\" Revian greeted as he walked over. By his side, strode Yohn with confident steps and luminous eyes. The blind boy bowed lightly as a greeting.</p>\n<p>\"You don't need to call me that. We are at the same level of seniority,\" Jean reminded.</p>\n<p>\"Senior Brother Markus said the same thing. But old habits are hard to drop,\" Revian admitted with a shrug. He stood before the red rope and looked at it with a conflicted expression. \"I was invited to this meeting, but I don't know if I should go in.\"</p>\n<p>\"Why not? Aren't you also in the Foundation Establishment realm?\"</p>\n<p>\"Technically-\"</p>\n<p>\"Then stop sulking and just go!\" Jean interjected while pushing the boy through. \"Do you need me to drag you in as well, Yohn?\"</p>\n<p>Yohn shook his head with a smile and followed Jean. As the three entered the room, they were greeted from all sides by the members present already. Marie and Elder Nara were closest to the door. The latter was sitting on a chair with his legs folded in the lotus position while Marie was leaning casually against the wall. Markus was sitting at his desk and talking with Shuri. Jean noticed Furion talking with the Sect Leader, who was at the farthest corner of the room.</p>\n<p>The murmuring continued for a few minutes before the door opened again and Matron Reva entered with a box in her hand. She gave everyone a welcoming smile and placed the box on the table at the centre of the room and gave Jean a mischievous smile before walking over to the Sect Leader.</p>\n<p>The Sect Leader finished his conversation with Furion and had a short exchange with Matron Reva before walking forward and addressing the room. \"The reason I called everyone here today is because I have a very important announcement to make. I could do it before the whole Sect, but I believe the contents of this announcement are far too sensitive and weighty for others to bear.\"</p>\n<p>Sect Leader Larks gestured towards Jean and called her over. \"How many of you are keeping up to date with the news of the Empire?\"</p>\n<p>Only Furion's hand rose up in response, which the boy accentuated with a disdainful click of his tongue, \"You people are literally living under a rock!\"</p>\n<p>The Sect Leader silently gestured for Furion to keep quiet and said, \"We will now communicate through mana transmission for security reasons.\"</p>\n<p>His following words were relayed directly into Jean's mind, \"The Plague of Dark Cleansing has been effectively eradicated.\"</p>\n<p>A faint gasp was heard, which Jean sourced to have originated from Shuri who immediately schooled her surprised expression.</p>\n<p>\"While the news is huge, its transmission is being limited through the slowest of channels by the Empire to stop people from crowding over to the location. The Empire has also pushed for repopulation of the area, and all the refugees flocking to the capital are being relocated there.\"</p>\n<p>\"Now, you all must be wondering who managed to eradicate the persistent disaster?\" The Sect Leader followed up. \"Officially, this information hasn't been revealed. In truth, the Empire doesn't know who was responsible for this.\"</p>\n<p>\"However...\"</p>\n<p>Sect Leader Larks looked around and saw the intrigued faces in the crowd (except for the two soothsayers and Furion).</p>\n<p>\"The person responsible is amongst us, in this very room. Grace, if you could please do the honours-\"</p>\n<p>Matron Revan walked over and opened the box, revealing a beautiful cake with the text, \"Congratulations Jean!\" written on it.</p>\n<p>\"Let us congratulate Jean on her amazing achievement. She managed to do something mages twice her level failed to do. Now remember, guys, that there is a reason we aren't sharing this with everyone even though it's something that needs to be commemorated. Jean and the True World Sect aren't ready to handle the publicity if this information goes public. I know it is unfair to Jean, but this is the way it has to be. For that, I apologise to you, Jean.\"</p>\n<p>Everyone clapped silently as Jean cut the cake in celebration. Matron Reva then took over and started to distribute the treat to all present.</p>\n<p>\"My goodness!\" Markus exclaimed. \"Great job, Jean! You have to tell me how it all happened.\"</p>\n<p>The Sect Leader interjected with a loud shush, \"Let's please continue this conversation in mana transmission.\"</p>\n<p>\"You know I can't do that, right?\" Matron Reva said with an unimpressed scowl. \"Why did you even call me here? Just to deliver the cake?\"</p>\n<p>The Sect Leader bit his tongue, cleared his throat and rephrased, \"Keep the conversation at a low volume while Elder Nara and I go around placing a muffling ritual formation.\"</p>\n<p>And with that, the Sect Leader Larks and Elder Nara walked out of the room, but only after congratulating Jean.</p>\n<p>\"I've only heard rumours of the Plague,\" Yohn cut in. \"Was it really as deadly as described?\"</p>\n<p>\"It is,\" Jean affirmed. \"My mom died in it, and she was in the Core Condensation realm.\"</p>\n<p>\"I-I'm sorry,\" Yohn offered hurriedly.</p>\n<p>\"Please, don't,\" Jean stopped him. \"You have no reason to be.\"</p>\n<p>\"So how did you do it?\" Shuri asked as she quickly covered the distance between herself and Jean. There was a maddened sense of curiosity in her eyes that caused Jean to take a step back in caution.</p>\n<p>\"Umm... I used natural selection, sort of,\" Jean said before methodically expounding on her process.</p>\n<p>\"I don't think I would have such patience,\" Marie admitted.</p>\n<p>\"The only reason I held out was BECAUSE you hinted at it working,\" Jean retorted. \"If you hadn't vouched for the method, I wouldn't have stuck through it.\"</p>\n<p>\"It's weird, isn't it?\" Marie commented. \"If you know the future, you have the patience to sit through the most mundane tasks. But if the future is unknown, then patience suddenly becomes a finite resource.\"</p>\n<p>\"Let's not delve into trite philosophy in such a happy moment,\" Markus said as he cut into the conversation. \"So Jean, why don't you tell us a bit more about your travels? Any interesting cases?\"</p>\n<p>Jean let out a light chuckle before elaborating on everything she experienced on her journey. \"It was all quite standard, to be honest. Quite a few emergency treatments. Oh! And a delivery of conjoined twins! They were joined at the head, so I had to dissect and surgically separate the brain. That was a challenge! Unfortunately, I could only save one.\"</p>\n<p>\"How'd you dissect and reconstruct the brain?\" Shuri asked.</p>\n<p>\"To be honest, it was a lot of improvisation,\" Jean admitted. \"I'm still not satisfied with my work. I'm certain that my novice procedure will have left the poor child with some developmental disorders.\"</p>\n<p>\"Better to live with a handicap than to die, right?\" Yohn joked with a smile. No one laughed at that joke. Yohn quickly retreated into his coat in embarrassment.</p>\n<p>\"I did not know you had such a dark sense of humour,\" Marie commented with a confused expression.</p>\n<p>\"Your humour often reflects how you see the world,\" Yohn volleyed while waving his hand in front of his empty eye sockets. That joke elicited a muffled snort from the audience.</p>\n<p>\"How do you remap the neurons?\" Shuri ignored the levity and marched onwards.</p>\n<p>\"Are you interested in neurosurgery?\" Jean questioned, to which Shuri shook her head and said, \"I'm interested in the way the brain works in general. I'd love to dissect one, but the Sect had put a hold on animal dissection until your return and go ahead.\"</p>\n<p>\"I didn't think this was a topic that you would be intrigued by,\" Jean commented. \"Since this is the case, let's meet up tomorrow. I recently ordered a cadaver for the same reason - to investigate the brain in more detail. I don't want to lose another patient like that again. The cadaver should be delivered by tomorrow. And even if it isn't, let's start a discussion on how to lay out our investigation. What do you think?\"</p>\n<p>Shuri affirmed with a resolute nod and went to get another serving of cake.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/cuvl7ac4mh16q9cvhd60fts\">Chapter 387 - In Your Head</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/npc2lxlesihalriqd6rm796\">Chapter 385 - What is a Mage?</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}