{"pageProps":{"note":{"id":"WOdRTMUbiCIWbvxCT5dII","title":"Chapter 097 - A New Addition","desc":"","updated":1643657047415,"created":1643653712934,"custom":{},"fname":"volume-2.chapter-097","type":"note","vault":{"fsPath":"vault"},"contentHash":"c0a407e8d9323e8b349156e57fa6190e","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-097","id":"WOdRTMUbiCIWbvxCT5dII","vaultName":"vault"},"value":"volume-2.chapter-098","position":{"start":{"line":131,"column":3,"offset":10445},"end":{"line":131,"column":27,"offset":10469},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-098"}},{"from":{"fname":"volume-2.chapter-096","id":"R8Qvpi58K6esp1Ojm9mc9","vaultName":"vault"},"type":"backlink","position":{"start":{"line":183,"column":3,"offset":12692},"end":{"line":183,"column":27,"offset":12716},"indent":[]},"value":"volume-2.chapter-097"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-097---a-new-addition\">Chapter 097 - A New Addition<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-097---a-new-addition\"></a></h1>\n<p>Following the morning session with his magically inclined students, and Marie, Guy took a quick break within the RoK to formulate his lesson plan for his regular students.</p>\n<p>(You've secured your third student,) Mast commented as he instantaneously materialised next to Guy.</p>\n<p>'Just three?' Guy muttered in confusion. He falsely assumed that Marie would have been tagged as the fourth student. Apparently, the girl was still unconvinced about Guy's capacity as a teacher.</p>\n<p>'Makes sense. She should probably be a little miffed about me denying her from learning magic,' But Guy wasn't planning to bend on his stance. He firmly believed in his approach of forming a mature goal before embarking on the path of magic. Call it paranoia, but he had read way too much casual online literature in which characters turned into rogue, mass-murdering monsters after amassing unbelievable power. Basically, Guy didn't want to play a role in unwittingly raising the next magical murderhobo.</p>\n<p>'No matter. If she is meant to be, then she is meant to be. I can't force it,' He uttered to assuage himself.</p>\n<p>Following that, he resumed his preparations in earnest. One of the best parts about catering to a younger age group was the beautifully excessive amount of colours present within their educational material. When it came to kids, maintaining their attention for an elongated period was the most common challenge faced by educators. Over time, experts in the field deduced optimal methods to improve the assimilation of knowledge amongst kids, and the most prevalent and straightforward solution was to increase the vibrancy of each page to grasp the kids' fleeting attention.</p>\n<p>Apart from that, there was also the moderation of content on each page. Kids' minds aren't developed enough to comprehend most abstract and out-of-the-way topics that could easily be absorbed by children of a higher age group. However, on modern Earth, due to the rapidly growing quantity of knowledge deemed compulsory, it was imperative to inculcate some of the abstract concepts into the kids so that they could understand the more complex topics at a later stage.</p>\n<p>For instance, referring to an earlier topic, programming and coding wasn't something deemed necessary for children to dabble in, during their schooling in the 80s and 90s. It was only during the early 2000s and onwards, when technology become more accessible and ubiquitous, that the subject started to encroach into the school curriculum. Later on, around the time of Guy's passing, it was even taught in primary schools as an optional or extra-curricular topic.</p>\n<p>In some places, primary school children were also being introduced to Arduino (micro-controller) or LEGO MINDSTORMS platforms for hardware programming!</p>\n<p>Alas, while Guy would have enjoyed bringing the joy of building basic robots and doo-dads with the children under his tutelage in this world, the technology here just hadn't advanced far enough to accommodate such endeavours. Furthermore, Guy couldn't do anything to make up for it since he wasn't knowledgeable in the pertinent fields to spearhead such projects by himself.</p>\n<p>After he was satisfied with his work, Guy retreated from the RoK with a set of printed books in his hands.</p>\n<p>Upon his re-entry into the real world, Guy was surprised to notice two children already in his classroom. The presence of one, Kano, wasn't a surprise to Guy as the kid basically lived here. However, Guy was interested in the attendance of the boy's fraternal twin, Dora.</p>\n<p>Guy didn't have many interactions with the girl following his lodging in the orphanage. More often than nought, the girl would flee upon his approach. For some reason, she was exceedingly cautious in interacting with Guy. However, Guy also noticed that when it came to interacting with other more familiar people, the girl was unbelievably extroverted.</p>\n<p>\"Kano! You're early!\" Guy said with an inviting gesture. The boy returned with a dazzling smile and approached Guy with a massive book in his hands.</p>\n<p>After some deep consideration, Guy had decided to bring out \"The Hobbit - or There and Back Again\" for Kano to peruse. Although the boy hadn't fully solidified his reading capacity, he was constantly in a thirst for more. So, Guy decided to foist \"The Hobbit\" onto the boy to devour at a slow and steady pace.</p>\n<p>\"Good morning, Teacher L-L-Larks!\" The boy greeted.</p>\n<p>Guy shifted his gaze towards the shy girl twisting in place a few steps behind Kano and waved at her, \"Good morning Dora.\"</p>\n<p>Dora jerked and returned the greeting, \"Good morning, Teacher Larks!\"</p>\n<p>\"So what's up?\" Guy responded.</p>\n<p>\"Teacher Larks, Dora wants to join in on the lessons,\" Kano requested. \"Is that okay?\"</p>\n<p>\"Why wouldn't it be okay? Dora is this what you want?\"</p>\n<p>With a low mutter, Dora answered, \"Y-yes...\"</p>\n<p>\"Alright. Since it is your first class with me, why don't you sit up front with Kano?\" Guy said while pointing her towards the desk closest to the blackboards.</p>\n<p>In response, the girl meekly followed Kano and assumed the seat.</p>\n<p>Kano dropped his massive book on the desk and started to read from where he left off, his pointer finger drifting at a snail's pace over the lines on the text and his lips oscillating through sounds with each new word. Dora on the other hand sat in place for a while, her gaze locked on the page Kano was currently at.</p>\n<p>After a while, it drifted off to a rustling tree branch a little ways behind the blackboard. It didn't stay there for long though, because almost immediately, it was drawn to a line of ants soldiering next to her seat. A few seconds after, it went towards the page Kano turned to.</p>\n<p>Finally, it locked on to the eyes of Guy who was staring intently at her and observing her every action. Dora noticed his gaze and embarrassedly looked down into her hands, receiving a low chuckle from Guy in the process.</p>\n<p>Right at that point, Dora heard the sounds of familiar voices and light footsteps coming towards the classroom.</p>\n<p>\"Durkas I wanna see Sparky too!\"</p>\n<p>\"She just returned, you guys. I'll let you see her some other time.\"</p>\n<p>\"Awww,\"</p>\n<p>The kids filed into the class, greeting Guy as they did, and sat down at their usual seats.</p>\n<p>\"Huh? Dora? What are you doing here?\" Durkas asked. He was surprised that someone else was sitting in his usual spot.</p>\n<p>\"Dora will be joining us from today. Can you please sit somewhere else, Durkas?\" Guy asked, to which the child nodded and moved to a seat a row back.</p>\n<p>The classroom settled down and the conversations died down after Guy walked up and made his presence known.</p>\n<p>\"Since we have a new student with us today, I want to go through everything we have covered till now as a recap,\" Guy declared.</p>\n<p>\"Let us start with 'Parts of Speech'. Durkas, would you like to list them out for us?\"</p>\n<p>Durkas stood up and orated, \"Noun, Pronoun, Verb, Adjective, Article, Adverb, Preposition, Conjunction and Interjection are the 9 main parts of speech.\"</p>\n<p>\"Good! Lori, can you give explain what a Noun is?\"</p>\n<p>A girl sitting next to Durkas stood up and answered, \"A noun is a person, place, animal, or thing.\"</p>\n<p>\"Good job! Rhine, can you give us an example of a noun?\"</p>\n<p>\"Rhine!\" The boy in question exclaimed while pointing to himself, eliciting an array of laughter from the class.</p>\n<p>\"That is correct,\" Guy commended with a chuckle. \"Can you tell me if that is a proper or a common noun?\"</p>\n<p>The boy tilted his head and contemplated it for a while. \"Proper noun?\" He answered with an unsure elongation in his tone.</p>\n<p>\"Who else agrees with Rhine?\" Guy extended the question to the entire classroom. In response everyone else raised their hands, causing the boy to exhale in relief.</p>\n<p>\"Good job, Rhine!\" Guy added.</p>\n<p>\"Alright, who can explain what a pronoun is?\" Guy continued the discussion. As he did so, he kept his attention trained on Dora, to observe her reactions. In the process, Guy discovered that the girl's attention span was incredibly flighty. She was focused on the discussion one minute, and the next she was following a distant sound emanating from a bush nearby.</p>\n<p>Guy wasn't the least bit offended or annoyed by this. After all, he had done his due diligence before and had heard of the girl's troubles from the previous elderly tutor.</p>\n<p>In fact, Guy had anticipated the girl's participation in his classroom from the very beginning. To that end, he had even formulated methods to assist the girl in her ventures, given that she was interested in learning in the first place.</p>\n<p>Therefore, Guy's primary goal today was to figure out if she was motivated or not. And Guy confirmed that Dora was definitely responsive to learning, based on the repeated flashes of irritation showing on her face every time she realised that her attention had deviated.</p>\n<p>Guy did not want to bring this up in front of the class and discourage the girl, since he knew that she was already reprimanding herself internally. Drawing attention to it publicly would only shame her further and dissuade her to the point of giving up. With that in mind, Guy continued the class till the very end.</p>\n<p>Once the session was finished, the group of kids filed out while continuing their earlier conversations.</p>\n<p>Kano also rose from his seat and closed his book, leaving a dry leaf on the last page he was at to act as a bookmark.</p>\n<p>Dora also stood up with a dejected frown on her face. However, before she could leave Guy called out to her, \"Dora! Can you please stay back for a moment?\"</p>\n<p>Dora bit her tongue and sucked in a long breath of cold dry air. She had hoped that Teacher Larks had overlooked her frequent transgressions during class. However, it seemed that her hopes were unanswered.</p>\n<p>\"How did you find the class?\" Guy continued.</p>\n<p>Dora's eye's flickered around as she searched for words. Yet before she could voice her thoughts, Guy asked, \"Were you having difficulty concentrating?\"</p>\n<p>The girl shrunk herself in preparation for a scolding, however, what followed befuddled her completely.</p>\n<p>\"Can you please explain your problem to me? Is the subject boring?\"</p>\n<p>\"N-No! That's not it...\" Dora interjected immediately.</p>\n<p>\"Then?\" Guy asked with visible concern.</p>\n<p>Dora stuttered as her mind processed the unusual turn of events. She had expected a fierce reprimand like with the elderly tutor, yet what transpired was the exact opposite! She didn't think that her infraction would be met with worry, as opposed to the usual animosity.</p>\n<p>After taking a while to centre herself, Dora spoke up meekly.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/YXtOGS0uN4njgdEPjZMQw\">Chapter 098 - Dora Reva</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/R8Qvpi58K6esp1Ojm9mc9\">Chapter 096 - Learning by Teaching</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}