{"pageProps":{"note":{"id":"x1xc9bb139jzacqkcn6jsk2","title":"Chapter 197 - Dabbling in Legalese","desc":"","updated":1657477136135,"created":1655022493791,"custom":{},"fname":"volume-3.chapter-197","type":"note","vault":{"fsPath":"vault"},"contentHash":"9adf568960ed900fe51fbfccf7460ac7","links":[{"type":"wiki","from":{"fname":"volume-3.chapter-197","id":"x1xc9bb139jzacqkcn6jsk2","vaultName":"vault"},"value":"volume-3.chapter-198","position":{"start":{"line":81,"column":3,"offset":10943},"end":{"line":81,"column":27,"offset":10967},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3.chapter-198"}},{"from":{"fname":"volume-3.chapter-196","id":"furnaf02bjstadyokbk7xv7","vaultName":"vault"},"type":"backlink","position":{"start":{"line":75,"column":3,"offset":9583},"end":{"line":75,"column":27,"offset":9607},"indent":[]},"value":"volume-3.chapter-197"}],"anchors":{},"children":[],"parent":"hk3a0wjaksh6uap9l9fm0wn","data":{}},"body":"<h1 id=\"chapter-197---dabbling-in-legalese\">Chapter 197 - Dabbling in Legalese<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-197---dabbling-in-legalese\"></a></h1>\n<p>Karmin had to physically hold himself back from hugging the man in front of him and kissing him on the lips. As a businessman, Karmin quickly envisioned the possibilities professed by the device presented by Guy. Using his knowledge of blacksmithing, he could confirm that what was proposed was within the limits of reality and was possible to materialise.</p>\n<p>Guy noticed that Karmin was on the cusp of tipping over in favour of the investment and decided it was time for the coup-de-grace.</p>\n<p>\"This device is a trailer of what my business aims to output. Machines and solutions that can simplify overlooked problems that prevail in society. Let us take a step back and look forward in time. A decade later, more than 25% of publishers in the world utilise this Press to produce their books. With the ease of manufacture and distribution, more and more people have access to information and the average literacy of the population increases. Those of the lower class that believed they could never escape their station due to the educational barrier blocking their advance no longer have to worry about their illiteracy, since just about anyone can learn to read and write with a small expense of a few copper coins to purchase a book that teaches them how to read.\"</p>\n<p>\"Why would you buy a book to learn to read?\" Karmin blurted out.</p>\n<p>\"Pictures,\" Guy answered. \"See! This opens up a new avenue altogether. Books that teach people to do things. A century into the future, anyone can write and publish a book. A farmer could write a book teaching others how to tend to different crops. An adventurer could write a book teaching others of the fundamentals to survive in the wilderness.\"</p>\n<p>\"Solutions that can change the future,\" Guy highlighted. \"You can expect more of those from the company.\"</p>\n<p>Karmin nodded subconsciously, but his mind was already dwelling on the future as Guy indicated. Except, he wasn't envisioning all those philanthropic outcomes, he was mentally counting the gold coins spilling into his coffers.</p>\n<p>\"This... Okay!\" Karmin declared. \"You've convinced me. I am prepared to invest in this company.\"</p>\n<p>\"Wonderful! Now comes the often unpleasant part of this interaction: the negotiation,\" Guy said as his enthusiasm dampened. \"I have prepared a preliminary contract to cement our agreement. Please have a read and if you have any problems, we can flesh out the details further.\"</p>\n<p>Guy produced another stack of papers, much thicker than the proposal, and plopped them in front of Karmin. As he read them, Karmin's expression turned complicated, not because he had an issue with the contents, but rather because the content was extremely thorough and tackled every question he could and couldn't think of.</p>\n<p>\"Verum Trading Company is affiliated with and a subsidiary of the True World Sect. At the time of drafting this contract, the Sect Leader and primary representative for Verum Trading Company are Guy Larks. The Burning Forge is owned by and operated by Karmin Zola. Legally, The Burning Forge and Karmin Zola are a singular entity.\"</p>\n<p>\"...\"</p>\n<p>\"The Burning Forge will be the sole manufacturer for Verum Trading Company's products for the duration of ten years following the validation of this contract. However, the patents and rights for the products will be fully owned by Verum Trading Company. The Burning Forge may not sell or distribute products owned by Verum Trading Company to external parties. Violation of this clause will be subject to the following repercussions...\"</p>\n<p>\"...\"</p>\n<p>\"As an investor, Karmin Zola can choose to receive earnings equivalent to the percentage invested. These earnings will be in the form of annual dividends, which are percentage distributions of the profits accumulated by the business yearly. Alternatively, Karmin Zola can opt to reinvest the dividends into Verum Trading Company for an increase in owned stake. The stake ownership is calculated using the following criteria...\"</p>\n<p>\"...\"</p>\n<p>\"Every new product developed by Verum Trading Company that is to be manufactured through The Burning Forge will be subject to another contract that will determine the cost of goods, resources, and so on. These contracts will be active for the duration of the manufacturing rights aforementioned and will be subject to renegotiation once the manufacturing rights held by The Burning Forge have lapsed. Verum Trading Company, and by extension the True World Sect, will be guaranteed a complementary unit of every new product manufactured by The Burning Forge.\"</p>\n<p>\"...\"</p>\n<p>\"The stake for Verum Trading Company will be held by Karmin Zola, owner of The Burning Forge, till their termination. It is non-transferable. If Karmin Zola wishes to transfer their stake to a third party, the recipient must be able to purchase the stake according to its price, which corresponds to the percentage invested scaled to the valuation of the company at that point in time. Transfer of stake between individuals will require a confirmation from all other stakeholders.\"</p>\n<p>\"...\"</p>\n<p>Karmin dabbed the sweat from his forehead as he averted his eyes from the stack of text. He still had a quarter of the stack left. He had seen many contracts in his lifetime, this was by far the most... everything!</p>\n<p>\"This is quite verbose,\" Karmin commented. That was putting it lightly. Karmin had never seen a contract so exhaustive!</p>\n<p>\"If we're doing this, we're going to do this right. Although we are closely acquainted, I wish to separate our personal and professional relationship. This contract is my way of showing my sincerity in seeking your assistance in this matter as a successful businessman,\" Guy explained with a forthright tone. When it comes to money, he had learned that it was often best to draw clear lines. Misunderstandings stemming from mishandling of money often lead to the worst kinds of conflicts, and most of the time the damages sustained through these conflicts - relationship-wise - were ones that never healed. Therefore, for this agreement, Guy put together a meticulous contract after crawling through the RoK for examples, leaving absolutely no room for misunderstandings or contention.</p>\n<p>Karmin coughed lightly to mask his embarrassment and said, \"It will take me some time to go through this. Don't get me wrong, I am leaning toward this partnership, it's just that, as you said, we need to take this seriously and approach this collaboration with a purely business-oriented lens.\"</p>\n<p>Guy smiled back, expressing his satisfaction, and said, \"That's good to know. No issues! I strongly urge you to go through this contract and mark any amendments you wish to implement, and we shall work out those kinks accordingly. I shall be in Radiant City for a month at least, I hope to produce a working unit of the Gutenberg Press within that time so that it can hit the markets as soon as possible. It definitely helps to have a demonstrative unit when convincing potential buyers.\"</p>\n<p>Karmin affirmed and returned an equally satisfied smile, trying his hardest to stop his lips from quivering as he anticipated the long hours that will be spent deconstructing this beast of a contract.</p>\n<hr>\n<p>As Guy turned a corner into an alley after exiting The Burning Forge, he doubled over onto his knees and released a long sigh of relief. This was his very first business pitch, and he was freaking out!</p>\n<p>From the beginning, Guy wanted Karmin to take him seriously and consider investing from a professional standpoint. He knew that Karmin had hitched his wagon with Guy from way back, and he would readily agree to anything as long as it wasn't flagrantly disadvantageous. In fact, Guy had a hunch that Karmin would still agree even if it was disadvantageous, albeit begrudgingly. Guy could have very easily asked Karmin to turn The Burning Forge into the Sect's finance front. It would have been easy to do, heck Guy could have \"urged\" Karmin to do so with his unique powers if the man was teetering towards a disagreement. But Guy didn't want to do that.</p>\n<p>For the True World Sect to sustain itself and succeed, its source of income needs to be robust and legitimate. Guy couldn't rely on others for this, it had to be purely through his own initiative.</p>\n<p>Spearheading innovation. That was the name of the game. Developing novel products that made life easier for people and businesses. Guy could sell inventions that existed in his past life that didn't exist here. It was something most, if not all transmigrators attempted and succeeded in doing. But as established earlier, Guy knew that it wasn't a sustainable venture.</p>\n<p>What use was having a horde of innovative and inquisitive minds if he was the only one outputting ideas? The Sect was basically a think tank filled with endless creativity. If Guy taught the members well, they could in turn innovate and develop new products and solutions that could be monetised. Verum Trading Company would act as a platform for them to prototype, market and float their ideas. This way, the kids would learn to apply their knowledge and gain motivation from achieving tangible results.</p>\n<p>Guy didn't have to participate in innovation actively, he could light the fuse with a few key products like the Printing Press, which he rightly affiliated with the original inventor. Down the line, Guy planned to create the Lathe and the Milling machine as well, the two fundamental machines that revolutionised the modern industry. With the clause in the contract which awarded the Sect with a complimentary unit, Guy planned to teach the Sect members how to use these machines so that they could fast-forward innovation and prototype their ideas quickly.</p>\n<p>Guy had laid out an elaborate plan of action to raise his Sect and turn it into an unshakeable monolith. That was the only way he could implement meaningful changes on a global scale. The business would play a huge role in this goal.</p>\n<p>With manufacturing out of the way, once Karmin signed the contract, Guy had to now worry about distribution. The Sect's business could not build a brick-and-mortar store in commercial districts, after all. And no business would go out of their way to a rural village to buy goods they had never heard of and transport them where they were needed. Verum Trading Company had to deliver their products to the customer somehow.</p>\n<p>Surprisingly, Markus came through on this matter. Guy walked briskly through a few alleys and roads and finally reached a rather high-class restaurant called The Golden Plate in the city's entertainment district.</p>\n<p>This area was usually frequented by the wealthier segment of the market and was thus clean and rarely crowded. There were regular patrols by the local law enforcement, therefore crime was a rare occurrence here. In fact, being caught by law enforcement would be the best-case scenario for any criminal in these parts.</p>\n<p>Guy's purpose here was to meet his second possible investor, and a prospective distribution channel for the Verum Trading Company.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/dmi9pnuj3vi5qds5afhiaec\">Chapter 198 - Hitting up an Old Friend</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/furnaf02bjstadyokbk7xv7\">Chapter 196 - Blast from the Past (from Another World)</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}