{"pageProps":{"note":{"id":"X7S7vmBdRxpsXASEYSXm3","title":"Chapter 079 - Small Flame in the Darkness","desc":"","updated":1643656533690,"created":1643651996213,"custom":{},"fname":"volume-2.chapter-079","type":"note","vault":{"fsPath":"vault"},"contentHash":"0bf0d8d42c101aeda89a732d97146679","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-079","id":"X7S7vmBdRxpsXASEYSXm3","vaultName":"vault"},"value":"tags.Look","alias":"#Look","position":{"start":{"line":80,"column":1,"offset":6588},"end":{"line":80,"column":6,"offset":6593},"indent":[]},"xvault":false,"to":{"fname":"tags.Look"}},{"type":"wiki","from":{"fname":"volume-2.chapter-079","id":"X7S7vmBdRxpsXASEYSXm3","vaultName":"vault"},"value":"tags.It...","alias":"#It...","position":{"start":{"line":112,"column":1,"offset":9377},"end":{"line":112,"column":7,"offset":9383},"indent":[]},"xvault":false,"to":{"fname":"tags.It..."}},{"type":"wiki","from":{"fname":"volume-2.chapter-079","id":"X7S7vmBdRxpsXASEYSXm3","vaultName":"vault"},"value":"volume-2.chapter-080","position":{"start":{"line":139,"column":3,"offset":10468},"end":{"line":139,"column":27,"offset":10492},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-080"}},{"from":{"fname":"volume-2.chapter-078","id":"9E5yA61FRjkyULReXFkOM","vaultName":"vault"},"type":"backlink","position":{"start":{"line":121,"column":3,"offset":9971},"end":{"line":121,"column":27,"offset":9995},"indent":[]},"value":"volume-2.chapter-079"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-079---small-flame-in-the-darkness\">Chapter 079 - Small Flame in the Darkness<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-079---small-flame-in-the-darkness\"></a></h1>\n<p>In the following hour, Al gushed unceasingly about the personage known as Guy Larks. He was so enthusiastic in describing Guy, that even Goran was drawn in.</p>\n<p>'I've never seen Al talk so eagerly about anyone!' Goran commented internally. In fact, ever since he'd met Al, Goran had never seen Al praise anyone! So in seeing him shower such gracious praises to this as of yet unknown character, Goran already had a high opinion on Guy.</p>\n<p>\"And you heard about the Dwarven Metal alternative, called steel, that The Burning Forge's been advertising, right? Well, half of the credit in creating that alloy actually goes to Guy! Karmin Zola came in personally and foisted a bunch of gifts and weapons on me as a sign of gratitude,\" Al added.</p>\n<p>\"So that's why the clan received a gratuitous shipment of steel weapons and armours from The Burning Forge. That man Karmin's a true-to-heart, sly businessman! But I've got to give it to him, though. He does know how to maintain a consistent quality with his products. And steel really isn't something to joke about! The clan verified the claims that steel is a true alternative to Dwarven Metal, and the elders were all confounded by how close it was to the real deal!\" Goran responded with amazement.</p>\n<p>Al nodded and responded, \"I know. If not for the minor inconsistencies in carbon composition, you could sell it off as Dwarven metal.\"</p>\n<p>\"What's carbon?\" Goran retorted.</p>\n<p>\"It's an element that is contained in all living organisms. In fact, it is the element that the coal in your hand is composed of,\" Al answered.</p>\n<p>\"Where did you get that from?\"</p>\n<p>Al unleashed a wide smile and declared, \"Guy Larks! Let me tell you, that kid has the most insane theories, and the interesting thing is that it is possible to verify all of them. So-\"</p>\n<p>'There he goes again...' Goran sighed. He nodded along as Al continued to gush about Guy. In his mind though, he was assessing whether the man could be of use to his daughter. Having tried the novel spell circle that produced fire, and witnessing just how little mana it consumed, Goran was now a little hopeful about his daughter's prospects. On top of that, after hearing that another kid without an aptitude for cultivation was able to advance to the Late stage of Mana Condensation realm, he was even more fired up.</p>\n<p>Therefore, while Al was rambling, Goran sent a voice transmission.</p>\n<p>'Josie, please call Jean up to the salon. Uncle Jeeves is here to see her.'</p>\n<p>'But my Lord, Miss just changed out into her workwear.'</p>\n<p>'It's fine! Just tell her to come as is. And hurry!'</p>\n<p>\"You're not paying attention,\" Al said dejectedly.</p>\n<p>\"No! No, of course, I am. You were speaking about something called a wand?\" Goran retorted without breaking a sweat.</p>\n<p>\"Right, the magic wand! This was something Guy made. Do you remember that article I was talking about a few years ago? The one by Maine Baxter on her 'Incomplete Tests and Theories'?\"</p>\n<p>\"Of course I do...\" Goran said sarcastically.</p>\n<p>Al bit his tongue apologetically and elaborated, \"It was about variable enchantments. That is, inscribing an enchantment capable of exhibiting multiple enchantments.\"</p>\n<p>\"I vaguely recollect you talking about it. I think you said that it was 'stupid, pointless, and utterly devoid of any meaning whatsoever,\" Goran chimed in.</p>\n<p>Al smiled embarrassedly and muttered, \"And yet you remember that?\"</p>\n<p>\"Anyways, I was totally wrong back then! Guy took the idea and turned it into something with unrivalled applications. As you must have already realised, that modular spell has a much lower mana cost. The magic wand is imbued with a special version of the variable enchantment, of his own design, that further reduces the cost by offloading the burden of maintaining spell integrity at longer ranges onto it. It was so effective that I was able to cast an unlimited amount of |Fireball| spells without pause!\"</p>\n<p>\"That's amazing!\" Goran exclaimed. \"Do you have this wand with you?\"</p>\n<p>\"Unfortunately I don't. He only made one, and that was for his student. I never thought about asking him to disclose the formula either, it's bad manners, right?\"</p>\n<p>Goran nodded in understanding. Then, as if anticipating something, Goran and Al both turned towards the door to the salon and wore a gentle smile. After a quick half-minute, they heard an audible knock.</p>\n<p>\"My Lord. Young Miss Jean is here,\" Josie's respectful voice resonated from the other side. Immediately after, the door opened and a teenage girl walked through.</p>\n<p>She wore a simple, yet evidently overused apron over an equally simple and overworked outfit that screamed practicality. There were no additional adornments that indicated individuality or frivolity. Nor did she wear any jewellery that highlighted her sharp and exquisite features.</p>\n<p>Her hair was tied up in a tight bun, leaving a small string cascading over her forehead onto her face. Her expression was stagnant, unwavering. To any stranger, it would come across as cold and uncaring. Just like a haughty princess, filled with disgust, and unempathetic of those under her station.</p>\n<p>However, Goran and Al were unfazed by her look, since they knew that it wasn't voluntary. She just couldn't outwardly express any elevated emotions. Not because she was unwilling to, but that she was unable to do so.</p>\n<p>\"Good morning, Uncle Jeeves,\" the girl spoke and bowed lightly in Al's direction.</p>\n<p>\"Jean! Stop being so formal. Come! Sit!\" Al beckoned wholeheartedly.</p>\n<p>In response, Jean simply nodded and approached the empty set next to her father.</p>\n<p>\"You called, Father? Is it to discuss the new findings from the last tests?\" Jean asked while gazing in Al's direction. Assuming it to be the case, Jean started enunciating her discovery, \"Uncle, following the previous tests with the latest iteration of the cure, we came across a few weird phenomena-\"</p>\n<p>But before she could continue, Goran quickly interrupted her and urged anxiously, \"Wait! Before that! Jean, the reason I called you here is to tell you that your Uncle might have finally found a solution to raise your cultivation.\"</p>\n<p>Jean sighed and said, \"Father... We've tried everything, haven't we? Even Teacher Way, who everyone's been gossiping about, said that I don't have any future in cultivation...\"</p>\n<p>Goran shook his hand and said, \"Who cares about him?! Forget about what that arrogant prick sputtered! Here, take these!\"</p>\n<p>Goran shoved the sheet of paper with the modular spell drawn on it, as well as the lump of coal, into Jean's hands and looked towards her expectantly.</p>\n<hr>\n<p>Jean gazed at the two inconspicuous items in her hands and looked back at her father in confusion.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Look (Private)</a> at what you did to your father! He's become an idiot!#</p>\n<p><em>There has to be a reason! He wouldn't just hand you a lump of coal without any purpose.</em></p>\n<p>As if he had heard the debate running within her head, Goran elaborated, \"The sheet has a spell circle drawn on it. I want you to cast that spell.\"</p>\n<p>Jean nodded in understanding and evaluated the spell circle. As her eyes scanned the intricate lines and designs within the drawing, her brows furrowed in confusion.</p>\n<p>\"What spell is this?\" She asked out loud. It was something she had never seen before.</p>\n<p>One must know that for the longest time, Jean and her father had been tirelessly pursuing ways for her to cultivate. For her father, the reason for this was to persuade the clan elders of Jean's competence as the future leader.</p>\n<p>But for Jean, this pursuit held a higher purpose. No matter how much Jean crammed various medical knowledge, alchemical formulae, and factoids on herbology, it wouldn't change the fact that she would be nothing more than a regular, mortal physician.</p>\n<p>Jean's one and only dream was to follow in her mother's footsteps and become a healer. And after personally witnessing her mother's demise, this dream had turned into an unwavering resolve.</p>\n<p>'No child should have to see their parents die!' She declared at that time.</p>\n<p>However, the first step into becoming a healer, if not the most important step, was to become a mage.</p>\n<p>This was something that Jean, after a long and arduous search, had learned was an impossibility for her. Her difficulty wasn't that she couldn't understand the multitude of cultivation methods stored in the clan's vaults, nor was it that she was crippled in some way and unable to circulate mana.</p>\n<p>The problem was something more profound, and rather intangible. The issue was housed within her mind, in the form of the two entities that constantly bickered amongst each other, one of whom regularly egged her to end her own existence.</p>\n<p>Cultivation is a process that requires immense concentration and immersion. This was something Jean was cursed to never be able to achieve.</p>\n<p>After facing repeated rejections and failures, Jean was ready to give up. Yet her father was not. And honestly, Jean was not eager to burst her father's bubble either. In many ways, she found that this search was one thing that kept her father from entering a self-destructive spiral.</p>\n<p>So, Jean continued to entertain her father and also immersed herself in the search. She looked through countless cultivation methods, memorised nearly all the spells available to her level, internalised countless theoretical books on magic, all in the hopes of finding something that might be of aid to her.</p>\n<p>Thus, she found it odd to see a spell that had a design completely unlike anything she had ever seen before.</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#It... (Private)</a> It looks so beautiful!#</p>\n<p><em>It truly is! There is order in the design. Not like those haphazardly drawn ones!</em></p>\n<p>'Wait a minute! You both agree?' She responded.</p>\n<p>To that, she received nothing. The voices had turned speechless, for the first time in her entire life!</p>\n<p>Jean gulped loudly and followed the spell circle with her utmost concentration.</p>\n<p>She placed the sheet of paper on the table and started to form the spell circle in her free hand. The process was seamless, as she had performed this step countless times before. However, compared to those other times, Jean somehow felt a little hopeful in facing the completed spell circle.</p>\n<p>For the first time since forever, Jean prayed, 'Please work...'</p>\n<p>Jean channelled her mana towards the spell circle and waited.</p>\n<p>Immediately after, the spell circle started to rotate, and from its centre, a small mote of fire materialised.</p>\n<p>\"It... It worked...\" she uttered in disbelief.</p>\n<p>\"It worked!\" Her father added with overwhelming joy in his voice.</p>\n<p>\"Of course it works! You should trust in Guy,\" Uncle Al affirmed smugly.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/vPgdWOfEZU9pJZqbORJ9F\">Chapter 080 - True Competition</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/9E5yA61FRjkyULReXFkOM\">Chapter 078 - Putting in a Good Word</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}