{"pageProps":{"note":{"id":"XJLDPx0qxPekOZrJzZMYE","title":"Chapter 083 - Reunion","desc":"","updated":1651421712700,"created":1643652150477,"custom":{},"fname":"volume-2.chapter-083","type":"note","vault":{"fsPath":"vault"},"contentHash":"76ad9996fd9ff156c0f408552a4cdfb4","links":[{"type":"wiki","from":{"fname":"volume-2.chapter-083","id":"XJLDPx0qxPekOZrJzZMYE","vaultName":"vault"},"value":"tags.Humph","alias":"#Humph","position":{"start":{"line":26,"column":1,"offset":1937},"end":{"line":26,"column":7,"offset":1943},"indent":[]},"xvault":false,"to":{"fname":"tags.Humph"}},{"type":"wiki","from":{"fname":"volume-2.chapter-083","id":"XJLDPx0qxPekOZrJzZMYE","vaultName":"vault"},"value":"volume-2.chapter-084","position":{"start":{"line":127,"column":3,"offset":10183},"end":{"line":127,"column":27,"offset":10207},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2.chapter-084"}},{"from":{"fname":"volume-2.chapter-082","id":"YmlRySAILnJP8yojEzFCh","vaultName":"vault"},"type":"backlink","position":{"start":{"line":113,"column":3,"offset":9441},"end":{"line":113,"column":27,"offset":9465},"indent":[]},"value":"volume-2.chapter-083"}],"anchors":{},"children":[],"parent":"9BHUWZMl1JRvE5LoAphKR","data":{}},"body":"<h1 id=\"chapter-083---reunion\">Chapter 083 - Reunion<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-083---reunion\"></a></h1>\n<p>The leg of the journey from Wayward Town to Twilight Village was unbearably uncomfortable due to the charged atmosphere. Having learnt of Markus' \"asinine\" actions, Marie turned eerily silent. However, rather than tranquillity, her current composure resembled that of a malefic bomb at the cusp of exploding.</p>\n<p>Marie assumed her seat at the carriage leading the caravan, which also happened to be occupied by Uncle Jeeves and Jean's Father. Jean had tried to reason with Marie and asked her to accompany her in the carriage, but Marie immediately declined, stating that, \"It was her job to guide\". However, Jean could already glean that it was all a facade. Marie was probably hoping to be as close as possible to the front so that she could charge at Markus the moment they arrived.</p>\n<p>\"That girl... is a bit vivacious,\" Josie commented.</p>\n<p>Jean nodded affirmatively and exhaled with mirth. \"She is fun!\"</p>\n<p>\"The Young Miss must not associate herself with people like her,\" Josie said morosely.</p>\n<p>\"Why is that?\"</p>\n<p>\"The Young Miss is of a higher stature and background!\" Josie affirmed righteously.</p>\n<p>Jean hummed in thought, and followed up with a question, \"Would mother avoid people \"below her\"? Is it right for a healer to discriminate against people just because they are of a different socio-economic class?\"</p>\n<p>Josie immediately corrected herself by stating, \"However the Young Miss has more responsibilities! The Young Miss is not just a prospective healer, she is also the next leader of the Rasmus Clan!\"</p>\n<p>\"It's still quite early to declare that...\" Jean interjected with a wry intonation.</p>\n<p>\"The Young Miss must not get disheartened! This slave firmly believes that the Young Miss is -\"</p>\n<p>\"\"destined to soar through the heavens!\"\" Jean and Josie both said at the same time. Jean immediately followed up by asking, \"What if I don't want to soar through the heavens? What if I just want to dwell in the world of mortals and make it better?\"</p>\n<p><a title=\"Private\" href=\"https://wiki.dendron.so/notes/hfyvYGJZQiUwQaaxQO27q.html\" target=\"_blank\" class=\"private\">#Humph (Private)</a>! Are you even worthy to make such a declaration?!#</p>\n<p><em>Don't listen to her! You can do it!</em></p>\n<hr>\n<p>Josie looked down with a crestfallen expression. 'Madam, the Young Miss is so much like you... I am afraid I can no longer dissuade the Young Miss from following in Madam's footsteps. I can only pray that I can protect the Young Miss from the many dangers of the world. I must not fail Madam's final task of keeping the Young Miss safe!'</p>\n<p>Right as Josie's internal soliloquy reached an end, Marie declared from the front of the caravan, \"We've arrived!\"</p>\n<p>Once the carriage stopped, Jean and Josie exited, along with Al and Goran. Marie hopped down from the carriage and walked forward, towards a narrow path sloping upwards. Unfortunately, the path wasn't wide enough to accommodate the carriage, and it seemed that their destination was at the end, hence everyone started to trudge along the unfinished passage.</p>\n<p>Jean was growing increasingly anxious and excited with every step, given the prospect of finally achieving her dreams. Goran was equally excited for the very same reason. Josie didn't display any outward emotions, except internally she was both conflicted and assured. The former, because she didn't want her Young Miss to face the dangers that followed stepping into the path of magehood, and the latter because she firmly wished for her Young Miss to find her happiness. </p>\n<p>Al was simply elated to meet Guy once again. He had built a close friendship with the man and really wished to continue many of their unfinished conversations. Marie, though, was simply growing angrier and angrier with each step. After a point, her rage was so evident that it overpowered everyone else following her.</p>\n<p>And like that the group finally reached the orphanage at the end of the path. Before they could take another step, a masculine voice, familiar to some and unfamiliar to others, resonated from behind the building.</p>\n<p>\"W-Wait Grace! Let me explain, it's not what you think!\"</p>\n<p>The frantic pleas were immediately doused by an angry feminine voice, \"Shut up! You PERVERT! I should've known... You're all the same! I thought you would be different. But how could you do this? And that too, to a little boy?! Get over here!\"</p>\n<p>Al and Goran immediately extended their mana sense to examine the fracas. After observing the scene, their expressions warped in confusion. Al was straight up stumped at the sight, however, Goran's expression slowly turned into a frown. Before Al could voice out his doubt, a seminude figure ran out from behind the building with a wronged expression. Following the figure, was a fully dressed female waving a stick vigorously.</p>\n<p>\"Stop right there!\" the woman shrieked.</p>\n<p>\"I'll stop if you'll listen to my explanation!\" the man retorted.</p>\n<p>\"Matron please! Master didn't do anything!\" a boy, around 13 years of age, rushed behind the woman and pleaded.</p>\n<p>\"MARKUS!\" Marie shouted as she rushed towards the boy waving another stick, which had seemingly materialised out of nowhere.</p>\n<p>\"Sis, what are you doing here? Teacher Jeeves? Oh no! Sis wait- I can explain! No!\" And with that, the scene devolved into utter chaos.</p>\n<p>Two men, one old and another young were both being chased by two women, one old and another young, both of whom were waving a stick.</p>\n<hr>\n<p>Krish's lips twitched in embarrassment as he observed the slapstick routine. He wanted to walk over and intervene, however, he held himself back considering the presence of the three new mages.</p>\n<p>He was somewhat familiar with the Core Condensation mage called Al Jeeves. He was a noteworthy figure in the kingdom, and his name was spread far and wide. However, Krish had heard that the man was an infamous recluse.</p>\n<p>\"So what is he doing here?\" Krish muttered his doubt out loud.</p>\n<p>The other two weren't so familiar. The unknown man was also at the Core Condensation realm, albeit gauging his cultivation indicated that he had only recently broken through. One must note that for a Tesseract Transformation realm, immortal, recent could be deciphered as anywhere within the last two decades.</p>\n<p>The unfamiliar woman was less noteworthy as she had only reached the Core Formation realm. An inspection of her cultivation and state of core integrity told Krish that this may be her final stop in magehood. Her cultivation had reached a bottleneck many years back and had thus stagnated ever since. If she couldn't ease through that bottleneck since then, it was highly unlikely that she would achieve anything different now.</p>\n<p>The last person of unknown origin was just another mortal girl. A deeper inspection into her didn't offer anything special, so Krish simply left it at that.</p>\n<p>He then sighed out loud and resumed his watch, while suppressing his growing annoyance.</p>\n<hr>\n<p>\"Whatever... Just... I would appreciate it if you didn't strip in front of the kids...\" Grace muttered while scratching the back of her head embarrassedly.</p>\n<p>\"<em>sigh</em>... Again, Grace, it wasn't a voluntary action,\" Guy added in defeat.</p>\n<p>The awkward display that took place in front of the orphanage simmered down once the two women tired themselves out. Guy had superior stamina due to his recent breakthrough, and although Markus was still in the Late stage of Mana Condensation realm, his constant training had given him an increased edge over his sister. Once the two ladies were subdued, Guy explained his piece succinctly and appeased Grace after much trouble.</p>\n<p>Marie, however, was not yet fully convinced and pulled Markus away in order to properly grill the chap.</p>\n<p>Before Grace left, she handed Guy a change of clothes, who immediately adorned them to address the guests.</p>\n<p>\"Teacher Jeeves! It's so good to see you again. I apologise for that display earlier,\" Guy said with a smile while shaking the man's hand.</p>\n<p>Al laughed mirthfully and replied, \"I sort of figured what happened after I noticed that you had broken through to Foundation Establishment. Congratulations!\"</p>\n<p>\"Thank you! It just sort of came out of nowhere, and caught me unprepared,\" Guy replied with a bitter smile. He then turned to face Goran, Jean and Josie and said with a respectful tone, \"It's an honour to meet a few of Teacher Jeeves' friends. Honestly, I'm grateful that he has someone else to depend on. I worried that he would one day disappear into the books at the Academy library, without anyone to drag him out.\"</p>\n<p>Goran chuckled at the joke and answered, \"My name is Goran Rasmus, this is my daughter Jean Rasmus and her attendant, Josie. The pleasure is all ours, Teacher Larks.\"</p>\n<p>Guy immediately waved his hands and corrected Goran, \"Oh no! I don't think I legally qualify for that title.\"</p>\n<p>Goran smiled mysteriously and added, \"I'd rather not get entangled with all those technicalities. In my books, anyone capable of training a budding mage to achieve perfected resonance at such a young age is more than qualified to call themselves a teacher!\"</p>\n<p>Guy's eyes narrowed with suspicion. He turned to face Al, who responded with an equally mysterious, yet warm smile.</p>\n<p>\"I'm not sure I-\" Them something hit Guy. Before he could voice out his realisation, another voice shrieked in surprise, \"Markus achieved perfected resonance?!\"</p>\n<p>It was Jean, who reacted a little uncharacteristically, attracting the adult's attention.</p>\n<p>Goran immediately widened his eyes at his daughter's outburst and said to Guy, \"I apologise for my daughter's disrespectful behaviour.\"</p>\n<p>He then looked at Jean meaningfully, to which the girl followed with her apology, \"This one begs for Teacher Larks' forgiveness.\"</p>\n<p>\"Come on now! Let's not act so formally. In fact, I empathise with your reaction. You just happened to voice out my thoughts before I could,\" Guy replied so as to assuage the parties.</p>\n<p>\"Speaking of which,\" Guy continued. \"Are you sure, Teacher Jeeves? To my knowledge, for someone to achieve perfected resonance, they need to meld perfectly with their cultivation method.\"</p>\n<p>Al nodded in confirmation, \"That is correct. What's the issue?\"</p>\n<p>\"See that's the thing... Markus does not practice any cultivation method. So how was he able to achieve perfected resonance?\" Guy said with an unsure tone.</p>\n<p>When he finished, everyone looked at each other thoughtfully.</p>\n<p>\"That's... intriguing...\" Al commented.</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/4OKMDdOkLHaZsHH8bHZVF\">Chapter 084 - Positive Changes</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/YmlRySAILnJP8yojEzFCh\">Chapter 082 - Fast Friends</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}