{"pageProps":{"note":{"id":"ztell9j5ts7v9fkfeaueloo","title":"Chapter 303 - ...and Into the Fire!","desc":"","updated":1681152802933,"created":1678863305991,"custom":{},"fname":"volume-5.chapter-303","type":"note","vault":{"fsPath":"vault"},"contentHash":"420b334f6956725029f44ed77dd9cd4f","links":[{"type":"wiki","from":{"fname":"volume-5.chapter-303","id":"ztell9j5ts7v9fkfeaueloo","vaultName":"vault"},"value":"volume-5.chapter-304","position":{"start":{"line":91,"column":3,"offset":10496},"end":{"line":91,"column":27,"offset":10520},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5.chapter-304"}},{"from":{"fname":"volume-5.chapter-302","id":"x9xit5xf99buc5qiv4661pi","vaultName":"vault"},"type":"backlink","position":{"start":{"line":103,"column":3,"offset":9525},"end":{"line":103,"column":27,"offset":9549},"indent":[]},"value":"volume-5.chapter-303"}],"anchors":{},"children":[],"parent":"7f1i5ikp5i8gyae20lcyt09","data":{}},"body":"<h1 id=\"chapter-303---and-into-the-fire\">Chapter 303 - ...and Into the Fire!<a aria-hidden=\"true\" class=\"anchor-heading icon-link\" href=\"#chapter-303---and-into-the-fire\"></a></h1>\n<p>Shuri stood at attention and, despite being frozen with apprehension, tried her hardest to maintain a neutral yet confused expression, all the while being in the midst of a small throng of teens and children all garbed in a similar attire indicative of the Sect they were a part of. Everyone was currently at the assembly area, which was like a moderately large auditorium built against the mountainside to provide a better viewing experience for the audience.</p>\n<p>As a professional survivor, Shuri wanted to make sure that her time here - for however long that may be - was uneventful. By no means did she want to stand out. Unfortunately for her, the circumstances of her enrolment registered her unique presence in Markus' memory. This, along with the enthusiastic boast of her impeccable memory, her actions after entering the Sect, her failure to hold back her greed, and her over-indulgence in the addictive bounties of the library had inevitably elevated Markus' impression of Shuri.</p>\n<p>This wasn't optimal. If she was to leave in the future, she needed to ensure that she wouldn't be missed in the Sect. The fewer people who knew her, the less she would be sought after.</p>\n<p>'It's only Markus for now. Over time, he may forget about me if I continue to show a slightly below-average level of performance in whatever task is assigned to me. However, I ABSOLUTELY CANNOT afford to attract the attention of others!'</p>\n<p>It was a delicate balancing act, really. Shuri NEEDED to extract as much out of the Sect as she could, but she had to do so without giving it away.</p>\n<p>At that moment, a crowd made up of new faces walked towards the stage. Shuri recognised Markus and Matron Grace Reva. There were two little girls, one looked similar to Kano (probably his twin Dora whom he would infrequently talk about) and the second looked thinner and incredibly timid. There were two teens, one who looked about Shuri's age and another that was older just by a smidgen. The former carried herself with a familiar bearing common amongst aristocratic children - she was probably Jean Rasmus. Shuri hypothesised through the order of elimination the latter was Marie, the elder sister Markus mentioned to some members a few days ago.</p>\n<p>And then there were the two adult males. The one following Markus, and the younger of the two, walked with an approachable yet authoritative aura. This was probably Sect Leader Guy Larks - the man in charge of the True World Sect and Markus' Master. However, he looked nothing like Markus' descriptions. The man was far too... handsome.</p>\n<p>\"It's good to see so many familiar faces again,\" Sect Leader Larks started with a genial smile. His eyes scanned the crowd before coming to a stop at Shuri.</p>\n<p>\"And a new one?\"</p>\n<p>'SHIT!' Shuri cursed internally. Her plan fell apart mere seconds into the assembly.</p>\n<p>\"Oh, right!\" Markus exclaimed. \"Master that over there is Shuri. I recruited her into the Sect during my return. I... will explain the details later.\"</p>\n<p>\"That's okay,\" Sect Leader Larks said with a wave of his hand. \"The more, the merrier.\" He turned towards Shuri and added, \"It's good to have you as part of the True World Sect. I hope that you find everything you want here with us.\"</p>\n<p>Shuri stepped aside and bowed in gratitude. As she glanced up at Sect Leader Larks, she caught a fleeting twitch on the right side of his face, followed by a mumbling of words and a stern frown in his right eye. However, his expression quickly transformed into a sincere smile that betrayed no hint of annoyance, though his body language gave him away.</p>\n<p>'What's that all about? Something fishy, no doubt.’</p>\n<p>\"I believe Markus has intimated everyone with the Sect, what we have to offer, what our values are, and what we expect from each member,\" Sect Leader Larks orated to the crowd. \"Till now, your focus should have been primarily on augmenting your literacy and covering the basics. Now that I have returned, we will be moving on and starting with the fundamental purpose of a Sect, which is to practice magic and cultivation.\"</p>\n<p>An excited round of applause, which Shuri partook in, of course.</p>\n<p>\"For most of you here, magic is an arcane concept that was beyond your reach. It was probably something you wrote off from your life since it wasn't something you felt you could harness. But I am here to tell you otherwise. Magic is achievable by just about anyone.\"</p>\n<p>A daring statement, but Shuri could believe it. Markus shouldn't have been able to cultivate if what he said about his incompatibility with most basic cultivation methods was to be trusted.</p>\n<p>\"All it takes is grit and ingenuity!\" Sect Leader Larks declared with a challenging glint in his eyes. \"It isn't as easy as it sounds. The two characteristics do not work in isolation but in tandem. Applying grit without ingenuity is no different from mundane labour, and ingenuity without grit results in half-assed work.\"</p>\n<p>\"Now, this doesn't mean that all efforts applied in pursuing an innovative cause will lead to success. The path to success is paved with failures, after all. Failures do not indicate that you must give up. But, that also doesn't mean you must wade through years of failures just to get to that one singular success you dreamed of. After all-\"</p>\n<p>Sect Leader Larks turned to his side and gestured for Markus and Jean to walk on stage.</p>\n<p>\"-your two predecessors have already paved a path of failure for you. You don't necessarily have to follow their path. You can create your own. But only do so if you are confident that you can handle the seemingly endless string of failures. Alternatively, if you are finding it difficult to start your own path, you can take theirs and decide to step outside the path along the way.\"</p>\n<p>\"In more technical terms, Markus and Jean here have formed specialisations in a particular branch of magic. If their specialisation is something you find yourself interested in, I encourage you to seek them out and pick their brains. Maybe work with them in their research. Sometimes, by assisting others in their pursuits, you may find something interesting that will help you find your own special path.\"</p>\n<p>\"The sessions for magical theory will be added to your schedules. Only those who meet the minimum requirement for literacy will be allowed to participate. Note that once you qualify, you will be moved from the basic literacy stream to the intermediate level, where we will be studying topics beyond those required to survive a mundane life. This is where most of you will find yourself eventually. If I find that you can handle the intermediate level, we will be moving you to the advanced level which will be primarily self-study wherein the curriculum will be provided by us, and where you will be tasked with completing various assignments. Everyone will eventually reach this level with time, but there is an option for early advancement at my discretion. Once you are at this level, you will have more agency in how you handle your time, but you will also have additional responsibilities.\"</p>\n<p>At that moment, the boy named Revian raised his hands. Sect Leader Larks turned to the boy and invited his question.</p>\n<p>\"Do these levels correspond to our position in the Sect? Such as the Outer, Inner and Core?\"</p>\n<p>\"We do not believe in those divisions in this Sect. These levels are assigned purely to separate the cohort into buckets so that learning can be optimised. As more people join the sect, the intermediate levels will be handled in generational batches. Everyone will be learning at the same pace, but their starting point will be lagging by a generation. The goal is, of course, for everyone to reach the advanced level within a set period, which I can guarantee. All these keywords may sound alien and confusing but do not worry. The aim of the True World Sect is for everyone here to become proficient in magic and have the tools to advance by themselves.\"</p>\n<p>Shuri absorbed the words and pondered over their implications. She would be crowded in with the intermediate levels of this batch since she had displayed enough literary proficiency (it would have been more suspicious for a presumed runaway from a well-off family to not have that level of education). The problem lay in whether she should push herself to reach the advanced level early. Reaching that level would provide her with the much-needed agency she so sorely needed to pursue her desires at her own pace. She was confident that she could achieve it without trouble, but could she afford to stand out that much? What about those \"responsibilities\" - wouldn't they just ingrain her deeper into the Sect?</p>\n<p>\"Finally, before ending this speech. I’d like to introduce you to the final member of our Sect,\" Sect Leader Larks said while gesturing for the old man (who Shuri had somehow overlooked) to walk on stage. The man hobbled up the stage with his walking stick, followed closely by Marie.</p>\n<p>\"This is Mage Krish Nara. He is Marie's Master. Everything that you have been told about approachability does not apply to him. Do not come to him with your problems- do not annoy him in general-\"</p>\n<p>\"You’re making me sound like a villain~\" Mage Nara interrupted with a cough and a wry smile. \"You... kids...\"</p>\n<p>His words were directed to the crowd, but his face was strained as he tried to put on a warm smile. \"Treat me, as you would treat anyone else in the Sect.\"</p>\n<p>\"But you aren't just 'anyone',\" Marie interjected. \"My Master here is in the Tesseract Transformation realm and has been alive for many millennia. He may not be all 'there' with modern lingo, so be careful not to offend him by saying something he wouldn't understand.\"</p>\n<p>As Mage Nara whacked his Disciple's head, Shuri caught herself from collapsing on her weak legs.</p>\n<p>'T-Tesseract Transformation realm!'</p>\n<p>DANGER! DANGER!</p>\n<p>Shuri swallowed a gulp and attempted to, albeit unsuccessfully hide behind one of her peers.</p>\n<p>\"Oh! And I will also like to get involved in this assistantship program you proposed, Sect Leader,\" Marie stated whilst evading yet another tap from her Master. \"However I can only accept a single person.\"</p>\n<p>\"Wha-\" Mage Nara began. But his sentence was immediately cut short when his Disciple raised her hand and pointed directly into the crowd.</p>\n<p>\"Uh? Me?\" The girl standing before Shuri voiced her surprise.</p>\n<p>\"Not you. Please move out of the way.\" The dreaded words were spoken.</p>\n<p>Shuri looked up and was confronted by the point of Marie's index finger, bearing down on her like an executioner’s blade.</p>\n<p>\"I want... you!\"</p>\n<hr>\n<p><strong>Next</strong></p>\n<ul>\n<li><a href=\"/TGT/notes/8o8bps9gncpt8gv40udfgr7\">Chapter 304 - Getting Out of a Forced Commitment</a></li>\n</ul>\n<hr>\n<strong>Backlinks</strong>\n<ul>\n<li><a href=\"/TGT/notes/x9xit5xf99buc5qiv4661pi\">Chapter 302 - Out of the Frying Pan...</a></li>\n</ul>","noteIndex":{"id":"qbtgkpXE56GehWIIYUPlK","title":"The Good Teacher","desc":"","updated":1704920084194,"created":1643479838816,"custom":{"nav_order":0,"permalink":"/"},"fname":"root","type":"note","vault":{"fsPath":"vault"},"contentHash":"97ed7241a4594feec67aae35dd5ec391","links":[{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"miscellaneous","position":{"start":{"line":17,"column":3,"offset":895},"end":{"line":17,"column":20,"offset":912},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"miscellaneous"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-1","position":{"start":{"line":18,"column":3,"offset":915},"end":{"line":18,"column":15,"offset":927},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-1"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-2","position":{"start":{"line":19,"column":3,"offset":948},"end":{"line":19,"column":15,"offset":960},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-2"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-3","position":{"start":{"line":20,"column":3,"offset":983},"end":{"line":20,"column":15,"offset":995},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-3"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-4","position":{"start":{"line":21,"column":3,"offset":1018},"end":{"line":21,"column":15,"offset":1030},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-4"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"volume-5","position":{"start":{"line":22,"column":3,"offset":1053},"end":{"line":22,"column":15,"offset":1065},"indent":[]},"xvault":false,"sameFile":false,"to":{"fname":"volume-5"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.NoHarem","alias":"#NoHarem","position":{"start":{"line":45,"column":22,"offset":2510},"end":{"line":45,"column":30,"offset":2518},"indent":[]},"xvault":false,"to":{"fname":"tags.NoHarem"}},{"type":"wiki","from":{"fname":"root","id":"qbtgkpXE56GehWIIYUPlK","vaultName":"vault"},"value":"tags.LGBTQ+","alias":"#LGBTQ+","position":{"start":{"line":45,"column":31,"offset":2519},"end":{"line":45,"column":38,"offset":2526},"indent":[]},"xvault":false,"to":{"fname":"tags.LGBTQ+"}}],"anchors":{"summary":{"type":"header","text":"Summary","value":"summary","line":10,"column":0,"depth":2},"authors-note":{"type":"header","text":"Author's Note","value":"authors-note","line":37,"column":0,"depth":2}},"children":["hsfwh1drgon77m1i871e0g7","fcXPPXnqRPOkAUPWFcYHh","YmDf44XQK0snHWr4HCNuj","9BHUWZMl1JRvE5LoAphKR","hk3a0wjaksh6uap9l9fm0wn","enpadrm33suumrdjl5t6gt2","7f1i5ikp5i8gyae20lcyt09","24l34m2lf1dxtfcp94uyznb"],"parent":null,"data":{},"body":"\n![Front_Cover](./assets/images/TGT_JUL2021.jpg)\n\n## Summary\n\nGuy Larks was famous in his original world for his widespread charity work in poverty-stricken and war-torn nations.\nHe was especially known for his efforts in developing schools and educational facilities for children, as well as teaching and nurturing many students.\n\nSo it was devastating news to learn that he wouldn't live past his 30th year.\n\nBut he was given a second chance! A new life in another world, as a down-by-the-dumps teaching apprentice in a world of magic and wonder. He was given no cheat, just a Repository of Knowledge holding all the information he could bring with him from his previous life.\n\nIn this new world, Guy rediscovered his life's true calling! Ride along on Guy's journey as he changes the world one budding mind at a time, as the greatest teacher this world has ever seen!\n\n**State of Story**:\n\n* [[miscellaneous]]\n* [[volume-1]] [COMPLETED][FREE]\n* [[volume-2]] [COMPLETED][LOCKED]\n* [[volume-3]] [COMPLETED][LOCKED]\n* [[volume-4]] [COMPLETED][LOCKED]\n* [[volume-5]] [ONGOING][LOCKED]\n\n**Discord**:\nhttps://discord.gg/PKbqtembQJ\n\n**Expected Upload Frequency**: \n3 Chapters per Week \nw/ min. 1500 Words per Chapter\n\n## Author's Note\n\nThis is a slice-of-life-ish story at its core. This is NOT a hot-blooded, high-octane novel filled with conflicts and fights around every corner. If that is the kind of story you are looking for, unfortunately, you will not find it here (at least not in the early chapters).\n\nThe MC is a modern man, with modern sensibilities. Conflicts are handled civilly, or avoided altogether. There will be fights, but the story does not revolve around it.\n\nThe MC is mature, and handles relationships tactfully. There will be a slow-burn romance in this story, and ABSOLUTELY NO HAREM. I despise that genre from the bottom of my heart!\n\nI also have some LGBTQ+ elements planned for the future (with side characters).\n\nEnglish not first language. Writing mistake? Please forgive. Proofread many times before upload, problems not much. If issue, then point out mistake, I correct immediate. I am thank you for you're understanding :)\n\nALSO: I started writing this story with one intention in mind, and that was to act as a parody of existing novels with similar themes. However, around CH25, I realised that my work was becoming too derivative and boring. So I pivoted and decided to make my novel its own thing. I believe that my work has become better because of it.\n\n**Additional Tags:** #NoHarem #LGBTQ+\n\n____\n\n> Word Count:\n>\n> Check out my Discord Server: https://discord.gg/PKbqtembQJ\n> \n> Please VOTE WITH POWER STONES, REVIEW and ADD TO COLLECTIONS :)\n"},"collectionChildren":null,"customHeadContent":null,"config":{"version":5,"dev":{"enablePreviewV2":true},"commands":{"lookup":{"note":{"selectionMode":"extract","confirmVaultOnCreate":true,"vaultSelectionModeOnCreate":"smart","leaveTrace":false,"bubbleUpCreateNew":true,"fuzzThreshold":0.2}},"randomNote":{},"insertNote":{"initialValue":"templates"},"insertNoteLink":{"aliasMode":"none","enableMultiSelect":false},"insertNoteIndex":{"enableMarker":false},"copyNoteLink":{"aliasMode":"title"},"templateHierarchy":"template"},"workspace":{"vaults":[{"fsPath":"vault"}],"journal":{"dailyDomain":"daily","name":"journal","dateFormat":"y.MM.dd","addBehavior":"childOfDomain"},"scratch":{"name":"scratch","dateFormat":"y.MM.dd.HHmmss","addBehavior":"asOwnDomain"},"task":{"name":"","dateFormat":"","addBehavior":"childOfCurrent","statusSymbols":{"":" ","wip":"w","done":"x","assigned":"a","moved":"m","blocked":"b","delegated":"l","dropped":"d","pending":"y"},"prioritySymbols":{"H":"high","M":"medium","L":"low"},"todoIntegration":false,"createTaskSelectionType":"selection2link","taskCompleteStatus":["done","x"]},"graph":{"zoomSpeed":1,"createStub":false},"enableAutoCreateOnDefinition":false,"enableXVaultWikiLink":false,"enableRemoteVaultInit":true,"enableUserTags":true,"enableHashTags":true,"workspaceVaultSyncMode":"noCommit","enableAutoFoldFrontmatter":false,"enableEditorDecorations":true,"maxPreviewsCached":10,"maxNoteLength":204800,"dendronVersion":"0.83.0","enableFullHierarchyNoteTitle":false,"templateHierarchy":"template","enablePersistentHistory":false},"preview":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"automaticallyShowPreview":false,"enableFrontmatterTags":true,"enableHashesForFMTags":false},"publishing":{"enableFMTitle":true,"enableNoteTitleForLink":true,"enablePrettyRefs":true,"enableKatex":true,"copyAssets":true,"siteHierarchies":["root"],"writeStubs":false,"siteRootDir":"docs","seo":{"title":"The Good Teacher","description":"Repository of chapters","author":"Junior Sundar"},"github":{"enableEditLink":true,"editLinkText":"Edit this page on GitHub","editBranch":"main","editViewMode":"tree","editRepository":"https://github.com/juniorsundarCasual/TGT"},"enableSiteLastModified":true,"enableFrontmatterTags":true,"enableHashesForFMTags":false,"enableRandomlyColoredTags":true,"enableTaskNotes":true,"enablePrettyLinks":true,"searchMode":"lookup","assetsPrefix":"/TGT","siteUrl":"https://juniorsundarCasual.github.io","duplicateNoteBehavior":{"action":"useVault","payload":["vault"]},"theme":"dark","siteFaviconPath":"favicon.ico","siteIndex":"root"}}},"__N_SSG":true}